{
    "all_challenges": [
        {
            "challenge_name": "Gérer le défi de l'anxiété",
            "challenge_description": "Inquiétez-vous moins et profitez davantage de la vie avec notre défi éprouvé. Dites oui pour vous mettre au défi et vous vous sentirez mieux dans un mois.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Soignez votre routine de sommeil.",
                "C'est normal de demander de l'aide.",
                "Reconnaissez vos sentiments.",
                "Priez et demandez la direction de Dieu.",
                "Écrivez vos émotions.",
                "Visualisez quelque chose d'inspirant.",
                "Arrêtez les schémas de pensée négatifs.",
                "Trouvez les points positifs de la vie.",
                "Ayez de la compassion pour vous-même et votre anxiété.",
                "Examinez la racine de toute pensée négative.",
                "Développez votre courage pour affronter quelque chose que vous évitez.",
                "C'est normal d'avoir de l'anxiété. Reconnaissez les symptômes et apprenez à les contrôler.",
                "Listez les choses que vous évitez à cause de votre anxiété. Partagez-les",
                "Renforcez l'une de vos capacités d'adaptation en faisant des recherches",
                "Faire une routine de yoga sur Youtube spécifiquement pour l'anxiété",
                "Lisez quelque chose qui est bon pour votre santé mentale",
                "Réparez quelque chose qui a été endommagé par votre anxiété",
                "Allez dans un endroit qui vous détend et soulage l'anxiété",
                "Mangez aujourd'hui d'une manière qui fait du bien au corps, à l'esprit et à l'âme",
                "Faites quelque chose qui vous aide à vous ressourcer là où vous vous sentez épuisé",
                "Passez 20 minutes à écouter les sons de la nature",
                "Assurez-vous que vos flux de médias sociaux sont sans anxiété",
                "Travaillez sur votre discours intérieur, pas de mots méchants dirigés contre vous-même",
                "Faites un scan complet du corps. Où tenez-vous votre anxiété",
                "Concentrez-vous sur le sommeil et le repos et une heure de coucher saine",
                "Changez une chose dans votre journée qui améliorera votre anxiété",
                "Pratiquer la pleine conscience",
                "Faites défiler la pellicule de votre téléphone. Lorsque vous trouvez une photo qui vous fait sourire, partagez-la avec qui que ce soit d'autre dessus",
                "Tendez la main à quelqu'un qui, selon vous, pourrait également être aux prises avec de l'anxiété. Le simple fait d'en parler peut vous aider tous les deux",
                "Vérifiez votre objectif du jour 1. Quels sont vos progrès ?"
            ]
        },
        {
            "challenge_name": "Sentez-vous merveilleux",
            "challenge_description": "Passez votre temps qui vous fera vous sentir un peu plus génial et merveilleux en relevant ce défi affectif.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Réfléchissez aux choses incroyables que vous avez déjà faites cette année.",
                "Concentrez-vous sur le fait d'être positif",
                "Faites une liste des choses qui vous rendent heureux.",
                "Mangez vos collations d'enfance préférées.",
                "Danse autour de ta maison.",
                "Essayez de boire 8 verres d'eau.",
                "Regarde ton film préféré.",
                "Donnez une cure de jouvence à votre chambre/lieu de travail",
                "Regardez le coucher/lever du soleil tout en écoutant vos chansons préférées",
                "Faire un repas sain",
                "Achetez quelque chose que vous voulez vraiment (chocolat, fleur...)",
                "Faire quelque chose de gentil pour quelqu'un",
                "Créez votre propre playlist avec des chansons qui vous apportent de la joie",
                "Regardez les étoiles chaque fois que vous le pouvez",
                "Commandez votre plat préféré et faites-vous plaisir",
                "Aller se promener",
                "Faites votre boisson préférée à la maison",
                "Écoutez un podcast sur quelque chose qui vous intéresse",
                " Assemblez un puzzle ",
                "Regardez un film de votre enfance",
                "Faites votre propre pizza/repas préféré",
                "Envoyer un message de remerciement à quelqu'un sur Messenger/WhatsApp",
                "Portez vos vêtements préférés aujourd'hui.",
                "Apprenez un nouveau mot",
                "Faire un plan de menu pour la semaine",
                "Sortez avec vos enfants/frères et sœurs",
                "Complimentez 3 personnes aujourd'hui",
                "Enfin terminer le projet inachevé",
                "Pas de sucreries, de sodas ou de fast food aujourd'hui",
                "Planifiez une journée amusante avec votre famille"
            ]
        },
        {
            "challenge_name": "Vivre intentionnellement",
            "challenge_description": "Engagez-vous dans ce petit défi quotidien qui transformera votre vie pour devenir la meilleure version de vous-même",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Priez quand vous vous réveillez aujourd'hui. Remerciez Dieu pour une toute nouvelle journée pleine d'opportunités.",
                "Fixer une intention ou juste 3 objectifs pour la journée",
                "Soyez intentionnel avec les mots que vous prononcez sur vous-même et sur les autres",
                "Écrivez une liste de gratitude, essayez de l'incorporer chaque matin/soir",
                "Éloignez-vous des écrans au moins 1h avant de vous coucher",
                "Cuisinez quelque chose que vous aimez et mangez consciencieusement votre repas wsans aucune distraction",
                "Faites une séance de soins personnels, prenez un bain, faites un masque facial et profitez de chaque seconde du processus",
                "Prenez un journal de 20 minutes sur vos expériences ce mois-ci",
                "Éloignez votre téléphone pendant que vous mangez",
                "Récompensez-vous lorsque vous accomplissez vos tâches. Cela peut être aussi simple que de vous donner du temps pour faire quelque chose que vous aimez vraiment",
                "Regarde-toi dans le miroir et dis-toi que tu es belle et capable de tout",
                "Faire une séance de yoga/méditation de 15 minutes",
                "Écoutez de la musique entraînante. Choisissez d'avoir des chansons dans votre liste de lecture qui garderont vos émotions bonnes",
                "Exprimez votre créativité aujourd'hui. Dessinez, peignez, écrivez, dansez, faites quelque chose",
                " Partez en balade dans la nature ",
                "Faites le choix conscient d'utiliser les médias sociaux de manière judicieuse et consciente. Fixez des limites et choisissez le contenu qui affecte votre bien-être de manière positive",
                "Prenez 10 minutes pour écrire toutes les choses que vous aimeriez faire et faites un plan pour en faire au moins une le mois prochain",
                "Ne plus suivre les comptes Instagram que vous n'appréciez plus",
                "Permettez-vous de prendre quelques minutes pour vous asseoir et respirer. Soyez juste dans l'instant",
                " Offrez-vous une tranche de paradis. Allez dans votre pâtisserie préférée, achetez celle que vous préférez, asseyez-vous dans un endroit calme et savourez chaque bouchée ",
                "Faites attention à votre santé mentale. Soyez intentionnel et conscient de vos émotions et de votre état d'esprit. N'ayez pas peur de demander de l'aide quand vous en avez besoin",
                "Mangez et savourez vos repas aujourd'hui sans téléphone ni écran allumé",
                "Reconnectez-vous avec quelqu'un. Faites un plan avec un ami sur Messenger, Facetime, WhatApp, ou rencontrez-vous pour rattraper son retard",
                "Écoutez un discours de motivation sur Youtube",
                "Découvrez le blog Habitualize",
                "Consommer 3 types de fruits différents aujourd'hui",
                "Ecrivez 3 choses à accomplir demain",
                "Faire une marche intuitive",
                "Ecrire un journal pendant 10 minutes ou plus",
                "Rêvez grand. Définissez vos intentions. Créez un tableau de vision"
            ]
        },
        {
            "challenge_name": "Apprendre une nouvelle langue",
            "challenge_description": "Apprendre une nouvelle langue est un défi, mais cela peut aussi être amusant, simple et sans effort. Suivre le défi d'apprentissage des langues de 30 jours vous permettra de booster votre apprentissage des langues au quotidien.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Apprenez 5 nouveaux mots",
                "Essayez une nouvelle application de langue",
                "Regardez un film dans la langue que vous apprenez avec des sous-titres",
                "Rédigez des listes de courses/à faire dans votre langue cible",
                "Enseigner à quelqu'un des mots et des phrases",
                "Demandez 'Comment allez-vous?' à un ami",
                "Regardez un tutoriel pour quelque chose dans la langue",
                "Ecrivez sur votre expérience aujourd'hui",
                " Racontez quelque chose que vous faites ",
                "Regardez un tutoriel vidéo Youtube sur la langue",
                "Enseigner à quelqu'un 5 nouveaux mots",
                "Apprendre la grammaire de base",
                "Journal dans votre langue cible",
                "Lire un article de presse",
                "Parlez à une personne ou à votre animal de compagnie",
                "Modifier les paramètres de votre téléphone pour une journée",
                "Ecrire une critique pour un livre/film",
                "Lire quelque chose",
                "Enregistrez-vous en pratiquant la langue",
                "Ecrivez 40 mots que vous avez appris",
                "Ecrivez comment ce défi vous a aidé",
                "Pouvez-vous encore vous souvenir des mots que vous avez appris le jour 1 ?",
                "Répondre à un quiz en ligne sur la langue cible",
                "Enseigner à un membre de la famille avec 7 à 10 nouveaux mots",
                "Ecrivez 50 mots que vous avez appris",
                "Ecrivez quelque chose sur votre journée",
                "Écouter une chanson dans la langue",
                "Écris une histoire",
                "Écoutez le podcast",
                "Créez des cartes flash pour mémoriser facilement des mots"
            ]
        },
        {
            "challenge_name": "Défi de pleine conscience",
            "challenge_description": "La pratique de la pleine conscience aide à réinitialiser votre esprit et à avoir une perspective claire lorsque vous perdez votre concentration ou que vous vous sentez dépassé par la vie",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Avant de faire n'importe quelle tâche aujourd'hui, demandez-vous quelle est votre raison de faire la tâche et contemplez-la un instant",
                "Douche consciente. Visualisez laver vos pensées négatives et concentrez-vous sur la sensation de l'eau sur votre peau",
                "Avant d'aller dormir, écris 3 choses que tu as vraiment appréciées de la journée",
                "Pratiquez la gratitude. Commencez à vous concentrer sur des pensées positives et laissez aller votre schéma cérébral craintif et anxieux",
                "Réinitialisez votre posture chaque fois que vous vous asseyezn, redressez doucement votre dos",
                "Faites de l'exercice aujourd'hui et concentrez-vous sur les sensations physiques",
                "Pratiquez l'écoute active aujourd'hui. Cela signifie se concentrer sur ce que l'autre personne dit et répondre de manière appropriée",
                "Faites un scan corporel. Portez votre attention sur votre corps et envoyez le souffle vers toutes les zones de tension",
                "Trouvez un endroit paisible où vous pouvez vous asseoir et écrire ce que vous ressentez en ce moment",
                "Soyez curieux aujourd'hui. Entraînez-vous à vous intéresser à ce qui se passe et concentrez votre attention sur l'apprentissage",
                "Remarquez votre sens lorsque vous goûtez, touchez, sentez et entendez quelque chose",
                "Respiration consciente. Inspirez, maintenez pendant 3 secondes puis expirez",
                "Marchez en pleine conscience. Prenez position pour vous sentir connecté à la terre et solidement enraciné au sol",
                "Buvez une tasse de thé en pleine conscience. Concentrez-vous sur le goût, l'odeur et la chaleur",
                "Pratiquer l'écoute sans jugement lors d'une conversation",
                "Faites une chose à la fois et concentrez-vous uniquement sur cela",
                "Asseyez-vous confortablement, sentez vos pieds fermement ancrés au sol, le dos droit et les mains sur vos genoux. Concentrez-vous sur la respiration pendant un moment",
                "Écoutez-vous répondre au téléphone ou pendant que vous avez une conversation, la façon dont vous parlez, les mots que vous choisissez",
                "Appréciez tout aujourd'hui. Remarquez tout ce qui se passe et trouvez un moyen de l'apprécier",
                "Observer en pleine conscience. Décrire mentalement un objet en détails, la couleur, la texture, la forme…",
                "Asseyez-vous dans un endroit confortable et calme pendant un moment",
                "Faites une tâche à la fois et concentrez-vous sur ce que vous faites",
                "Pratiquez l'empathie envers quelqu'un qui vous bouleverse normalement",
                "Trouvez un article ou une vidéo sur les raisons pour lesquelles les erreurs et les échecs sont bons pour vous. Prenez-le à cœur afin de passer moins de temps à vous concentrer sur le passé",
                "Mangez en pleine conscience. Goûtez le plat et essayez de deviner combien d'ingrédients y sont entrés",
                "Regardez autour de vous. Regardez une feuille/un arbre/une fleur en particulier et concentrez votre attention",
                "Trouvez des films drôles, racontez des blagues drôles, écoutez des gens drôles. Riez autant que possible aujourd'hui",
                "Profitez des moments où vous devez attendre et soyez attentif en vous concentrant sur vos sens et votre respiration",
                " Brossez-vous les dents avec votre main non dominante aujourd'hui pour favoriser l'attention ",
                "Vérifiez toujours sur l'application Habitualizer et rappelez-vous d'être attentif à tout moment"
            ]
        },
        {
            "challenge_name": "Temps en famille",
            "challenge_description": "Le temps passé en famille offre de nombreux avantages, notamment renforcer la confiance, créer un lien émotionnel plus fort entre les membres de la famille, améliorer les compétences de communication, améliorer les performances scolaires et réduire les problèmes de comportement, ainsi que l'occasion de créer des souvenirs construits sur le plaisir, rires et convivialité",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Demandez à vos enfants de partager un type de chose qu'ils ont fait aujourd'hui ou qu'ils envisagent de faire. Proposez d'abord vos projets",
                "Apprenez à vos enfants un tour de cartes ou un jeu de cartes, ou jouez-en un que vous aimez tous les deux",
                "Choisissez un point de repère, une ville ou un pays qui intéresse votre enfant et passez du temps à l'explorer via Youtube ou Facebook",
                "Préparez un dîner spécial. Mettez des fleurs fraîches sur la table, allumez des bougies et prenez un moment pour exprimer votre gratitude d'être une famille",
                "Prendre une photo de famille",
                "Allez à l'église et priez ensemble",
                "Film familial et soirée pizza",
                "Faites-vous des portraits les uns des autres",
                "Préparer le dîner ensemble",
                "Jouer 'tu préfèrerais' ensemble",
                "Faire un puzzle ensemble",
                "Préparez un gâteau ou des biscuits pour votre famille",
                "Prévoyez un pique-nique en famille",
                "Jouer à des jeux vidéo ensemble",
                "Chantez des chansons de karaoké ensemble",
                "Promenez-vous ensemble après le dîner",
                "Jouer à un jeu de société ensemble",
                "Planifier un voyage ou des vacances",
                "Créez un moment privilégié pour raconter des blagues à votre enfant. Riez de lui aussi",
                "Préparez un dîner spécial pour votre famille",
                "Créer une bucket list familiale",
                "Regardez de vieilles photos de famille ou regardez de vieilles vidéos",
                "Aller faire une promenade/randonnée ensemble",
                "Regarder ensemble un lever (ou un coucher) de soleil",
                "Passez 15 minutes avec chaque membre de la famille",
                "Visitez un centre nature et appréciez sa beauté",
                " Participez aux activités parascolaires de votre enfant ",
                "Encouragez vos enfants dans leurs loisirs",
                "Surprenez vos enfants avec une sortie ou une activité ludique",
                "Dites-leur toujours combien vous aimeze eux"
            ]
        },
        {
            "challenge_name": "Sortez de votre zone de confort",
            "challenge_description": "Relever ce challenge vous amènera à devenir une personne plus forte, vous permettra de prendre confiance en vous grâce aux expériences, vous aidera à poursuivre votre développement personnel, et aura la chance de rencontrer de nouvelles personnes.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Lève-toi 1h avant d'habitude",
                "Dis salut!' à un inconnu au hasard",
                "Ne vous connectez pas aux réseaux sociaux et ne regardez pas la télévision pendant 24 heures",
                "Aller vers quelqu'un au travail et lui faire un compliment sincère",
                "Tendez la main à quelqu'un à qui vous n'avez pas parlé depuis un moment",
                " Prendre un chemin différent en allant au travail/à l'école ",
                " Avoir une conversation difficile avec quelqu'un sur un sujet que vous avez évité ",
                "Achetez quelque chose que vous n'achèteriez jamais à l'épicerie",
                "Commencer à apprendre une nouvelle langue",
                "Approchez-vous de l'étranger, souriez et faites-lui un compliment",
                "Demandez de l'aide si vous en avez besoin ou aidez quelqu'un sans qu'il le demande",
                "Faire des projets pour le week-end ou pour le jour de congé",
                "Essayez un nouveau passe-temps/sport que vous avez toujours voulu aussi",
                "Commencer une conversation avec un inconnu",
                "Essayez une désintoxication numérique aujourd'hui",
                "Créer un vision board (inspirez-vous sur Pinterest)",
                "Sortez-vous à un rendez-vous",
                "Demandez à quelqu'un un rendez-vous / complimentez quelqu'un qui vous intimide",
                "Lancez un blog/une chaîne youtube/ une page Instagram/ un livre, comme bon vous semble",
                "Allez dans un nouvel endroit pour manger ou pour emporter",
                "Commencez un nouveau défi avec un ami (vous pouvez en utiliser un à partir de cette application ou créer le vôtre)",
                "Essayez un nouvel entraînement (zumba, yoga, pilates, kickboxing, etc.)",
                "Offrez à quelqu'un un cadeau spontané",
                "Inscrivez-vous pour quelque chose de nouveau",
                "Prendre un nouvel itinéraire pour aller à la maison/au travail/à l'école",
                "Se coucher plus tôt que prévu",
                "Voyager dans un nouvel endroit",
                "Développer une nouvelle compétence",
                "Envoyer 5 messages de gratitude à 5 personnes",
                "Essayez un nouveau look"
            ]
        },
        {
            "challenge_name": "Trouver la paix intérieure",
            "challenge_description": "La paix intérieure calme notre esprit et nous permet de voir notre chemin beaucoup plus clairement, nous aidant à nous concentrer et à garder une trace de nos objectifs.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Essayez l'aromathérapie. Le parfum peut évoquer des souvenirs vifs et réalistes. Lorsque nous sentons quelque chose de bon, nous nous sentons détendus",
                "Planifiez pour demain. Cela vous donne non seulement plus de temps le matin, mais cela rend également votre vie plus calme et plus simple, vous laissant le temps de planifier à l'avance",
                "Avec nos vies occupées et distraites, il peut être facile d'oublier de montrer de l'appréciation aux personnes avec lesquelles nous interagissons tous les jours. Prenez le temps de montrer de la gratitude aux personnes qui vous entourent",
                "Essayez de manger quelque chose et concentrez-vous sur vos cinq sens. Concentrez-vous vraiment sur chaque sens, goût, odorat, toucher et vue.",
                "Désencombrez un espace de votre maison. C'est un chemin vers la guérison des blocages émotionnels et de la confusion intérieure. Créez un environnement calme et paisible",
                "Sourire dans le miroir. Cela peut sembler ridicule, mais cela a de nombreux avantages pour votre bien-être. Cela ralentit le cœur, détend le corps et libère des hormones pour contrer le stress",
                "Respirez profondément et fermez les yeux. Énumérez mentalement 5 choses pour lesquelles vous êtes reconnaissant. Cela peut faire passer vos pensées du négatif au positif",
                "Réglez une minuterie sur 60 secondes et concentrez-vous uniquement sur votre respiration. Remarquez comment ça sonne et comment votre corps se sent",
                "Prends un bain conscient. Prends du temps, éteins les lumières. Laisse l'eau couler sur ton corps et concentre-toi sur les sensations et la chaleur que tu ressens",
                "Créez un rituel thé ou café. Tout ce que vous avez à faire est de ralentir. Faites attention à ce que vous faites et savourez le goût",
                "Si votre corps est tendu tout au long de la journée, prenez un moment pour vous détendre. Respirez profondément, détendez vos épaules et desserrez votre mâchoire",
                "Fixez-vous 3 objectifs quotidiens. C'est un nombre gérable et cela vous permet d'avoir le temps et l'énergie mentale nécessaires pour vous concentrer sur eux de manière consciente et approfondie",
                "Essayez une méditation de 4 minutes. Réglez une alarme de 4 minutes sur votre téléphone, asseyez-vous confortablement, fermez les yeux et respirez naturellement. Si votre esprit commence à vagabonder, ramenez-le à votre respiration",
                " Serrez quelqu'un dans vos bras et prenez 3 grandes respirations ensemble. Respirer vous enracinera ",
                "Faites une pause numérique. Ne comptez pas sur vos appareils numériques comme source de confort. Ceux-ci créent un faux sentiment d'urgence et nous donnent l'impression qu'il nous manque quelque chose",
                "Au lieu de juger ce que quelqu'un dit,écoutez-les attentivement et prêtez attention à ce qui se dit ",
                "La marche est très apaisante pour le corps, l'esprit et l'esprit. Commencez par trouver un endroit approprié. Observez l'environnement autour de vous, arrêtez-vous et concentrez-vous sur les arbres, le feuillage et le sol sur lequel vous marchez",
                "Concentrez-vous sur le moment. Un conseil de base est d'arrêter de comparer le présent avec le passé et de vous concentrer sur ce qui se passe en ce moment. Cela peut être aussi simple que de concentrer votre attention sur une tâche que vous faites",
                "Lève-toi et respire. Sentez votre connexion à la terre",
                "Scannez votre corps et notez les sensations ou émotions physiques. Déchargez toutes les sensations, émotions ou sentiments désagréables à l'expiration. Remarquez toutes les sensations agréables et remplissez-les à l'expiration",
                " Dirigez votre attention sur ce à quoi vous pensez dans le présent. Être conscient de votre activité mentale peut vous aider à prendre du recul sur vos pensées ",
                "Connais-toi et Aime-toi",
                " Éloignez-vous des choses négatives ",
                "Identifiez et lâchez prise sur les facteurs qui freinent votre paix",
                "Ferme les yeux quand tu es en colère",
                "Arrêtez de vous soucier des autres, pensez à vous",
                "La paix vient en vivant une vie pleine de sens",
                "Priez toujours le matin au réveil et avant de vous coucher",
                "Résolvez les conflits de votre vie",
                "Accepter les limites pour favoriser la résilience"
            ]
        },
        {
            "challenge_name": "Routine nocturne",
            "challenge_description": "La routine nocturne a pour résultat d'obtenir suffisamment d'heures de sommeil, vous aurez une concentration plus nette et un niveau d'énergie plus élevé pour une journée productive le matin",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Réfléchissez à la journée. Écrivez au moins une chose qui s'est plutôt bien passée",
                "Prenez un moment pour communiquer avec Dieu par la prière. Ouvrez-lui votre cœur, libérez tout ce que vous avez à l'esprit et remerciez-le pour tout ce qui s'est passé pendant la journée. C'est un excellent moyen non seulement de pratiquer la gratitude, mais aussi de rester lié à Dieu.",
                "Prenez un moment pour réfléchir à ce que vous devez faire le lendemain et planifiez en conséquence.",
                "Prenez un papier et écrivez tout ce qui vous passe par la tête. Cela signifie seulement que vous pouvez vous endormir sans avoir à vous soucier de ce que vous ferez demain car c'est déjà écrit",
                "Ayez un bon environnement de sommeil. Maintenez la chambre à bonne température, utilisez des rideaux occultants ou un masque de nuit pour bloquer la lumière",
                "Écrivez un journal. Prenez le temps de faire une pause et de réfléchir",
                "Allumez des bougies parfumées et jouez une playlist relaxante",
                " Faites des étirements/yoga avant de vous coucher ",
                "Rédigez une liste de gratitude",
                "Lire un bon livre avant d'aller dormir. Aide à se détendre et à mieux dormir.",
                "Planifiez vos tâches du lendemain, nourriture, tenue, …",
                "Envoie une bonne nuit spéciale par SMS à quelqu'un que tu aimes",
                "Prendre une bonne douche ou un bon bain chaud",
                "Supprimez la caféine, l'alcool ou le sucre au moins 3 heures avant de vous coucher",
                "Méditez/priez. Soyez juste seul avec vos pensées",
                "Rangez votre place. Vous pourrez vous sentir plus calme et détendu",
                "Prenez un dîner léger avant de vous coucher",
                "Fixer des intentions pour demain",
                "Diffuser des huiles essentielles pour améliorer la qualité de votre sommeil",
                "Évitez de consulter vos e-mails, les actualités, d'étudier ou de travailler avant de dormir",
                "Ne vous couchez pas en ayant faim. Mangez des amandes, une banane ou du porridge pour vous aider à mieux dormir",
                "Evitez votre téléphone au moins 1h avant d'aller vous coucher",
                "Buvez du thé à la camomille ou une autre tisane (décaféinée) avant de vous coucher",
                "Prendre un bain ou une douche chaude environ une heure ou deux avant le coucher peut faire des merveilles pour vous aider à vous détendre à temps pour aller au lit",
                "Assurez-vous de boire de l'eau avant d'aller vous coucher. On perd de l'humidité quand on dort. C'est important de bien s'hydrater",
                "Se brosser les dents en 2 minutes",
                "Pensez à vos dernières 24 heures et écrivez au moins une chose qui s'est plutôt bien passée",
                "Écrivez les principales priorités pour demain dans un agenda ou un carnet.",
                "Réduire l'anxiété avec une liste de choses à faire",
                "Prie toujours avant de t'endormir et pardonne-toi"
            ]
        },
        {
            "challenge_name": "Affirmation positive",
            "challenge_description": "Ce défi peut aider à renforcer l'estime de soi en renforçant à la fois votre opinion positive de vous-même et votre confiance en votre capacité à atteindre vos objectifs.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "J'embrasse les possibilités et le potentiel de cette journée",
                "Je choisis d'être heureux et de m'aimer aujourd'hui",
                "Je suisdésireux de changer et de grandir ",
                "J'accepte les expériences en dehors de ma zone de confort",
                "Je suis talentueux et intelligent",
                "Les défis m'offrent des opportunités de grandir",
                "Je fais confiance à mon intuition pour me guider",
                "Je suis amoureux de moi et de mon corps",
                "Je suis en paix avec mon passé",
                "Je serai gentil avec moi-même et les autres aujourd'hui",
                "Je choisis la foi plutôt que la peur",
                "Aujourd'hui sera une journée positive",
                "Je suis reconnaissant pour tout ce que j'ai",
                "Je suis plus que mes pensées négatives",
                "Je m'accepte sans condition",
                "Je suis en bonne santé et heureux",
                "Tout ce qui se passe maintenant se passe pour mon bien ultime",
                "Je suis maître de ce que je ressens et aujourd'hui je choisis le bonheur",
                "Aujourd'hui, je ne vais pas me comparer aux inconnus sur Internet",
                "J'ai le pouvoir de créer le changement",
                "Mes sentiments et pensées sont valables",
                "J'ai l'abondance et la force intérieure",
                "Je suis prêt à voir les choses avec une nouvelle perspective",
                "Je suis digne d'amour et de respect",
                "Mon esprit est clair, fort et concentré",
                "J'affronte la journée avec énergie et courage",
                "Je suis inspiré et motivé par mes rêves",
                "Je mérite le meilleur et je l'accepte maintenant",
                "Je suis unique et confiant",
                "Je vois des opportunités infinies dans ma vie"
            ]
        },
        {
            "challenge_name": "Journal quotidien",
            "challenge_description": "La tenue d'un journal vous aide à contrôler vos symptômes et à améliorer votre humeur en : vous aidant à hiérarchiser les problèmes, les peurs et les préoccupations. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Ecrivez sur quelqu'un qui vous inspire",
                "Ecrivez environ 5 bénédictions dans votre vie",
                "Postez 30 faits sur vous-même",
                "Qu'est-ce qui t'excite ?",
                "Quelles sont les 3 leçons que vous voulez que vos enfants/amis/frères et sœurs apprennent de vous",
                "Ecrire sur un défi actuel",
                "Ecrire des solutions aux problèmes",
                "Écrivez ce que vous voulez apprendre à l'avenir",
                "Énumérez ce que vous aimez chez vos parents/famille",
                "A quoi ressemblerait ta journée parfaite ?",
                "Ecrivez toutes les choses que vous voulez réaliser cette année",
                "De quoi avez-vous besoin de plus dans votre vie ?",
                "Faites une liste des choses que vous feriez si vous n'aviez pas peur, et quel impact auraient-elles sur votre vie",
                "Quel conseil donneriez-vous à un enfant de dix ans ?",
                "Comment pouvez-vous rendre demain meilleur ?",
                "Ecrivez sur toutes les choses qui vous rendent nerveux et comment pourriez-vous changer cela ?",
                "Qu'est-ce que tu as appris hier ?",
                "Ecrivez sur une lutte passée que vous avez surmontée. Comment cela vous a-t-il rendu plus fort?",
                "Qu'est-ce que vous attendez avec impatience en ce moment ?",
                "Qu'est-ce qui t'apporte le plus de joie ? Comment peux-tu y consacrer plus de temps ?",
                "Qu'est-ce qui manque à ta vie ? Et comment peux-tu changer ça ?",
                "Ecrivez sur un moment où vous vous êtes senti fier de vous",
                "Si vous aviez 3 souhaits pour cette année, que souhaiteriez-vous ?",
                "Qu'est-ce que tu as en tête en ce moment ?",
                "Ecrivez sur quelque chose ou quelqu'un qui vous manque",
                "Qu'est-ce que vous appréciez le plus aujourd'hui ?",
                "Écrivez un moment de votre vie qui vous rend heureux quand vous y pensez",
                "Si la vie s'arrêtait aujourd'hui, que regretteriez-vous de ne pas avoir fait ?",
                "Comment voulez-vous que les gens se souviennent de vous et pourquoi ?",
                " De quels aspects de vous-même avez-vous besoin pour montrer plus d'amour ? "
            ]
        },
        {
            "challenge_name": "Routine du matin",
            "challenge_description": "Avoir une routine matinale peut augmenter votre énergie, votre productivité et votre positivité.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Asseyez-vous ou restez debout au soleil pendant 20 minutes pendant que vous suivez votre routine matinale, prenez votre petit-déjeuner, consultez les nouvelles ou faites de l'exercice",
                "Choisissez 3 choses à accomplir avant midi",
                " Donnez la priorité à votre journée. Quelles tâches espérez-vous accomplir aujourd'hui ? ",
                "Ce matin, prenez quelques minutes pour écouter vos pensées et vos sentiments, les identifier, et les décaler si besoin",
                "Rédigez une liste de choses à faire pour aujourd'hui",
                "Connectez-vous avec votre famille et vos amis ou envoyez un simple SMS de bonjour à quelqu'un que vous aimez",
                "Prenez une profonde respiration et dites merci pour cette journée",
                "Écris 5 choses dont tu es fier de toi",
                "Méditez pendant 15 minutes",
                "Boire un verre del'eau avant le petit déjeuner",
                "Ouvrez vos fenêtres pour aérer et laisser entrer le soleil",
                "Faites une promenade ou faites une séance d'entraînement à domicile",
                "Lisez quelques chapitres de votre livre préféré",
                "Faire un yoga de 15 minutes",
                "Écoutez un podcast ou un livre audio pendant que vous vous préparez",
                "Allez dehors et respirez l'air frais du matin",
                "Faire une liste de 3 choses à faire dans la journée",
                "Évitez de consulter les actualités du matin et les réseaux sociaux",
                "Faites votre lit et rangez votre espace pour vous sentir plus productif",
                " Choisissez une affirmation pour guider votre journée. Par exemple : Aujourd'hui est un grand jour ",
                "Prenez une douche et préparez-vous même si vous n'allez nulle part",
                "Ne vérifiez aucune forme de médias sociaux à la première heure du matin",
                "Au réveil, bonne idée d'attirance pour avoir de bonnes ondes toute la journée",
                "Rédigez une liste de gratitude matinale",
                "Écoutez votre playlist musicale préférée pour vous mettre de bonne humeur le matin",
                "Fais des étirements après ton réveil",
                "Faites-vous un petit-déjeuner sain et délicieux",
                "Ne vérifiez pas les notifications avant le petit-déjeuner",
                " Peignez, jouez d'un instrument de musique. Faites quelque chose qui alimente votre créativité ",
                "Réveillez-vous avec le sourire et une attitude positive pour la journée à venir"
            ]
        },
        {
            "challenge_name": "État d'esprit positif",
            "challenge_description": "Penser positivement est une habitude à laquelle nous pouvons nous entraîner. La recherche montre que cela a un impact positif sur la santé du corps et de l'esprit.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Entraînez-vous à sourire. Souriez aux étrangers, dans le miroir, souriez chaque fois que vous le pouvez. Vous vous sentirez tellement plus positif",
                "Appréciez les petites choses aujourd'hui. Le sourire de quelqu'un, le coucher du soleil, votre café du matin, la chaleur d'un rayon de soleil, le ciel",
                "Au lieu de penser 'ma vie est horrible', les choses ne vont pas bien en ce moment, mais cela passera. Des jours meilleurs arrivent",
                "Plutôt que de penser aux choses horribles qui pourraient arriver, pensez aux grandes choses qui pourraient découler de votre situation actuelle",
                "Au lieu de dire 'j'abandonne', dites 'c'est dur mais je vais continuer d'essayer'",
                "Arrêtez de vous soucier de ce que pensent les autres. Les pensées des autres ne sont pas conçues pour vous rendre heureux et positif",
                "Au lieu de penser 'pourquoi cela m'arrive-t-il ?', pensez 'qu'est-ce que cela m'apprend ?'",
                "Ayez confiance que de meilleures choses arrivent si vous êtes ouvert aux possibilités'",
                "Au lieu de penser 'Je ne peux pas faire ça', pense 'Je ne sais pas encore comment faire ça'",
                "Ne vous comparez à personne d'autre aujourd'hui. C'est une perte de temps totale",
                "N'oubliez pas que même si vous ne pouvez pas contrôler une certaine situation, vous pouvez contrôler votre réponse",
                "Méditez. Cela vous aidera à trop réfléchir, réduira votre stress et peut vous aider à être plus positif",
                "Pratiquez l'auto-parler positif. Vous pouvez utiliser des affirmations positives avec votre méditation",
                "Commencez ou terminez votre journée en écrivant votre journal de gratitude",
                "Entourez-vous de gens que vous aimez et qui vous aiment en retour",
                "Écoutez de la musique. La musique peut avoir un effet positif sur votre santé et votre journée",
                "Pratiquez l'acceptation. Appréciez tout ce que vous avez en ce moment",
                "Écoutez une vidéo/un podcast inspirant sur YouTube. Remplissez votre cerveau de motivation",
                "Cite 5 choses qui t'ont fait sourire aujourd'hui",
                "Au lieu de dire 'j'ai échoué', dites 'les erreurs m'aident à apprendre'",
                "Limitez le temps passé sur les réseaux sociaux. Passez plus de temps à créer et à travailler sur vous-même qu'à consommer le contenu des autres",
                "Écrivez vos principales priorités et vos plans pour l'avenir en sachant que vous réaliserez tout ce que vous voulez",
                "Restez présent et appréciez la beauté du moment. (Sentez le soleil sur votre visage, appréciez l'air frais….)",
                "Soyez fier de vous sur les petites victoires aujourd'hui (et dans votre quotidien)",
                "Changez votre humeur en faisant quelque chose que vous aimez vraiment",
                "Pour une situation à venir qui vous inquiète, écrivez le meilleur scénario qui puisse arriver",
                " Concentrez-vous sur les solutions, pas sur les problèmes ",
                "Lâchez les attentes des autres et concentrez-vous sur ce qui compte",
                "Entourez-vous de personnes positives",
                "Prenez soin de vous. Lorsque nous nous sentons mieux, nous pouvons voir les choses de manière plus positive"
            ]
        },
        {
            "challenge_name": "Amour de soi",
            "challenge_description": "S'engager dans une routine de soins personnels a été cliniquement prouvé pour réduire ou éliminer l'anxiétéet la dépression, réduire le stress, améliorer la concentration, minimiser la frustration et la colère, augmenter le bonheur et améliorer l'énergie ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Cite 10 choses que tu aimes chez toi",
                "Dites 'Merci' à vos cinq parties du corps dans le miroir aujourd'hui",
                "Écrivez une note chaque fois que vous êtes fier de vous. Mettez-la dans un pot 'Je suis fier de moi'",
                "Pardonnez-vous un regret auquel vous vous êtes accroché et laissez-le aller",
                "Écris une liste avec toutes les choses que tu aimes chez toi",
                "Traitez votre corps avec des aliments sains et beaucoup d'eau",
                "Nettoyez votre chambre/bureau/placard et nettoyez tout ce qui ne vous apporte plus de joie",
                "Prends-toi en photo et écris tout ce que tu aimes dans ton apparence",
                "Désabonnez-vous de toute personne qui vous rend mal à l'aise et mal dans votre peau",
                "Allez quelque part où vous pouvez regarder le lever/coucher du soleil et en profiter par vous-même",
                "Habillez-vous toujours pour vous-même. Portez votre tenue préférée aujourd'hui",
                "Réfléchissez à votre semaine et écrivez 5 choses pour lesquelles vous êtes reconnaissant",
                "Tiens un journal sur ce que tu ressens et sur ce qui se passe dans ta vie",
                "Allez à un rendez-vous avec vous-même. Allez dans votre restaurant préféré, allez à la plage… Quelque part où vous vous sentez bien et détendu où vous pouvez vous connecter",
                "Prévoyez-vous une récompense lorsque vous aurez terminé ce défi",
                "Faites une longue promenade et connectez-vous avec la nature",
                "Ecrivez le plus grand défi que vous avez surmonté",
                "Débranchez toute la journée de n'importe quel technicien (sauf si vous avez du travail à faire)",
                "Mangez votre plat ou dessert préféré",
                "Écrivez-vous une lettre d'amour",
                "Notez ce que vous avez appris de ce défi et n'oubliez pas votre récompense que vous avez planifiée au jour 15",
                "Qu'est-ce que tu aimais faire quand tu étais enfant ? Fais-le aujourd'hui",
                "Faire un repas nourrissant",
                "Rattraper un vieil ami ou un parent",
                "Faites une sieste dans l'après-midi",
                "Regardez un film que vous vouliez voir",
                "Faites un collage vidéo de vos selfies préférés",
                "Énumérez 5 choses dans lesquelles vous êtes vraiment bon",
                "Ecrivez sur une réalisation dont vous êtes fier",
                "Choisissez 3 affirmations positives à dire tous les jours. Ex. Je peux le faire."
            ]
        },
        {
            "challenge_name": "Améliorer la confiance",
            "challenge_description": "La confiance peut également vous donner une vision positive de la vie, augmentant votre bien-être mental et émotionnel.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Désabonnez-vous de tous les comptes de réseaux sociaux qui vous font douter de vous-même",
                "Travaillez à accepter les compliments plutôt qu'à les refuser aujourd'hui",
                "Soyez conscient de votre posture. Une bonne posture développe plus de confiance",
                "Faites quelque chose que vous aimiez faire quand vous étiez enfant",
                "Faites quelque chose de stimulant aujourd'hui, rappelez-vous que nous ne grandissons pas lorsque nous sommes dans notre zone de confort",
                "Ecrivez 10 choses que vous aimez chez vous",
                "Dites oui à quelque chose que vous ne feriez pas normalement",
                "Mettre en place une nouvelle habitude saine",
                "Parle quand tu as quelque chose à dire",
                "Concentrez-vous sur ce que vous voulez plutôt que sur ce que vous ne voulez pas",
                "Travaillez à améliorer vos compétences sur quelque chose que vous aimez faire ou que vous aimeriez commencer à faire",
                "Notez toutes vos réalisations, y compris celles à venir",
                "Faites un entraînement rapide, prenez une douche, préparez-vous et mettez une tenue qui vous fait vous sentir bien",
                "Sortez seul pour regarder le coucher de soleil",
                "Tendez la main à un vieil ami",
                " Trouvez des pensées positives pour chaque pensée négative ",
                "Donnez un bon conseil à quelqu'un",
                "Faites une séance d'entraînement que vous aimez",
                "Travailler sur de petites choses. Les petites réalisations font du bien",
                " Faites une pause et réfléchissez à quelque chose avant d'agir, au lieu de réagir impulsivement ",
                "Soyez authentique et embrassez votre unicité. La vie n'est pas une compétition",
                "Ne parlez pas négativement des autres pendant toute la journée",
                "Écris une chose que tu as faite pour ta famille",
                "Écrivez-vous une lettre d'amour",
                "Ecrivez 3 peurs et comment pouvez-vous les surmonter",
                "Identifiez un changement que vous souhaitez apporter et les étapes pour le faire",
                "Faites quelque chose qui vous fait vous sentir spécial",
                "Demandez à trois amis de vous dire ce qu'ils préfèrent à votre sujet",
                "Notez 3 de vos erreurs et leçons apprises",
                "Fixez-vous un objectif atteignable"
            ]
        },
        {
            "challenge_name": "Acte de gentillesse",
            "challenge_description": "Un acte de gentillesse peut renforcer les sentiments de confiance, de contrôle, de bonheur et d'optimisme. Il peut également encourager les autres à répéter les bonnes actions qu'ils ont eux-mêmes vécues, contribuant ainsi à une communauté plus positive.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Montrez votre soutien à quelqu'un aujourd'hui",
                "Donner du sang. Sauvez des vies",
                "Laissez un avis positif sur votre restaurant/café préféré",
                "Préparez un petit-déjeuner au lit pour un membre de la famille/un proche",
                "Demandez à quelqu'un comment vous pouvez l'aider - puis faites-le.",
                "Sourire à quelqu'un qui en a besoin",
                "Laissez un avis positif sur votre application préférée",
                "Donnez un pourboire au ramasseur d'ordures",
                "Demandez à vos parents/frères et sœurs/enfants s'il y a quelque chose que vous pouvez faire pour les aider",
                "Écris une liste des raisons pour lesquelles tu aimes quelqu'un et donne-la-lui",
                "Donnez un pourboire à quelqu'un",
                "Passez la journée à ne dire que des choses positives sur les gens",
                "Dites à quelqu'un que vous aimez combien vous l'appréciez",
                "Faites une corvée que vous ne feriez pas habituellement",
                "Dites 'Bonne journée' à au moins 3 personnes rencontrées",
                "Acheter un repas pour un SDF",
                "Aider quelqu'un avant qu'il ne demande",
                "Préparez des biscuits et offrez-les à quelqu'un",
                "Essayez de faire don de vêtements/jouets/livres à une association caritative locale",
                "Appelle quelqu'un à qui tu n'as pas parlé depuis un moment",
                "Le plus important de tout, soyez toujours gentil avec vous-même",
                "Écrivez une note de remerciement à quelqu'un qui a eu un impact dans votre vie",
                "Laissez quelqu'un passer devant vous en faisant la queue",
                "Surprendre quelqu'un avec un cadeau",
                "Mettez des notes autocollantes positives sur les miroirs",
                "Vérifiez auprès d'un parent âgé",
                "Faites 3 compliments honnêtes à quelqu'un que vous aimez",
                "Dites merci autant que vous le pouvez",
                "Complimenter quelqu'un",
                " Évitez les pensées négatives pendant une journée. Montrez-vous également un peu de gentillesse ! "
            ]
        },
        {
            "challenge_name": "Bien-être mental",
            "challenge_description": "En ce qui concerne votre santé mentale, les soins personnels peuvent vous aider à gérer le stress, à réduire votre risque de maladie et à augmenter votre énergie. Même de petits actes de soins personnels dans votre vie quotidienne peuvent avoir un impact important. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Gérer l'anxiété",
                "Avant d'aller dormir, écris 3 choses que tu as appréciées de la journée",
                "Pratiquer l'auto-compassion",
                "Pratiquez la pleine conscience. Tirez-vous vers le présent",
                "Passez du temps sur un passe-temps. Boostez votre humeur et engagez-vous dans une tâche que vous aimez",
                "Prenez une pause sur les réseaux sociaux pour la journée et concentrez-vous sur la vie qui vous entoure",
                "Plantez quelque chose. Prendre soin d'autre chose que de vous-même a de nombreux avantages mentaux.",
                "Pensez aux meilleurs moments de votre vie pendant que vous attendez quelque chose",
                "Apprenez à parler de bien-être mental à vos parents, éducateurs, amis, membres de la famille et autres personnes proches de vous.",
                "Ouvrez-vous à quelque chose qui vous passe par la tête",
                "Concentrez-vous sur le repos et la détente aujourd'hui et allez vous coucher tôt",
                "Allez vous promener sans regarder votre téléphone, concentré sur votre environnement",
                "Imaginez un endroit heureux chaque fois que vous vous sentez anxieux",
                "Lisez ou regardez quelque chose qui est bon pour votre santé mentale",
                "Imaginez votre vie de rêve et notez les étapes dont vous avez besoin pour y arriver",
                "Pratiquer un discours intérieur positif",
                "Renouvelez votre motivation",
                "Commencez à explorer la racine de toutes les pensées négatives",
                "Écrivez 5 choses pour lesquelles vous êtes reconnaissant",
                "Prenez soin de vous et prenez soin de vous",
                "Écrivez des affirmations positives et lisez-les avant de dormir",
                "Prenez 3 respirations profondes et complètes chaque fois que vous le pouvez",
                "Planifier un repas sain",
                "Criez à quelqu'un que vous appréciez.",
                "Appelle quelqu'un que tu aimes et dont tu n'as pas parlé depuis un moment",
                "Essayez une méditation guidée",
                "Apprenez une nouvelle compétence pour détourner vos pensées des problèmes et de l'anxiété",
                "Ecrivez un journal de tout ce qui se passe dans votre esprit",
                "Mangez un repas nutritif.",
                "Chante ta chanson préférée. Chanter aide à réguler la respiration et à diminuer l'anxiété"
            ]
        },
        {
            "challenge_name": "Corrigez votre horaire de sommeil",
            "challenge_description": "Ces défis quotidiens destinés à vous aider à adopter une routine saine au coucher, à dormir suffisammentp, et réveillez-vous en vous sentant rafraîchi chaque matin.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Mettez votre téléphone de côté pour que le lendemain matin vous deviez sortir du lit pour éteindre l'alarme",
                "Éteignez tous vos écrans 1h avant de vous coucher pour préparer votre cerveau à dormir",
                "Récompensez-vous avec un petit-déjeuner savoureux pour avoir plus de motivation pour vous réveiller tôt",
                "Douche le soir, une douche chaude ou un bain vous aidera à vous détendre avant de vous coucher",
                "Essayez de vous réveiller à la même heure tous les jours, la cohérence est la clé",
                "Après le dîner, mettez votre pyjama confortable, tenez un journal, lisez un coin et préparez-vous à vous détendre et à laisser votre esprit se détendre",
                " Buvez beaucoup d'eau après votre réveil, vous ne vous sentirez pas trop fatigué tout au long de la journée ",
                "Essayez de dîner tôt, puisque vous digérerez votre nourriture plus tôt, votre corps pourra se concentrer sur le sommeil réparateur dont il a besoin",
                "Faites une séance d'entraînement/course rapide le matin, cela vous aidera à vous sentir plein d'énergie pendant la journée et à avoir sommeil quand vous devriez aller vous coucher",
                "Méditez avant de vous coucher, c'est relaxant et anti-stress",
                "Ouvrez les fenêtres quand vous vous réveillez et laissez les rayons du soleil toucher votre peau",
                "Planifiez à l'avance vos activités ce soir et aussi votre liste de choses à faire pour le lendemain matin",
                "Écoutez votre playlist préférée après votre réveil pour vous mettre de bonne humeur",
                "Définissez un rappel qui vous alertera 30 minutes avant qu'il ne soit l'heure d'aller vous coucher",
                "Dépenser de l'énergie pendant la journée pour se fatiguer la nuit",
                "Arrêtez de boire de l'eau 1 heure avant de vous coucher pour ne pas avoir à vous réveiller pendant la nuit ou à vous lever pendant que vous essayez de vous endormir",
                "Fais ton lit après le réveil pour ne pas être tenté de te rendormir",
                "Écoutez de la musique légère avant de vous coucher, cela vous aidera à vous endormir rapidement",
                "Après le réveil, dirigez-vous directement vers la salle de bain pour vous laver le visage ou prendre une bonne douche",
                "Mangez des aliments contenant du magnésium (comme les amandes, les cacahuètes et les graines de courge) et du zinc pour améliorer la qualité de votre sommeil",
                "Respirez de l'air frais au réveil. Rafraîchissez vos pensées, ce qui aide votre cerveau à se vider le matin",
                "N'utilisez votre lit que pour dormir et faire l'amour. Ne regardez pas la télévision.",
                "Pas de caféine 6 heures avant l'heure de sommeil choisie",
                "Evitez de manger de gros repas avant de dormir",
                "Rendez votre pièce aussi sombre et silencieuse que possible",
                "Évitez les siestes. Cela peut perturber votre cycle de sommeil",
                "Établir une température fraîche et constante",
                " Ne vous couchez que lorsque vous avez sommeil ",
                "Éviter les conversations difficiles avant le coucher",
                "Lavez ou changez vos draps et taies d'oreillers"
            ]
        },
        {
            "challenge_name": "Prendre soin de soi",
            "challenge_description": "Prendre soin de soi signifie prendre le temps de faire des choses qui vous aident à bien vivre et à améliorer à la fois votre santé physique et votre santé mentale.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Planifiez votre journée et respectez-la",
                "Écrivez un journal, enregistrez vos émotions et vos expériences",
                "Pratiquez un passe-temps que vous aimez vraiment",
                "Lisez un livre préféré de votre enfance",
                " Faites de l'exercice à la maison. Recherchez des vidéos d'entraînement sur Youtube ",
                "Essayez de cuisiner quelque chose de nouveau",
                "Partage quelque chose auquel tu penses avec tes parents ou tes amis",
                "Créer une routine matinale",
                "Appelez votre famille et vos amis",
                "Résolvez un jeu de puzzle",
                " Faites des œuvres d'art. Vous pouvez trouver des idées sur Internet ",
                "Écoutez vos chansons préférées",
                "Jeux de société",
                "Ecrire une lettre à quelqu'un de spécial",
                "Suivez un cours en ligne pour acquérir de nouvelles compétences",
                "Regardez un nouveau film",
                "Faites une sieste puissante pour reposer votre esprit et votre corps",
                "Écoutez une partie du podcast",
                "Méditez pour calmer votre esprit et libérer de l'anxiété",
                "Prendre un bain relaxant",
                "Définissez vos objectifs pour l'avenir",
                "Chantez sur votre chanson préférée",
                "Chat vidéo avec quelqu'un que vous aimez",
                "Établir une routine de sommeil",
                "Pas de plainte",
                "Toujours trouver le temps de prier.",
                "Dites 'Non' à la négativité",
                "Nettoyez et organisez votre place",
                "Fixer un objectif pour la semaine prochaine",
                "Demandez de l'aide si vous en avez besoin"
            ]
        },
        {
            "challenge_name": "Étude efficace",
            "challenge_description": "Apprenez à réussir vos études. Fixez-vous des objectifs efficaces et clairs afin d'obtenir de meilleures notes, apprenez à gérervotre temps et améliorer vos compétences d'étude.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Organisez et nettoyez votre bureau pour étudier",
                "Planifier une session d'étude et préparer le matériel d'étude",
                "Surmontez vos faiblesses et trouvez votre objectif d'étude et votre motivation",
                "Étudiez votre programme et commencez à être actif dans votre cours",
                "Organisez toujours votre emploi du temps et prenez des notes",
                "Écrivez à la main vos notes et surlignez les mots clés",
                "Règle 50-10. Étudiez 50 minutes de chaque heure. Passez 10 minutes à nettoyer votre esprit",
                "Revoyez vos notes avant de dormir",
                "Réglez un minuteur et concentrez-vous uniquement sur une seule tâche",
                "Etudiez comme vous enseignez à quelqu'un",
                "Promettez-vous une récompense si vous accomplissez toutes les tâches",
                "Utilisez des couleurs et des surligneurs dans vos notes",
                "N'utilisez que Google et Youtube pour comprendre les concepts",
                "Mangez sainement. Votre corps se sentira mieux et vous serez plus alerte",
                "Résumer les notions",
                "Étudiez avec votre ami. Demandez à votre ami de vous interroger sur des sujets difficiles",
                "Revoyez ce que vous avez appris aujourd'hui ou cette semaine",
                "Utilisez des applications ou des cartes flash pour mieux apprendre",
                " Priorisez vos tâches. Effectuez d'abord les principales tâches ",
                "Utilisez la carte mentale pour organiser les informations",
                "Choisissez un lieu d'étude calme sans distractions",
                "N'oubliez pas de déstresser. Gardez votre niveau de stress bas et inquiétez-vous moins",
                "Revoyez vos notes avant de commencer vos devoirs",
                "Réétudiez les problèmes de devoirs, couvrez les réponses et testez vous-même",
                "Faites une liste de concepts ou de formules importantes",
                "Faites votre propre examen blanc",
                "Étudiez comme si l'examen surprise était demain.",
                "Dormez suffisamment car cela aide grandement à la rétention de la mémoire",
                "Recherchez des techniques de mémoire qui conviennent efficacement à votre étude",
                "N'ayez jamais peur de demander de l'aide"
            ]
        },
        {
            "challenge_name": "Relation de couple",
            "challenge_description": "Ce défi relationnel est conçu pour être facile à intégrer dans votre vie quotidienne. La plupart des défis ne devraient prendre que quelques minutes et peuvent être relevés à tout moment de la journée. Certains nécessitent un peu plus d'énergie et planification, mais cela en vaudra la peine.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Faites une liste des choses que vous aimez chez votre partenaire",
                "Planifiez une soirée surprise",
                "Dites à votre partenaire que vous l'aimez inconditionnellement",
                "Partagez la peur que vous avez à propos de votre relation",
                "Partagez un bon souvenir que vous avez de votre partenaire",
                "Envoyez à votre partenaire un message matinal romantique",
                "Remerciez votre partenaire pour quelque chose aujourd'hui",
                "Surprenez votre partenaire avec quelque chose de bien",
                "Partagez un objectif que vous avez pour votre relation",
                "Faites un compliment à votre partenaire",
                "Planifier un week-end",
                "Regardez ensemble de vieilles photos",
                " Souvenez-vous de votre première rencontre ",
                "Faire une bucket list ensemble",
                "Choisissez un mot au hasard et commencez une conversation profonde avec votre partenaire",
                "Faire un puzzle ensemble",
                "Écrivez une lettre d'amour à votre partenaire et cachez-la pour qu'il la retrouve plus tard",
                "Faites quelque chose que votre partenaire aime faire ensemble",
                "Faire une friandise préférée",
                "Dites à votre partenaire quelque chose dont vous vous souvenez qu'il aime",
                "Donnez à votre partenaire un bisou et un câlin surprise",
                "Offrez à votre partenaire un massage relaxant",
                "Faites le petit-déjeuner au lit de votre partenaire",
                "Jouer à un jeu de société ensemble",
                "Demandez-lui comment vous pouvez être un meilleur partenaire",
                "Laissez-lui un petit mot doux",
                "Promenez-vous ensemble",
                "Faites un compliment à votre partenaire aujourd'hui",
                "Répondez à un quiz relationnel",
                "Danse lente sur une chanson romantique"
            ]
        },
        {
            "challenge_name": "Désencombrer",
            "challenge_description": "Réduire l'encombrement dans nos vies, qu'il soit physique, numérique ou autre, nous permet de nous attaquer de front aux facteurs de stress et cela profite à notre santé mentale.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Nettoyez votre placard",
                "Organisez vos livres",
                "Organisez votre chambre",
                " Videz votre table de chevet ",
                "Triez votre courrier",
                "Organisez votre garde-manger",
                "Donnez vos vêtements inutilisés",
                "Espace libre de votre ordinateur ou ordinateur portable",
                "Nettoyez votre frigo et débarrassez-vous des objets périmés",
                "Cléune voiture",
                "Parcourir les vieux papiers et le courrier",
                "Videz votre congélateur",
                "Nettoyez votre portefeuille",
                "Organisez votre cuisine",
                "Débarrassez-vous de votre bureau ou de votre espace de travail",
                "Débarrassez-vous des vieux vêtements",
                "Organisez vos fournitures de nettoyage",
                "Organisez votre commode",
                "Supprimez les applications que vous n'utilisez plus",
                "Nettoyer les armoires à pharmacie",
                "Organisez tout dans des dossiers sur votre ordinateur",
                "Organisez votre salon",
                "Achetez des articles de rangement fonctionnels",
                "Purger les accessoires personnels",
                "Passez du temps à nettoyer votre voiture/moto/vélo",
                "Mettre à jour et organiser votre calendrier",
                "Enlever les plantes mortes et organiser les pots",
                "Organiser les produits secs (épices) et nettoyer les produits périmés",
                "Organiser et étiqueter les conteneurs de stockage et les étagères",
                "Méditez pour nettoyer votre esprit"
            ]
        },
        {
            "challenge_name": "Productivité",
            "challenge_description": "Une bonne productivité peut vous aider à vous fixer de meilleurs objectifs, à être plus efficace, à augmenter votre concentration et à stimuler votre motivation.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Fais ton lit le matin pour ne pas être tenté de te recoucher",
                "Ecrivez 3 choses pour lesquelles vous êtes reconnaissant chaque jour",
                "Organiser un espace encombré pour améliorer le lieu de travail",
                "Passez moins de temps au téléphone et soyez plus productif",
                "Utilisez un planificateur quotidien pour réaliser tout ce que vous avez prévu",
                "Désactivez les notifications inutiles sur le téléphone pour éviter les distractions",
                "Créer un plan de repas pour toute la semaine",
                "Faites une liste de choses à faire et essayez de terminer toutes les tâches",
                "Faire 30 minutes de marche pour prendre l'air et se sentir motivé pour conquérir le monde",
                "Désencombrez votre boîte e-mail. Parfois, cela peut être un peu écrasant",
                "Entraînez-vous pendant 30 minutes même si vous ne faites rien pendant la journée, vous vous sentirez super productif après votre entraînement",
                "Lire un chapitre d'un livre avant de se coucher pour oublier les réseaux sociaux",
                "Évitez de regarder la télé pour avoir plus de temps pour vous",
                "Organisez votre placard et donnez les choses dont vous ne voulez plus",
                "Créez une liste de lecture musicale avec vos chansons préférées et votre ligne de danse, personne ne vous regarde",
                "Ne regarde pas ton téléphone juste après ton réveil et passe une matinée lente et paisible",
                "Méditez pendant 10 minutes et vous vous sentirez rajeuni",
                "Organisez votre garde-manger et votre réfrigérateur.",
                "Nettoyez votre chambre en profondeur. Espace clair, esprit clair",
                "Désabonnez-vous des personnes qui ne vous apportent plus de joie. Vous vous sentirez beaucoup plus soulagé",
                "Prévoyez une période de repos dans votre journée pour avoir un peu de temps pour vous détendre",
                "Réveillez-vous plus tôt que d'habitude. Les gens qui réussissent commencent leur journée tôt.",
                "Lire des livres motivants et inspirants vous aide à retrouver confiance en vous",
                "Arrêtez d'essayer d'effectuer plusieurs tâches",
                "Faites une liste des choses que vous voulez arrêter de faire",
                " Bougez. Marchez. Étirez-vous. Asseyez-vous droit ",
                "Notez les idées qui vous viennent à l'esprit, mais ne commencez pas à travailler dessus. Planifiez-les",
                "Profitez d'un petit-déjeuner sain pour avoir l'énergie nécessaire pour être plus productif toute la journée",
                "Quand tu finis quelque chose, aussi petit soit-il, écris-le",
                "Déléguer. Vous n'êtes pas obligé de tout faire"
            ]
        },
        {
            "challenge_name": "Bonheur",
            "challenge_description": "Des études scientifiques montrent que le bonheur est associé à une foule d'avantages, notamment une productivité plus élevée, une plus grande créativité et une plus grande résilience face au stress.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Écrivez les choses que vous aimez chez vous",
                "Souriez à tous ceux que vous croisez",
                "Fait un peu d'exercice",
                "Préparer le diner",
                " Embrassez quelqu'un que vous aimez ",
                "Regarder un film comique",
                "Appelle un ami",
                "Danse comme si personne ne regardait",
                "Sortez dans la nature et soyez un explorateur d'un jour",
                "Achetez un cadeau pour quelqu'un que vous aimez",
                "Essayez de faire du yoga",
                "Allez vous coucher tôt et réveillez-vous tôt aussi",
                "Lire quelque chose d'inspirant",
                "Méditez pendant 10 minutes",
                "Planifier de futures vacances",
                "Essayez une nouvelle recette ou cuisinez votre plat préféré",
                "Regardez le beau coucher de soleil",
                "Connectez-vous avec votre vieil ami",
                "Pardonner à quelqu'un",
                "Essayer quelque chose de nouveau",
                "Allez fou une promenade dehors",
                "Écoute ta chanson préférée",
                "Faites un petit acte de gentillesse ou aidez un ami ou un voisin",
                "Partager un rire avec quelqu'un",
                "Faites un câlin à vos enfants/parents/amis/frères et sœurs",
                "Jouez avec votre chien ou d'autres animaux de compagnie",
                "Passez moins de temps sur votre téléphone",
                "Dites aux gens combien ils comptent pour vous",
                "Lâchez les personnes toxiques et les habitudes",
                "Réfléchissez à votre parcours depuis le premier jour"
            ]
        },
        {
            "challenge_name": "Défi de la liberté financière",
            "challenge_description": "L'un des avantages les plus importants de l'indépendance financière est qu'elle vous donne un plus grand contrôle sur votre propre vie. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Définissez vos objectifs financiers",
                "Créer le budget du mois prochain",
                "Développer un fonds d'urgence",
                "Découvrez les sites et blogs financiers",
                "Épargner pour la retraite",
                "Trouvez des vlogs de littératie financière sur Youtube",
                "Adopter le minimalisme",
                "Achetez un livre d'argent et commencez à le lire",
                "Envisagez votre carrière",
                "Automatisez votre argent",
                "Surveillez votre pointage de crédit",
                " Budgétisez votre argent ",
                "Trouvez des moyens de réduire votre facture d'épicerie",
                "Apprenez à calculer le pourcentage",
                "Explorez les moyens de générer des revenus supplémentaires",
                "Vendez ce dont vous n'avez pas besoin/utilisez",
                "En savoir plus sur l'investissement",
                "Trouvez une stratégie pour éviter les dépenses émotionnelles",
                "Journée moins dépensée",
                "Rédiger un plan d'épargne pour les futurs achats",
                "Chercher les moyens de réduire les factures",
                "En savoir plus sur la gestion de l'argent",
                "Apprendre les termes de base de la finance",
                "Apprenez comment fonctionnent les cartes de crédit",
                "Rédigez un plan pour rembourser vos dettes",
                "Trouvez des moyens de minimiser vos dépenses non essentielles",
                "Automatisez vos factures",
                "Célébrez vos progrès",
                "Inscrivez-vous au cours de littératie financière",
                "Restez sur le chemin de la liberté financière"
            ]
        },
        {
            "challenge_name": "Parentalité positive",
            "challenge_description": "La pratique d'une parentalité positive est un guide essentiel entre les parents et les enfants pour obtenir des résultats de développement positifs tels que l'estime de soi, la confiance, la compétence personnelle, des liens plus forts entre les parents et les enfants et un flux de communication meilleur et efficace.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Faites quelque chose avec votre enfant que vous savez qu'il aime",
                "Demandez à votre enfant quels sont ses favoris",
                "Faites du bricolage avec les enfants comme notre papillon en assiette en carton",
                "Passez au moins 30 minutes de tête-à-tête avec votre enfant",
                "Lire l'histoire de l'heure du coucher",
                "Promenez-vous ensemble",
                " Embrassez votre enfant quatre fois aujourd'hui ",
                "Cuisinez quelque chose pour votre enfant qu'il aime",
                "Prendre des photos ensemble ou même faire un photobooth DIY",
                "Demandez à votre enfant quelle chose spéciale il aimerait faire",
                "Emmenez-les dans leur endroit préféré",
                "Fabriquez une 'Happy box' ensemble",
                "Écrivez une histoire ensemble. Demandez à votre enfant de faire des dessins",
                "Faire des empreintes de mains ensemble",
                "Enseignez à votre enfant comment faire quelque chose de nouveau aujourd'hui",
                "Enseignez à votre enfant l'argent",
                "Mettez de la musique et dansez ensemble",
                "Faire un jeu de société en famille",
                "Obtenez-leur un petit cadeau et cachez-le dans la maison pour qu'ils le trouvent",
                "Faites cuire des muffins ou faites cuire des crêpes et apportez-les chez un voisin",
                "Faites ensemble une carte pour l'autre parent",
                "Dites des choses positives à votre enfant aujourd'hui",
                "Demandez-leur ce qu'ils en pensent",
                "Demandez à leur animal préféré et faites un projet amusant ensemble",
                "Enseignez à votre enfant une compétence de vie",
                "Partez en promenade dans la nature. Rassemblez les éléments d'une liste",
                "Passez une journée de couleur. Habillez-vous de couleur, mangez des aliments qui colorent.",
                "Faire un bricolage amusant pour les grands-parents",
                "Jouez ensemble avec de la pâte à modeler. Organisez des concours de moulage",
                "Demandez à votre enfant son souvenir préféré. Prévoyez de le refaire"
            ]
        },
        {
            "challenge_name": "Surmonter la dépression",
            "challenge_description": "Ce défi vous guide pour surmonter la dépression et vous rappelle qu'il y a un grand espoir de guérison. La dépression est hautement traitable. De nombreuses personnes souffrant de dépression se rétabliront complètement. D'autres trouveront un certain soulagement de leurs symptômes. Le combat est ça vaut le coup - la capacité de s'épanouir dans la vieaprès la dépression est là.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Le toucher est très important dans la guérison de la dépression. Caressez vos animaux de compagnie, étreignez vos amis et votre famille, reprenez vos relations sexuelles avec votre partenaire ou faites-vous masser.",
                "Sortez pour 15 minutes d'activité physique. Essayez de courir. Nettoyez la cour. Promenez-vous avec votre animal de compagnie.",
                "L'alimentation peut jouer un rôle important dans le soulagement de la dépression. Assurez-vous de bien manger et régulièrement, même si vous n'avez pas d'appétit",
                "Dormir suffisamment",
                "Souriez et changez votre posture pour changer ce que vous ressentez.",
                "Lisez des exemples positifs de la façon dont les gens ont surmonté des problèmes de santé mentale et sachez que c'est possible pour vous aussi.",
                "Oubliez le futur et le passé. Demandez-vous 'En ce moment, en ce moment même, qu'est-ce qui ne va pas?'",
                "Complétez vos vitamines pour augmenter les hormones du bonheur. Un manque de vitamine B3 et de vitamine D, qui est fabriquée dans la peau par la lumière du soleil, a également été lié à la dépression",
                "Écoutez votre voix intérieure. Est-elle dure ou critique ? Traiteriez-vous les autres avec le même jugement ? Ces pensées sont-elles constructives ou destructrices ?",
                "Assurez-vous de sortir tous les jours car la lumière du jour et la lumière du soleil augmentent la sérotonine et sont nécessaires pour la vitamine D",
                "N'ayez pas honte. Vous pourriez être surpris d'apprendre combien de personnes souffrent de dépression en silence. Parlez-en à votre famille et à vos amis.",
                "Couper les relations abusives",
                "Passez du temps avec votre animal de compagnie",
                "Tu es plus fort que ta dépression",
                "Écouter de la musique tous les jours",
                "Fais des choses qui te rendaient heureux même si tu n'en avais pas envie",
                "Éviter l'isolement",
                "Le rire est un antidote important contre la dépression.",
                "Fais ce que tu aimes",
                "Éviter l'alcool et les drogues",
                "Trouvez une opportunité de bénévolat pour vous sentir moins seul",
                "Savoir quand s'engager ou se désengager du monde en ligne",
                "Trouvez quelque chose à espérer",
                "Faire le contraire de ce que suggère la 'voix de la dépression'",
                "Trouvez de petits moyens d'être au service des autres",
                "Ne vous attardez pas sur les problèmes. Concentrez-vous plutôt sur la bonne solution",
                "Ayez des objectifs réalisables pour vous donner un sentiment d'accomplissement",
                "Soyez reconnaissant et remarquez 3 bonnes choses chaque jour",
                "Demandez à un proche de vous contacter régulièrement.",
                "Défiez les pensées négatives."
            ]
        }
    ]
}