{
    "all_challenges": [
        {
            "challenge_name": "Anksiyete Mücadelesini Yönet",
            "challenge_description": "Kanıtlanmış meydan okumamızla daha az endişelen ve hayattan daha çok zevk al. Kendine meydan okumak için evet de, bir ay içinde daha iyi hissedeceksin.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Uyku düzeninize dikkat edin.",
                "Yardım istemekte sorun yok.",
                "Duygularını kabul et.",
                "Dua edin ve Allah'ın rehberliğini isteyin.",
                "Duygularını yaz.",
                "İlham veren bir şeyi görselleştirin.",
                "Olumsuz düşünme kalıplarını durdurun.",
                "Hayattaki pozitifleri bulun.",
                "Kendine ve kaygına karşı şefkatli ol.",
                "Olumsuz düşüncelerin kökenini inceleyin.",
                "Kaçındığınız bir şeyle yüzleşmek için cesaretinizi toplayın.",
                "Endişelenmek sorun değil. Belirtileri tanıyın ve onu nasıl kontrol edeceğinizi öğrenin.",
                "Endişenizden dolayı kaçındığınız şeyleri listeleyin. Paylaşın",
                "Biraz araştırma yaparak baş etme becerilerinizden birini güçlendirin",
                "Endişe için özel olarak Youtube'da yoga rutini yapın",
                "Ruh sağlığınız için iyi olan bir şey okuyun",
                "Endişenizden dolayı zarar görmüş bir şeyi onarın",
                "Seni rahatlatan, kaygıyı azaltan bir yere git",
                "Bugün bedeninize, zihninize ve ruhunuza iyi gelecek şekilde yiyin",
                "Boş hissettiğiniz yerde yeniden şarj olmanıza yardımcı olacak bir şey yapın",
                "20 dakika doğa seslerini dinleyerek geçirin",
                "Sosyal medya beslemelerinizin kaygısız olduğundan emin olun",
                "Kendi kendine konuşma üzerinde çalış, kendine yönelik kötü sözler yok",
                "Tam vücut taraması yapın. Kaygınızı nerede tutuyorsunuz",
                "Uykuya, dinlenmeye ve sağlıklı bir uyku saatine odaklanın",
                "Gününüzde kaygınızı artıracak bir şeyi değiştirin",
                "Farkındalık alıştırması yapın",
                "Telefonunuzun kamera rulosunda gezinin. Sizi gülümseten bir resim bulduğunuzda, içindeki herkesle paylaşın",
                "Endişeyle de mücadele ettiğini düşündüğünüz birine ulaşın. Sadece bunun hakkında konuşmak ikinize de yardımcı olabilir",
                "1. Gündeki hedefinizi kontrol edin. İlerlemeniz nedir?"
            ]
        },
        {
            "challenge_name": "Harika Hisset",
            "challenge_description": "Bu duygusal meydan okumaya katılarak kendinizi biraz daha harika ve harika hissettirecek zamanınızı harcayın.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Bu yıl zaten yaptığınız harika şeyleri düşünün.",
                "Olumlu olmaya odaklanın",
                "Seni mutlu eden şeylerin bir listesini yap.",
                "En sevdiğin çocukluk atıştırmalıklarını ye.",
                "Evinin etrafında dans et.",
                "8 bardak su içmeye çalışın.",
                "En sevdiğin filmi izle.",
                "Yatak odanızı/iş yerinizi baştan yaratın",
                "En sevdiğiniz şarkıları dinlerken gün batımını/gün doğumunu izleyin",
                "Sağlıklı bir yemek yapın",
                "Gerçekten istediğin bir şeyi al (çikolata, çiçek…)",
                "Biri için güzel bir şey yap",
                "Size keyif veren şarkılarla kendi çalma listenizi oluşturun",
                "Mümkün olduğunda yıldıza bak",
                "En sevdiğin yemeği sipariş et ve kendini şımart",
                "Yürüyüşe çıkmak",
                "En sevdiğin içeceği evde yap",
                "İlginizi çeken bir şey hakkında bir podcast dinleyin",
                "Bir bulmacayı bir araya getirin",
                "Çocukluğundan film izle",
                "Kendi pizzanı/en sevdiğin yemeği kendin yap",
                "Birine Messenger/WhatsApp'ta 'Teşekkür Ederiz' mesajı gönder",
                "Bugün en sevdiğin şeyleri giy.",
                "Yeni bir kelime öğren",
                "Haftalık menü planı yapın",
                "Çocuklarınızla/kardeşlerinizle takılın",
                "Bugün 3 kişiye iltifat edin",
                "Bitmemiş projeyi sonunda bitir",
                "Bugün tatlı, soda veya fast food yok",
                "Ailenle eğlenceli bir gün planla"
            ]
        },
        {
            "challenge_name": "Kasıtlı Yaşam",
            "challenge_description": "Bu günlük küçük mücadeleye katılmak, hayatınızı kendinizin en iyi versiyonu olmanız için dönüştürecek",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Bugün uyandığınızda dua edin. Fırsatlarla dolu yepyeni bir gün için Allah'a şükredin.",
                "Gün için bir niyet veya sadece 3 hedef belirleyin",
                "Kendin ve başkaları hakkında söylediğin sözlerde maksatlı ol",
                "Bir şükran listesi yazın, bunu her sabah/akşam eklemeye çalışın",
                "Yatmadan en az 1 saat önce ekranlardan uzak durun",
                "Sevdiğin bir şeyi pişir ve yemeğini aklından yetamamen dikkat dağıtıcı olmadan",
                "Bir öz bakım seansı yapın, banyo yapın, yüz maskesi yapın ve sürecin her saniyesinin tadını çıkarın",
                "Bu ayki deneyimleriniz hakkında 20 dakikalık bir günlük alın",
                "Yemek yerken telefonunuzu uzak tutun",
                "Görevlerinizi tamamladığınızda kendinizi ödüllendirin. Gerçekten zevk aldığınız bir şeyi yapmak için kendinize zaman ayırmak kadar basit olabilir",
                "Aynaya bak ve kendine güzel olduğunu ve her şeye muktedir olduğunu söyle",
                "15 dakikalık bir yoga/meditasyon seansı yapın",
                "Canlandırıcı müzikler dinleyin. Çalma listenizde duygularınızı iyi tutacak şarkılar olmasını seçin",
                "Bugün yaratıcılığınızı ifade edin. Çizin, boyayın, yazın, dans edin, sadece bir şeyler yapın",
                "Doğada yürüyüşe çıkın",
                "Sosyal medyayı akıllıca ve dikkatli kullanmak için bilinçli bir seçim yapın. Sınırlar belirleyin ve sağlığınızı olumlu yönde etkileyen içerikleri seçin",
                "10 dakikanızı ayırın ve yapmak istediğiniz her şeyi yazın ve en az birini gelecek ay yapmak için plan yapın",
                "Artık sevmediğiniz Instagram hesaplarını takip etmeyi bırakın",
                "Kendinize birkaç dakika ayırın ve sadece oturun ve nefes alın. Sadece anda olun",
                "Kendinizi bir dilim cennetle şımartın. En sevdiğiniz pastaneye gidin, en sevdiğiniz pastayı alın, sessiz bir yerde oturun ve her lokmanın tadını çıkarın",
                "Ruh sağlığınıza dikkat edin. Duygularınızın ve ruh halinizin bilinçli ve farkında olun. İhtiyacınız olduğunda yardım istemekten korkmayın",
                "Bugün herhangi bir telefon veya ekran olmadan yemek yiyin ve tadını çıkarın",
                "Biriyle yeniden bağlantı kurun. Bir arkadaşınızla Messenger, Facetime, WhatApp'ta bir plan yapın veya yetişmek için buluşun",
                "Youtube'da bir motivasyon konuşması dinleyin",
                "Habitualize bloguna göz atın",
                "Bugün 3 çeşit meyve tüketin",
                "Yarın başarmak için 3 şey yaz",
                "Sezgisel bir yürüyüş yapın",
                "10 dakika veya daha uzun süreli günlük yaz",
                "Büyük hayaller kurun. Niyetler belirleyin. Bir vizyon panosu oluşturun"
            ]
        },
        {
            "challenge_name": "Yeni Dil Öğren",
            "challenge_description": "Yeni bir dil öğrenmek zor ama aynı zamanda eğlenceli, basit ve zahmetsiz de olabilir. 30 günlük dil öğrenme mücadelesinin ardından dil öğreniminizi her gün artırmanıza olanak tanır.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "5 yeni kelime öğren",
                "Yeni bir dil uygulaması deneyin",
                "Öğrendiğin dilde altyazılı film izle",
                "Hedef dilinizde alışveriş/yapılacaklar listesi yazın",
                "Birine bazı kelimeler ve deyimler öğretin",
                "'Nasılsın?' bir arkadaşa",
                "Dildeki bir şey için öğreticiyi izleyin",
                "Bugünkü deneyiminizi yazın",
                "Yaptığın bir şeyi anlat",
                "Dil hakkında bir Youtube video eğitimi izleyin",
                "Birine 5 yeni kelime öğret",
                "Temel gramer öğrenin",
                "Hedef dilinizde dergi",
                "Bir haber makalesi okuyun",
                "Bir kişiyle veya evcil hayvanınızla konuşun",
                "Bir günlüğüne telefon ayarını değiştir",
                "Bir kitap/film için inceleme yaz",
                "Bir şeyler oku",
                "Dil pratiği yaparken kendinizi kaydedin",
                "Öğrendiğin 40 kelimeyi yaz",
                "Bu zorluğun size nasıl yardımcı olduğunu yazın",
                "1. Günde öğrendiğin kelimeleri hala hatırlıyor musun?",
                "Hedef dilde çevrimiçi bir testi yanıtlayın",
                "Bir aile üyesine 7-10 yeni kelime öğretin",
                "Öğrendiğin 50 kelimeyi yaz",
                "Günün hakkında bir şeyler yaz",
                "Dilde bir şarkı dinle",
                "Bir hikaye yaz",
                "Podcast'i dinle",
                "Kelimeleri kolayca ezberlemek için flash kartlar oluşturun"
            ]
        },
        {
            "challenge_name": "Farkındalık Mücadelesi",
            "challenge_description": "Farkındalık pratiği, odaklanmadığınız veya hayatta bunalmış hissettiğinizde zihninizi sıfırlamanıza ve net bir bakış açısına sahip olmanıza yardımcı olur",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Bugün herhangi bir işi yapmadan önce, kendine o işi yapma nedenin nedir diye sor ve bir an için üzerinde düşün",
                "Dikkatli duş. Negatif düşüncelerden arındığını gözünüzde canlandırın ve suyun teninizde bıraktığı hissine konsantre olun",
                "Uyumadan önce, gün içinde gerçekten takdir ettiğiniz 3 şeyi yazın",
                "Şükran pratiği yapın. Olumlu düşüncelere odaklanmaya başlayın ve korkulu, endişeli beyin modelinizi bırakın",
                "Duruşunuzu her seferinde sıfırlayın.oturun, sırtınızı nazikçe düzleştirin",
                "Bugün biraz egzersiz yapın ve fiziksel duyumlara odaklanın",
                "Bugün aktif dinleme pratiği yapın. Bu, diğer kişinin ne söylediğine odaklanmak ve uygun bir şekilde yanıt vermek anlamına gelir",
                "Vücut taraması yapın. Dikkatinizi vücudunuza verin ve nefesi gergin olan bölgelere gönderin",
                "Oturup o an ne hissediyorsan onu yazabileceğin huzurlu bir yer bul",
                "Bugün meraklı olun. Neler olup bittiğiyle ilgilenmeye çalışın ve dikkatinizi onun hakkında daha fazla öğrenmeye odaklayın",
                "Bir şeyi tattığınızda, dokunduğunuzda, kokladığınızda ve işittiğinizde duyularınıza dikkat edin",
                "Dikkatli nefes alma. Nefes alın, 3 saniye tutun ve sonra nefes verin",
                "Dikkatle yürüyün. Toprağa bağlı ve sağlam bir şekilde yere kök salmış hissetmek için bir duruş alın",
                "Dikkatli bir fincan çay için. Tadına, kokusuna ve sıcaklığına odaklanın",
                "Konuşma sırasında ön yargısız dinleme pratiği yapın",
                "Her seferinde bir şey yapın ve sadece buna odaklanın",
                "Rahatça oturun, ayaklarınızın yere sağlam bastığını, sırtınızı dümdüz ve ellerinizi kucağınızda hissedin. Bir süre nefes almaya odaklanın",
                "Telefona cevap verirken veya sohbet ederken kendinizi dinleyin, konuşma şekliniz, seçtiğiniz kelimeler",
                "Bugün her şeyi takdir edin. Olan her şeyin farkına varın ve onu takdir etmenin bir yolunu bulun",
                "Dikkatle gözlemleyin. Bir nesneyi zihinsel olarak ayrıntılarıyla, rengiyle, dokusuyla, şekliyle tanımlayın...",
                "Bir süre rahat ve sakin bir yerde oturun",
                "Her seferinde bir görev yapın ve yaptığınız işe odaklanın",
                "Normalde seni üzen birine karşı empati yap",
                "Hataların ve başarısızlıkların sizin için neden iyi olduğu hakkında bir makale veya video bulun. Geçmişe daha az zaman ayırabilmeniz için bunu ciddiye alın",
                "Dikkatli yiyin. Yemeğin tadına bakın ve içine kaç malzeme girdiğini tahmin etmeye çalışın",
                "Etrafınıza bakın. Belirli bir yaprağa/ağaca/çiçeğe bakın ve dikkatinizi odaklayın",
                "Komik filmler bul, komik fıkralar anlat, komik insanlar dinle. Bugün olabildiğince gül",
                "Beklemeniz gereken zamanları değerlendirin ve duyularınıza ve nefesinize odaklanarak dikkatli olun",
                "Dişlerinizi baskın olmayan elinizle fırçalayın, dikkati teşvik etmeye yardımcı olun",
                "Her zaman Habitualizer Uygulamasını kontrol edin ve her zaman dikkatli olmanız gerektiğini hatırlatın"
            ]
        },
        {
            "challenge_name": "Aile Zamanı",
            "challenge_description": "Aile zamanı, güven inşa etmek, aile üyeleri arasında daha güçlü bir duygusal bağ oluşturmak, iletişim becerilerini geliştirmek, okulda daha iyi performans göstermek ve davranış sorunlarını azaltmak gibi birçok fayda sağlar ve ayrıca anıları eğlence üzerine inşa etme fırsatı sunar, kahkaha ve beraberlik",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Çocuklarınızdan bugün yaptıkları veya yapmayı planladıkları bir şeyi paylaşmalarını isteyin. Önce planlarınızı sunun",
                "Çocuklarınıza bir kart numarası veya kart oyunu öğretin ya da ikinizin de zevk aldığı bir oyun oynayın",
                "Çocuğunuzun ilgisini çeken bir dönüm noktası, şehir veya ülke seçin ve Youtube veya Facebook üzerinden keşfetmeye zaman ayırın",
                "Özel bir akşam yemeği hazırlayın. Masaya taze çiçek koyun, mumları yakın ve bir aile olduğunuz için minnettarlığınızı ifade etmek için bir dakikanızı ayırın",
                "Aile fotoğrafı çekin",
                "Kiliseye gidin ve birlikte dua edin",
                "Aile filmi ve pizza gecesi",
                "Birbirinizin portrelerini çizin",
                "Akşam yemeğini birlikte pişirin",
                "Birlikte 'tercih eder miydin' oyna",
                "Birlikte yapboz yap",
                "Aileniz için pasta veya kurabiye pişirin",
                "Aile pikniği planlayın",
                "Birlikte video oyunları oynayın",
                "Birlikte karaoke şarkıları söyle",
                "Birlikte yemek sonrası yürüyüşe çıkın",
                "Birlikte bir masa oyunu oynayın",
                "Bir gezi veya tatil planlayın",
                "Çocuğunuza fıkra anlatmak için özel bir zaman ayırın. Ona da gülün",
                "Aileniz için özel bir akşam yemeği hazırlayın",
                "Bir aile yapılacaklar listesi oluşturun",
                "Eski aile fotoğraflarına bakın veya eski videoları izleyin",
                "Birlikte yürüyüşe çıkın",
                "Birlikte gün doğumunu (veya gün batımını) izleyin",
                "Her aile üyesiyle 15 dakika geçirin",
                "Bir doğa merkezini ziyaret edin ve güzelliğini takdir edin",
                "Çocuğunuzun ders dışı etkinliklerine katılın",
                "Çocuklarınızı hobileri konusunda cesaretlendirin",
                "Bir gezi veya eğlenceli bir aktivite ile çocuklarınızı şaşırtın",
                "Onlara her zaman ne kadaronları seviyorsun"
            ]
        },
        {
            "challenge_name": "Konfor alanınızın dışına çıkın",
            "challenge_description": "Bu zorluğun uygulanması sizi daha güçlü bir insan olmaya, deneyimler yoluyla özgüven kazanmanıza, kişisel gelişiminize devam etmenize ve yeni insanlarla tanışma şansı yakalamanıza yardımcı olacaktır.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Normalde yaptığınızdan 1 saat önce kalkın",
                "Merhaba de!' rastgele bir yabancıya",
                "24 saat sosyal medyaya girmeyin, televizyon izlemeyin",
                "İş yerindeki birinin yanına gidin ve onlara gerçek bir iltifat edin",
                "Bir süredir konuşmadığınız birine ulaşın",
                "İşe/okula giderken farklı bir yol kullanın",
                "Kaçındığınız bir konu hakkında biriyle zor bir konuşma yapın",
                "Bakkaldan asla almayacağın bir şey al",
                "Yeni bir dil öğrenmeye başla",
                "Bir yabancıya yaklaş, gülümse ve onlara iltifat et",
                "İhtiyacın olursa yardım iste veya sormadan birine yardım et",
                "Hafta sonu veya izin günü için planlar yapın",
                "Hep istediğin yeni bir hobi/sporu dene",
                "Bir yabancıyla konuşmaya başla",
                "Bugün bir dijital detoksu deneyin",
                "Bir vizyon panosu oluşturun (Pinterest'ten ilham alın)",
                "Kendini bir randevuya çıkar",
                "Birinden randevu isteyin/sizi korkutan birine iltifat edin",
                "Bir blog/youtube kanalı/Instagram sayfası/kitap açın, canınız ne istiyorsa onu yapın",
                "Yemek yemek ya da yemek yemek için yeni bir yere gidin",
                "Bir arkadaşınızla yeni bir meydan okumaya başlayın (bu uygulamadan birini kullanabilir veya kendinizinkini oluşturabilirsiniz)",
                "Yeni bir antrenman dene (zumba, yoga, pilates, kickboks vb.)",
                "Birine spontane bir hediye verin",
                "Yeni bir şey için kaydolun",
                "Eve/işe/okula giderken yeni bir rota seçin",
                "Beklenenden erken uyu",
                "Yeni bir yere seyahat etmek",
                "Yeni bir beceri geliştirmek",
                "5 kişiye 5 teşekkür mesajı gönder",
                "Yeni bir görünüm deneyin"
            ]
        },
        {
            "challenge_name": "İç Huzuru Bul",
            "challenge_description": "İç huzur, zihnimizi sakinleştirir ve yolumuzu daha net görmemizi sağlayarak, odaklanmamıza ve hedeflerimizi takip etmemize yardımcı olur.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Aromaterapiyi deneyin. Koku, canlı ve gerçekçi hatıralar uyandırabilir. Güzel bir şey kokladığımızda rahatlıyoruz",
                "Yarın için plan yapın. Bu size sadece sabahları daha fazla zaman kazandırmakla kalmaz, aynı zamanda hayatınızı daha sakin ve basit hale getirerek önceden plan yapmanıza olanak tanır",
                "Yoğun ve dikkati dağılmış hayatlarımızda, her gün etkileşimde bulunduğumuz insanlara takdir göstermeyi unutmak kolay olabilir. Çevrenizdeki insanlara şükran göstermek için biraz zaman ayırın",
                "Bir şeyler yemeyi deneyin ve beş duyunuza odaklanın. Gerçekten her bir duyuya, tada, kokuya, dokunmaya ve görmeye odaklanın.",
                "Evinizde bir alanı boşaltın. Bu, duygusal blokları ve iç karışıklığı iyileştirmenin bir yoludur. Sakin, huzurlu bir ortam yaratın",
                "Aynada gülümseyin. Bu size saçma gelebilir ama sağlığınıza pek çok faydası var. Kalbi yavaşlatır, vücudu rahatlatır ve strese karşı hormon salgılar",
                "Derin bir nefes alın ve gözlerinizi kapatın. Zihinsel olarak minnettar olduğunuz 5 şeyi listeleyin. Bu, düşüncelerinizi olumsuzdan olumluya değiştirebilir",
                "60 saniyelik bir zamanlayıcı kurun ve yalnızca nefesinize odaklanın. Kulağa nasıl geldiğini ve vücudunuzun nasıl hissettiğini fark edin",
                "Dikkatli bir banyo yapın. Mola verin, ışıkları kapatın. Suyun vücudunuzun üzerinden akmasına izin verin ve hissettiğiniz hislere ve sıcaklığa odaklanın",
                "Bir çay veya kahve ritüeli yaratın. Gerçekten yapmanız gereken tek şey yavaşlamak. Ne yaptığınıza dikkat edin ve tadın tadını çıkarın",
                "Vücudunuz gün boyunca gerginse, rahatlamak için bir dakikanızı ayırın. Derin bir nefes alın, omuzlarınızı gevşetin ve çenenizi açın",
                "Günlük 3 hedef belirleyin. Bu yönetilebilir bir sayıdır ve size gereken zaman ve zihinsel enerjiyi dikkatli ve eksiksiz bir şekilde bunlara odaklanmanızı sağlar",
                "4 dakikalık bir meditasyon deneyin. Telefonunuza 4 dakikalık bir alarm kurun, rahatça oturun, gözlerinizi kapatın ve doğal bir şekilde nefes alın. Zihniniz dağılmaya başlarsa, tekrar nefesinize getirin",
                "Birine sımsıkı sarılın ve birlikte 3 büyük nefes alın. Nefes almak sizi topraklayacaktır",
                "Dijital bir mola verin. Rahatlık kaynağı olarak dijital cihazlarınıza güvenmeyin. Bunlar yanlış bir aciliyet duygusu yaratıyor ve sanki bir şeyleri kaçırıyormuşuz gibi bizi ayakta bırakıyor",
                "Birinin ne olduğunu yargılamak yerineonları dikkatle dinleyin ve söylenenlere dikkat edin",
                "Yürümek beden, zihin ve ruh üzerinde çok sakinleştiricidir. Uygun bir yer bularak başlayın. Çevrenizi gözlemleyin, durun ve üzerinde yürüdüğünüz ağaçlara, yapraklara ve zemine odaklanın",
                "Ana odaklanın. Temel bir ipucu, şimdiyi geçmişle karşılaştırmayı bırakıp şu anda neler olduğuna odaklanmaktır. Dikkatinizi yaptığınız bir göreve odaklamak kadar basit olabilir",
                "Ayağa kalk ve nefes al. Toprakla bağlantını hisset",
                "Vücudunuzu tarayın ve bedensel duyumları veya duyguları fark edin. Herhangi bir hoş olmayan duyum, duygu veya hisleri nefes verirken boşaltın. Herhangi bir hoş duyguyu fark edin ve onları nefesle doldurun",
                "Dikkatinizi şu anda düşündüğünüz şeye yönlendirin. Zihinsel aktivitenizin farkında olmak, düşüncelerinize bakış açısı kazanmanıza yardımcı olabilir",
                "Kendini tanı ve kendini sev",
                "Olumsuz şeylerden uzak dur",
                "Huzurunuzu engelleyen faktörleri belirleyin ve bırakın",
                "Kızgınken gözlerini kapat",
                "Başkalarının seni düşünmesini umursamayı bırak",
                "Barış, anlamlı bir hayat yaşamakla gelir",
                "Daima sabah kalkınca ve yatmadan önce namaz kılın",
                "Hayatınızın çatışmalarını çözün",
                "Dayanıklılığı teşvik etmek için sınırlamaları kabul edin"
            ]
        },
        {
            "challenge_name": "Gece Rutini",
            "challenge_description": "Yeterli saat uyumanın gece rutin sonuçları, sabaha kadar verimli bir gün için daha keskin bir odaklanma ve daha yüksek bir enerji seviyesine sahip olacaksınız",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Günü düşünün. Oldukça iyi giden en az bir şey yazın",
                "Dua yoluyla Tanrı ile iletişim kurmak için bir dakikanızı ayırın. Kalbinizi ona açın, aklınızdaki her şeyi serbest bırakın ve gün içinde olan her şey için ona teşekkür edin. Bu, yalnızca şükretmenin değil, aynı zamanda kalmanın da harika bir yoludur. Tanrı ile bağlantılı.",
                "Ertesi gün ne yapmanız gerektiğini düşünmek için bir dakikanızı ayırın ve buna göre plan yapın.",
                "Bir kağıt al ve aklından ne geçiyorsa onu yaz. Bu sadece yarın ne yapacağını düşünmeden uyuyabileceğin anlamına geliyor çünkü zaten yazılmış",
                "İyi bir uyku ortamınız olsun. Yatak odasını iyi bir sıcaklıkta tutun, ışığı engellemek için karartma perdeleri veya sleeo maskesi kullanın",
                "Günlük yaz. Duraklatmak ve düşünmek için zaman ayırın",
                "Kokulu mumlar yak ve rahatlatıcı bir çalma listesi çal",
                "Yatmadan önce biraz esneme/yoga yapın",
                "Şükran listesi yaz",
                "Uyumadan önce güzel bir kitap okuyun. Gevşemenize ve daha iyi uyumanıza yardımcı olur.",
                "Ertesi gün görevlerinizi planlayın, yemek, kıyafet, ...",
                "Sevdiğin birine mesaj atmak için özel bir iyi geceler gönder",
                "Güzel bir sıcak duş veya banyo yapın",
                "Yatmadan en az 3 saat önce kafeini, alkolü veya şekeri kesin",
                "Meditasyon yap/dua et. Sadece düşüncelerinle baş başa kal",
                "Yerinizi düzenleyin. Kendinizi daha sakin ve rahat hissedebileceksiniz",
                "Yatmadan önce hafif bir akşam yemeği yiyin",
                "Yarın için niyet belirle",
                "Uyku kalitenizi artırmak için bazı esansiyel yağları dağıtın",
                "E-postaları, haberleri kontrol etmekten, uyumadan önce çalışmaktan kaçının",
                "Yatağa aç gitmeyin. Daha iyi uyumanıza yardımcı olması için biraz badem, muz veya yulaf lapası yiyin",
                "Uyumadan en az 1 saat önce telefonunuzdan uzak durun",
                "Yatmadan önce biraz papatya çayı veya diğer bitki çaylarını (kafeinsiz) için",
                "Yatmadan yaklaşık bir veya iki saat önce ılık bir banyo yapın veya duş alın, yatma vaktinde rahatlamanıza yardımcı olacak harikalar yaratabilir",
                "Yatmadan önce su içmeyi unutmayın. Uyurken nemi kaybederiz. İyi nemlendirmek önemli",
                "2 dakikada dişlerini fırçala",
                "Son 24 saatinizi düşünün ve oldukça iyi giden en az bir şey yazın",
                "Yarın için en önemli öncelikleri bir planlayıcıya veya not defterine yazın.",
                "Yapılacaklar Listesinde Kaygıyı Azaltın",
                "Her zaman uyumadan önce dua et ve kendini affet"
            ]
        },
        {
            "challenge_name": "Olumlu Olumlama",
            "challenge_description": "Bu meydan okuma, hem kendiniz hakkındaki olumlu düşüncenizi hem de hedeflerinize ulaşma becerinize olan güveninizi artırarak öz değerinizi güçlendirmeye yardımcı olabilir.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Bugünün olanaklarını ve potansiyelini benimsiyorum",
                "Bugün mutlu olmayı ve kendimi sevmeyi seçiyorum",
                "Değişmeye ve büyümeye hazırım",
                "Konfor alanım dışındaki deneyimleri benimsiyorum",
                "Ben yetenekli ve zekiyim",
                "challenges bana büyümek için fırsatlar getiriyor",
                "Bana rehberlik etmesi için sezgilerime güveniyorum",
                "Kendime ve bedenime aşığım",
                "Geçmişimle barışığım",
                "Bugün kendime ve başkalarına karşı nazik olacağım",
                "Korku yerine inancı seçiyorum",
                "Bugün olumlu bir gün olacak",
                "Sahip olduğum her şey için minnettarım",
                "Olumsuz düşüncelerimden daha fazlasıyım",
                "Kendimi koşulsuz kabul ediyorum",
                "Sağlıklıyım ve mutluyum",
                "Şu anda olan her şey benim nihai iyiliğim için oluyor",
                "Nasıl hissettiğimden sorumluyum ve bugün mutluluğu seçiyorum",
                "Bugün kendimi internetteki yabancılarla kıyaslamayacağım",
                "Değişim yaratma gücüm var",
                "Duygularım ve düşüncelerim geçerlidir",
                "Bolluğum ve içsel gücüm var",
                "Her şeye yeni bir bakış açısıyla bakmaya hazırım",
                "Sevgiye ve saygıya layık biriyim",
                "Zihnim açık, güçlü ve odaklanmış",
                "Güne enerji ve cesaretle bakıyorum",
                "Hayallerimden ilham alıyorum ve motive oluyorum",
                "En iyisini hak ediyorum ve şimdi kabul ediyorum",
                "Benzersiz ve kendime güveniyorum",
                "Hayatımda sonsuz fırsatlar görüyorum"
            ]
        },
        {
            "challenge_name": "Günlük Günlük Tutma",
            "challenge_description": "Günlük tutmak, belirtilerinizi kontrol etmenize ve ruh halinizi iyileştirmenize yardımcı olur: Sorunlara, korkulara ve endişelere öncelik vermenize yardımcı olur.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Sana ilham veren biri hakkında yaz",
                "Hayatında yaklaşık 5 nimet yaz",
                "Kendiniz hakkında 30 gerçek yayınlayın",
                "Ne için heyecanlısın?",
                "Çocuklarınızın/arkadaşlarınızın/kardeşlerinizin sizden öğrenmesini istediğiniz 3 ders nedir",
                "Mevcut bir meydan okuma hakkında yaz",
                "Sorunlara çözüm yazın",
                "Gelecekte öğrenmek istediklerinizi yazın",
                "Anne babanız/aileniz hakkında sevdiğiniz şeyleri listeleyin",
                "Mükemmel günün nasıl olurdu?",
                "Bu yıl başarmak istediğin her şeyi yaz",
                "Hayatında daha çok neye ihtiyacın var?",
                "Korkmasaydınız yapacağınız şeylerin bir listesini yapın ve bunlar hayatınızı nasıl etkilerdi",
                "On yaşındaki sana ne nasihat edersin?",
                "Yarını nasıl daha iyi hale getirebilirsin?",
                "Seni sinirlendiren her şeyi yaz ve bunu nasıl değiştirebilirsin?",
                "Dün öğrendiğin bir şey nedir?",
                "Geçmişte üstesinden geldiğin bir mücadeleyi yaz. Seni nasıl güçlendirdi?",
                "Şu anda dört gözle beklediğin şey nedir?",
                "Seni en çok ne mutlu eder? Buna nasıl daha fazla zaman ayırabilirsin?",
                "Hayatında eksik olan bir şey var mı? Bunu nasıl değiştirebilirsin?",
                "Kendinle gurur duyduğun bir anı yaz",
                "Bu yıl için 3 dilek hakkın olsaydı ne dilerdin?",
                "Şu anda aklında ne var?",
                "Özlediğin bir şey ya da biri hakkında yaz",
                "Bugün en çok neye değer veriyorsun?",
                "Hayatında düşündüğün zaman seni mutlu eden bir anı yaz",
                "Bugün hayat dursaydı, ne yapmadığınıza pişman olurdunuz?",
                "İnsanların seni nasıl hatırlamasını istiyorsun ve neden?",
                "Daha fazla sevgi göstermek için hangi yönlerine ihtiyacın var?"
            ]
        },
        {
            "challenge_name": "Sabah Rutini",
            "challenge_description": "Sabah rutininizin olması enerjinizi, üretkenliğinizi ve pozitifliğinizi artırabilir.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Sabah rutininizi yaparken, kahvaltı ederken, haberleri kontrol ederken veya egzersiz yaparken 20 dakika güneşin altında oturun veya ayakta durun",
                "Öğleden Önce Yapmanız Gereken 3 Şeyi Seçin",
                "Gününüzü Önceliklendirin. Bugün hangi görevleri tamamlamayı umuyorsunuz?",
                "Bu sabah düşüncelerinizi ve duygularınızı dinlemek için birkaç dakikanızı ayırın, tanımlayın ve gerekirse değiştirin",
                "Bugün için yapılacaklar listesi yaz",
                "Aileniz ve arkadaşlarınızla bağlantı kurun veya sevdiğiniz birine basit bir günaydın mesajı gönderin",
                "Derin Bir Nefes Alın ve Bu Gün İçin Teşekkür Edin",
                "Kendinle gurur duyduğun 5 şeyi yaz",
                "15 dakika meditasyon yap",
                "Bir gl içkahvaltıdan önce bir eşek su",
                "Pencerelerinizi temiz hava için açın ve içeri biraz güneş ışığı girsin",
                "Yürüyüş yapın veya evde egzersiz yapın",
                "En sevdiğin kitabın bazı bölümlerini oku",
                "15 dakika yoga yap",
                "Hazırlanırken bir podcast veya sesli kitap dinleyin",
                "Dışarı çıkın ve temiz sabah havasını içinize çekin",
                "Günlük yapılacak 3 şeyin bir listesini yapın",
                "Sabah haberlerini ve sosyal medyayı kontrol etmekten kaçının",
                "Daha üretken hissetmek için yatağınızı toplayın ve alanınızı toplayın",
                "Gününüze rehberlik edecek bir onaylama seçin. Örneğin:' 'Bugün harika bir gün.'",
                "Duş al ve bir yere gitmesen de hazırlan",
                "Sabah ilk iş olarak hiçbir sosyal medyayı kontrol etmeyin",
                "Uyandığında, tüm gün iyi hislere sahip olmak için iyi bir fikri kendine çek",
                "Sabah şükran listesi yaz",
                "Sabahları sizi iyi bir ruh haline sokmak için en sevdiğiniz müzik çalma listesini dinleyin",
                "Uyandıktan sonra biraz esneme yapın",
                "Kendinize sağlıklı ve lezzetli bir kahvaltı hazırlayın",
                "Kahvaltıdan Önce Bildirimleri Kontrol Etmeyin",
                "Boya yap, bir müzik aleti çal. Yaratıcılığını besleyen bir şey yap",
                "Önümüzdeki gün için bir gülümseme ve olumlu bir tavırla uyanın"
            ]
        },
        {
            "challenge_name": "Olumlu Zihniyet",
            "challenge_description": "Olumlu düşünmek, kendimizi yapmak için eğitebileceğimiz bir alışkanlıktır. Araştırmalar bunun hem beden hem de zihin sağlığı üzerinde olumlu bir etkisi olduğunu gösteriyor.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Gülümseme pratiği yapın. Yabancılara gülümseyin, aynaya bakın, her fırsatta gülümseyin. Çok daha olumlu hissedeceksiniz",
                "Bugün küçük şeylerin kıymetini bilin. Birinin gülümsemesi, gün batımı, sabah kahveniz, güneş ışınlarının sıcaklığı, gökyüzü",
                "Hayatım berbat diye düşünmek yerine şu an işler pek iyi değil ama geçecek. Güzel günler geliyor",
                "Olabilecek korkunç şeyleri düşünmek yerine, mevcut durumunuzdan gelebilecek harika şeyleri düşünün",
                "Pes ediyorum demek yerine, Bu çok zor ama denemeye devam edeceğim deyin",
                "Başkalarının ne düşündüğünü umursamayı bırak. Başkalarının düşünceleri seni mutlu ve olumlu kılmak için tasarlanmamıştır",
                "Bu bana neden oluyor? diye düşünmek yerine, Bu bana ne öğretiyor? diye düşünün.",
                "Olanaklara açıksanız daha iyi şeylerin geleceğine güvenin",
                "'Bunu yapamam' diye düşünmek yerine, 'Nasıl yapacağımı henüz bilmiyorum' diye düşün",
                "Bugün kendini kimseyle kıyaslama. Tamamen zaman kaybı",
                "Unutmayın, belirli bir durumu kontrol edemeseniz bile tepkinizi kontrol edebilirsiniz",
                "Meditasyon yapın. Bu, fazla düşünmenize yardımcı olur, stresinizi azaltır ve daha pozitif olmanıza yardımcı olabilir",
                "Olumlu kendi kendine konuşma pratiği yapın. Meditasyonunuzla olumlu olumlamaları kullanabilirsiniz",
                "Şükran günlüğünüzü yazarak güne başlayın veya bitirin",
                "Sevdiğiniz ve sizi seven insanlarla kendinizi kuşatın",
                "Müzik dinleyin. Müziğin sağlığınız ve gününüz üzerinde olumlu etkisi olabilir",
                "Kabul etme alıştırması yapın. Şu anda sahip olduğunuz her şeyi takdir edin",
                "İlham verici bir youtube videosu/podcast'i dinleyin. Beyninizi motivasyonla doldurun",
                "Bugün seni gülümseten 5 şeyi listele",
                "Başarısız oldum” demek yerine “Hatalar öğrenmeme yardımcı olur” deyin",
                "Sosyal medya zamanını sınırlayın. Başkalarının içeriklerini tüketmek yerine kendiniz üzerinde çalışmaya ve üretmeye daha fazla zaman ayırın",
                "İstediğiniz her şeyi elde edeceğinizi bilerek gelecek için en önemli önceliklerinizi ve planlarınızı yazın",
                "Anında kalın ve anın güzelliğini takdir edin. (Güneşi yüzünüzde hissedin, temiz havanın kıymetini bilin….)",
                "Bugünkü küçük zaferlerde (ve günden güne) kendinizle gurur duyun",
                "Gerçekten zevk aldığınız bir şeyi yaparak ruh halinizi değiştirin",
                "Endişe duyduğunuz yaklaşan bir durum için olabilecek en iyi senaryoyu yazın",
                "Sorunlara değil çözümlere odaklanın",
                "Başkalarının beklentilerini bir kenara bırakın ve önemli olana odaklanın",
                "Kendinizi olumlu insanlarla kuşatın",
                "Kendine iyi bak. Elimizden gelenin en iyisini hissettiğimizde olayları daha olumlu görebiliriz"
            ]
        },
        {
            "challenge_name": "Öz Aşk",
            "challenge_description": "Bir kişisel bakım rutinine girmenin, bir hastalığı azalttığı veya ortadan kaldırdığı klinik olarak kanıtlanmıştır.kaygı ve depresyon, stresi azaltır, konsantrasyonu artırır, hayal kırıklığı ve öfkeyi en aza indirir, mutluluğu artırır ve enerjiyi artırır",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Kendinde sevdiğin 10 şeyi listele",
                "Bugün aynada vücudunun beş parçasına 'teşekkür ederim' de",
                "Kendinle her gurur duyduğunda bir not yaz. Bunu bir 'Kendimle gurur duyuyorum' kavanozuna koy",
                "Tuttuğun bir pişmanlık için kendini bağışla ve bırak gitsin",
                "Kendin hakkında sevdiğin her şeyi içeren bir liste yaz",
                "Vücudunuzu sağlıklı yiyecekler ve bol su ile şımartın",
                "Odanızı/masanızı/dolabınızı temizleyin ve artık size neşe getirmeyen tüm incelikleri temizleyin",
                "Kendi fotoğrafını çek ve görünüşünle ilgili sevdiğin her şeyi yaz",
                "Kendini güvensiz ve kötü hissettiren herkesi takipten çıkar",
                "Gün doğumunu/gün batımını izleyebileceğiniz bir yere gidin ve tek başınıza keyfini çıkarın",
                "Her zaman kendin için giyin. Bugün en sevdiğin kıyafeti giy",
                "Haftanızı düşünün ve minnettar olduğunuz 5 şeyi yazın",
                "Nasıl hissettiğiniz ve hayatınızda neler olup bittiği hakkında günlük yapın",
                "Kendinle flört et. En sevdiğin restorana git, sahile git… Kendinle bağ kurabileceğin, kendini iyi ve rahat hissettiğin bir yere",
                "Bu meydan okumayı bitirince kendine bir ödül planla",
                "Uzun bir yürüyüşe çıkın ve doğayla bağlantı kurun",
                "Üstesinden geldiğin en büyük zorluğu yaz",
                "Bütün gün boyunca herhangi bir teknolojinin fişini çekin (yapacak işiniz yoksa)",
                "En sevdiğin yemeği veya tatlıyı ye",
                "Kendine bir aşk mektubu yaz",
                "Bu meydan okumadan öğrendiklerini yaz ve 15. Günde planladığın ödülünü unutma",
                "Çocukken yapmayı sevdiğiniz bir şey neydi? Bugün yapın",
                "Besleyici bir yemek yap",
                "Eski bir arkadaş veya akraba ile görüşün",
                "Öğleden sonra şekerleme yapın",
                "İstediğiniz bir filmi izleyin",
                "En sevdiğin özçekimlerin bir video kolajını yap",
                "Gerçekten iyi olduğun 5 şeyi listele",
                "Gurur duyduğun bir başarı hakkında yaz",
                "Her gün söylemek için 3 olumlu olumlama seçin. Ör. Bunu yapabilirim."
            ]
        },
        {
            "challenge_name": "Güveni Artırın",
            "challenge_description": "Güven, zihinsel ve duygusal sağlığınızı artırarak size hayata olumlu bir bakış açısı da verebilir.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Kendiniz hakkında güvensiz hissetmenize neden olan tüm sosyal medya hesaplarını takip etmeyi bırakın",
                "Bugün iltifatları reddetmek yerine kabul etmeye çalışın",
                "Duruşunuz hakkında bilinçli olun. İyi bir duruş daha fazla güven geliştirir",
                "Çocukken yapmayı sevdiğiniz bir şeyi yapın",
                "Bugün zorlayıcı bir şey yapın, konfor alanımızdayken büyümediğimizi unutmayın",
                "Kendinle ilgili sevdiğin 10 şeyi yaz",
                "Normalde yapmayacağınız bir şeye evet deyin",
                "Yeni bir sağlıklı alışkanlık uygulayın",
                "Söyleyecek bir şeyin olduğunda konuş",
                "Ne istemediğine değil, ne istediğine odaklan",
                "Yapmayı sevdiğiniz veya yapmaya başlamak istediğiniz bir konuda becerilerinizi geliştirmeye çalışın",
                "Gelecekte olanlar da dahil olmak üzere tüm başarılarınızı yazın",
                "Hızlı bir antrenman yap, duş al, hazırlan ve kendini harika hissettirecek bir kıyafet giy",
                "Gün batımını izlemek için tek başına dışarı çık",
                "Eski bir arkadaşa ulaş",
                "Her olumsuz düşünceye karşı olumlu düşünceler üretin",
                "Birine iyi bir öğüt ver",
                "Hoşunuza giden bir antrenman yapın",
                "Küçük şeyler üzerinde çalışın. Küçük başarılar sizi iyi hissettirir",
                "Durumsuz tepki vermek yerine, harekete geçmeden önce bir şeyi duraklatın ve düşünün",
                "Kendine has ol ve benzersizliğini kucakla. Hayat bir rekabet değildir",
                "Bütün gün boyunca başkaları hakkında olumsuz konuşmayın",
                "Ailen için yaptığın bir şeyi yaz",
                "Kendine bir aşk mektubu yaz",
                "3 korkunu yaz ve her birinin üstesinden nasıl gelebilirsin",
                "Yapmak istediğiniz değişikliği ve yapılması gereken adımları belirleyin",
                "Seni özel hissettirecek bir şey yap",
                "Üç arkadaşınızdan sizinle ilgili en sevdikleri şeyi söylemelerini isteyin",
                "3 hatanı ve öğrendiğin dersleri yaz",
                "Kendiniz için ulaşılabilir bir hedef belirleyin"
            ]
        },
        {
            "challenge_name": "İyilik Davranışı",
            "challenge_description": "Bir nezaket eylemi, güven, kontrolde olma, mutluluk ve iyimserlik duygularını artırabilir. Ayrıca başkalarını kendi deneyimledikleri iyi işleri tekrar etmeye teşvik edebilir ve daha olumlu bir topluluğa katkıda bulunabilir.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Bugün birine destek göster",
                "Kan bağışlayın. Hayat kurtarın",
                "En sevdiğiniz restoran/kafe hakkında olumlu bir eleştiri bırakın",
                "Bir aile üyesini/sevilen birini yatakta kahvaltı yapın",
                "Birine onlara nasıl yardım edebileceğinizi sorun - ve sonra yapın.",
                "İhtiyacı olan birine gülümse",
                "Favori uygulamanız hakkında olumlu bir inceleme bırakın",
                "Çöp toplayıcı için bir ipucu ver",
                "Ebeveynlerinize/kardeşlerinize/çocuklarınıza yardım etmek için yapabileceğiniz bir şey olup olmadığını sorun",
                "Birini neden sevdiğinizin bir listesini yazın ve ona verin",
                "Birine bahşiş ver",
                "Günü insanlar hakkında sadece olumlu şeyler söyleyerek geçirin",
                "Sevdiğiniz birine onu ne kadar takdir ettiğinizi söyleyin",
                "Genellikle yapmayacağınız bir işi yapın",
                "Karşılaştığınız en az 3 kişiye 'iyi günler' deyin",
                "Evsiz birine yemek al",
                "Birisine sormadan yardım edin",
                "Kurabiye pişir ve birine hediye et",
                "Yerel bir hayır kurumuna kıyafet/oyuncak/kitap bağışlamaya çalışın",
                "Bir süredir konuşmadığınız birini arayın",
                "En önemlisi, her zaman kendine karşı nazik ol",
                "Hayatında iz bırakan birine bir teşekkür notu yaz",
                "Sıra düşerken biri önünüzden geçsin",
                "Birini bir hediyeyle şaşırtın",
                "Aynalara olumlu yapışkan notlar koyun",
                "Yaşlı bir akraba ile check-in",
                "Sevdiğin birine 3 dürüst iltifat et",
                "Elinden geldiğince teşekkür et",
                "Birine iltifat etmek",
                "Bir günlüğüne olumsuz düşüncelerden kaçının. Kendinize de biraz nezaket gösterin!"
            ]
        },
        {
            "challenge_name": "Zihinsel Sağlık",
            "challenge_description": "Zihinsel sağlığınız söz konusu olduğunda, öz bakım stresi yönetmenize, hastalık riskinizi azaltmanıza ve enerjinizi artırmanıza yardımcı olabilir. Günlük yaşamınızda yapacağınız küçük öz bakım eylemlerinin bile büyük bir etkisi olabilir. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Kaygıyı Yönet",
                "Uyumadan önce gün içinde takdir ettiğiniz 3 şeyi yazın",
                "Kendine şefkat pratiği yap",
                "Farkındalık alıştırması yapın. Kendinizi şimdiki zamana geri çekin",
                "Bir hobiye zaman ayırın. Ruh halinizi yükseltin ve zevk aldığınız bir işle meşgul olun",
                "Günlük sosyal medya molası verin ve etrafınızdaki hayata odaklanın",
                "Bir şeyler ekin. Kendinizden başka bir şeye bakmanın zihinsel faydaları çoktur.",
                "Bir şeyi beklerken hayatının en güzel yanlarını düşün",
                "Ailenize, eğitimcilerinize, arkadaşlarınıza, aile üyelerinize ve size yakın olan diğer kişilere zihinsel sağlık hakkında nasıl konuşacağınızı öğrenin.",
                "Aklındaki bir şeyi aç",
                "Bugün dinlenmeye ve rahatlamaya odaklanın ve erken yatın",
                "Telefonunuza bakmadan, çevrenize odaklanarak yürüyüşe çıkın",
                "Ne zaman endişeli hissetsen mutlu bir yer hayal et",
                "Ruh sağlığınız için iyi olan bir şey okuyun veya izleyin",
                "Hayalinizdeki hayatı hayal edin ve oraya ulaşmak için hangi adımları konuşmanız gerektiğini yazın",
                "Olumlu kendi kendine konuşma pratiği yap",
                "Motivasyonunuzu yenileyin",
                "Olumsuz düşüncelerin kökenini keşfetmeye başlayın",
                "Minnettar olduğun 5 şeyi yaz",
                "Öz bakım yapın ve kendinizi şımartın",
                "Olumlu olumlamaları yazın ve uyumadan önce okuyun",
                "Mümkün olduğunda 3 tam derin nefes al",
                "Sağlıklı bir yemek planlayın",
                "Değer verdiğin birine bir not ver.",
                "Bir süredir konuşmadığınız sevdiğiniz birini arayın",
                "Rehberli bir meditasyon yapmayı deneyin",
                "Düşüncelerinizi sorunlardan ve kaygılardan uzaklaştırmak için yeni bir beceri öğrenin",
                "Aklınızdan geçen her şeyin günlüğünü yazın",
                "Besleyici bir yemek yiyin.",
                "En sevdiğin şarkıyı söyle. Şarkı söylemek nefes almayı düzenlemeye ve kaygıyı azaltmaya yardımcı olur"
            ]
        },
        {
            "challenge_name": "Uyku programınızı düzeltin",
            "challenge_description": "Sağlıklı bir uyku rutini benimsemenize yardımcı olmayı amaçlayan bu günlük challenges,gh uyu ve her sabah yenilenmiş hissederek uyan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Telefonunu bırak, böylece ertesi sabah alarmı kapatmak için yataktan kalkman gerekecek",
                "Beyninizi uykuya hazırlamak için yatmadan 1 saat önce tüm ekranlarınızı kapatın",
                "Kendinizi lezzetli bir kahvaltı ile ödüllendirin, böylece erken kalkmak için daha fazla motivasyonunuz olsun",
                "Geceleri duş, sıcak bir duş veya banyo yatmadan önce rahatlamanıza yardımcı olacaktır",
                "Her gün aynı saatte kalkmaya çalışın, önemli olan tutarlılıktır",
                "Akşam yemeğinden sonra rahat pijamalarınızı giyin, günlük tutun, bir köşe okuyun ve rahatlamaya hazırlanın ve zihninizin gevşemesine izin verin",
                "Uyandıktan sonra bol su için, gün boyunca kendinizi çok yorgun hissetmeyeceksiniz",
                "Akşam yemeğini erken yemeye çalışın, yemeğinizi daha erken sindireceğiniz için vücudunuz ihtiyaç duyduğu rahat uykuyu almaya odaklanabilir",
                "Hızlı bir sabah egzersizi/koşusu yapın, bu gün içinde enerjik ve yatmanız gerektiğinde uykulu hissetmenize yardımcı olacaktır",
                "Yatmadan önce meditasyon yapın, rahatlatıcı ve stresi azaltıyor",
                "Uyandığında camları aç ve güneş ışınları tenine değsin",
                "Bu geceki aktivitelerinizi ve ertesi sabah yapılacaklar listenizi önceden planlayın",
                "Uyandıktan sonra iyi bir ruh haline sokmak için en sevdiğin çalma listesini dinle",
                "Yatmadan 30 dakika önce sizi uyaracak bir hatırlatıcı ayarlayın",
                "Gündüz enerji harcayın ki gece yorulun",
                "Yatmadan 1 saat önce su içmeyi bırakın, böylece gece uyanmak zorunda kalmazsınız ya da uykuya dalmak isterken kalkmak zorunda kalmazsınız",
                "Uyandıktan sonra yatağını topla ki tekrar uyumaya meyilli olmasın",
                "Yatmadan önce hafif müzik dinleyin, bu kısa sürede uyumanıza yardımcı olacaktır",
                "Uyandıktan sonra yüzünüzü yıkamak veya güzel bir duş almak için hemen banyoya gidin",
                "Uyku kalitenizi artırmak için magnezyum (badem, yer fıstığı ve kabak çekirdeği gibi) ve çinko içeren yiyecekler yiyin",
                "Uyandığında temiz hava soluyun. Sabahları beyninizin temizlenmesine yardımcı olan düşüncelerinizi tazeleyin",
                "Yatağınızı sadece uyku ve seks için kullanın. Televizyon izlemek yok.",
                "Seçilen uyku saatinden 6 saat önce kafein yok",
                "Uyumadan önce büyük öğün yemekten kaçının",
                "Odanızı olabildiğince karanlık ve sessiz yapın",
                "Uykulardan kaçının. Uyku döngünüzü bozabilir",
                "Soğuk ve tutarlı bir sıcaklık oluşturun",
                "Sadece uykunuz geldiğinde yatağa gidin",
                "Yatmadan önce zor konuşmalardan kaçının",
                "Çarşaf ve yastık kılıflarınızı yıkayın veya değiştirin"
            ]
        },
        {
            "challenge_name": "Öz bakım",
            "challenge_description": "Öz bakım, iyi yaşamanıza ve hem fiziksel hem de zihinsel sağlığınızı iyileştirmenize yardımcı olacak şeyler yapmak için zaman ayırmaktır.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Gününü planla ve ona bağlı kal",
                "Günlük yaz, duygu ve deneyimlerini kaydet",
                "Gerçekten zevk aldığınız bir hobi edinin",
                "Çocukken en sevdiğiniz kitabı okuyun",
                "Evde egzersiz yapın. Youtube'da egzersiz videoları arayın",
                "Yeni bir şeyler pişirmeye çalışın",
                "Düşündüğünüz bir şeyi aileniz veya arkadaşlarınızla paylaşın",
                "Sabah rutini oluştur",
                "Ailenizi ve arkadaşlarınızı arayın",
                "Bir bulmaca oyunu çöz",
                "Biraz sanat eseri yapın. İnternette fikir bulabilirsiniz",
                "En sevdiğin şarkıları dinle",
                "Masa oyunları oyna",
                "Özel birine mektup yaz",
                "Yeni beceriler öğrenmek için çevrimiçi bir kursa katılın",
                "Yeni bir film izle",
                "Zihninizi ve bedeninizi dinlendirmek için güçlü bir şekerleme yapın",
                "Podcast'lerden bazılarını dinle",
                "Zihninizi sakinleştirmek ve kaygıdan kurtulmak için meditasyon yapın",
                "Rahatlatıcı bir banyo yapın",
                "Gelecek için hedeflerinizi belirleyin",
                "En sevdiğin şarkıya eşlik et",
                "Değer verdiğin biriyle görüntülü sohbet et",
                "Bir uyku rutini oluşturun",
                "Şikayet etmek yok",
                "Her zaman dua etmek için zaman ayırın.",
                "Olumsuzluğa 'hayır' deyin",
                "Yerinizi temizleyin ve düzenleyin",
                "Gelecek hafta için bir hedef belirleyin",
                "İhtiyacınız olursa yardım isteyin"
            ]
        },
        {
            "challenge_name": "Etkili Çalışma",
            "challenge_description": "Çalışmanızla nasıl daha başarılı olacağınızı öğrenmek. Daha yüksek notlar elde etmek için etkili ve net hedefler belirleyin, nasıl yapacağınızı öğrenin.zamanınızı yönetin ve çalışma becerilerinizi geliştirin.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Çalışmak için masanızı düzenleyin ve temizleyin",
                "Bir çalışma toplantısı planlayın ve çalışma materyalleri hazırlayın",
                "Zayıf yönlerinin üstesinden gel ve çalışma hedefini ve motivasyonunu bul",
                "Müfredatını çalış ve dersinde aktif olmaya başla",
                "Her zaman programınızı düzenleyin ve not alın",
                "Notlarınızı elle yazın ve anahtar kelimeleri vurgulayın",
                "50-10 kuralı. Her saatin 50 dakikasını çalışın. 10 dakikanızı zihninizi temizleyerek geçirin",
                "Uyumadan önce notlarınızı gözden geçirin",
                "Bir zamanlayıcı ayarlayın ve yalnızca tek bir göreve odaklanın",
                "Birine öğretiyormuş gibi çalış",
                "Tüm görevleri tamamlarsan kendine bir ödül sözü ver",
                "Notlarınızda renkleri ve fosforlu kalemleri kullanın",
                "Kavramları anlamak için sadece Google ve Youtube kullanın",
                "Sağlıklı beslenin. Vücudunuz daha iyi hissedecek ve daha uyanık olacaksınız",
                "Kavramları özetleyin",
                "Arkadaşınla çalış. Arkadaşından sana zor olan konularda sınav yapmasını iste",
                "Bugün veya bu hafta öğrendiklerinizi gözden geçirin",
                "Daha iyi öğrenme için uygulamaları veya flash kartları kullanın",
                "Görevlerinize öncelik verin. Önce büyük görevleri tamamlayın",
                "Bilgileri düzenlemek için zihin haritasını kullanın",
                "Dikkat dağıtıcı olmayan sessiz bir çalışma yeri seçin",
                "Stres Atmayı unutmayın. Stres seviyenizi düşük tutun ve daha az endişe edin",
                "Ödevlerine başlamadan önce notlarını gözden geçir",
                "Ödev problemlerini tekrar çalış, cevapları kapat ve kendini test et",
                "Önemli kavram veya formüllerin bir listesini yapın",
                "Kendi deneme sınavınızı yapın",
                "Sürpriz sınav yarınmış gibi çalış.",
                "Hafızanın korunmasına büyük ölçüde yardımcı olduğu için yeterince uyuyun",
                "Çalışmanıza etkili bir şekilde uyan hafıza tekniklerini arayın",
                "Yardım istemekten asla korkmayın"
            ]
        },
        {
            "challenge_name": "Çiftler İlişkisi",
            "challenge_description": "Bu ilişki sorunu, günlük yaşamlarınıza kolayca entegre edilebilecek şekilde tasarlanmıştır. challengesın çoğu yalnızca birkaç dakikanızı alır ve gün boyunca herhangi bir zamanda yapılabilir. Bazıları biraz daha fazla enerji gerektirir ve planlama, ama buna değecek.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Eşiniz hakkında sevdiğiniz şeylerin bir listesini yapın",
                "Sürpriz bir randevu gecesi planla",
                "Eşinize onu koşulsuz sevdiğinizi söyleyin",
                "İlişkiniz hakkındaki korkunuzu paylaşın",
                "Eşinizle ilgili güzel bir anınızı paylaşın",
                "Eşinize romantik bir sabah mesajı gönderin",
                "Bugün bir şey için partnerinize teşekkür edin",
                "Eşinizi iyi bir şeyle şaşırtın",
                "İlişkiniz için bir hedefinizi paylaşın",
                "Eşinize iltifat edin",
                "Bir hafta sonu kaçamağı planlayın",
                "Eski resimlere birlikte bakın",
                "İlk tanıştığınız zamanı hatırla",
                "Birlikte bir kova listesi yapın",
                "Rastgele bir kelime seçin ve partnerinizle derin bir sohbete başlayın",
                "Birlikte yapboz yap",
                "Eşinize bir aşk mektubu yazın ve daha sonra bulmaları için saklayın",
                "Eşinizin birlikte yapmaktan keyif aldığı bir şey yapın",
                "Favori bir muamele yap",
                "Eşinize hatırladığınız, hoşlarına giden bir şey söyleyin",
                "Eşinize sürpriz bir öpücük verin ve sarılın",
                "Eşinize rahatlatıcı bir masaj yapın",
                "Eşinize yatakta kahvaltı yapın",
                "Birlikte bir masa oyunu oynayın",
                "Nasıl daha iyi bir ortak olabileceğinizi sorun",
                "Ona küçük tatlı bir not bırakın",
                "Birlikte yürüyüşe çıkın",
                "Bugün partnerinize iltifat edin",
                "İlişki testi yapın",
                "Romantik bir şarkıyla yavaş dans et"
            ]
        },
        {
            "challenge_name": "Declutter",
            "challenge_description": "Fiziksel, dijital veya başka türlü olsun, hayatımızdaki dağınıklığı azaltmak, stres faktörlerinin üstesinden gelmemizi sağlar ve bu da zihinsel sağlığımıza fayda sağlar.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Dolabını temizle",
                "Kitaplarınızı düzenleyin",
                "Yatak odanızı düzenleyin",
                "Komodininizi boşaltın",
                "Postanızı sıralayın",
                "Kilerinizi düzenleyin",
                "Kullanılmayan kıyafetleri bağışlayın",
                "Bilgisayarınızın veya dizüstü bilgisayarınızın boş alanı",
                "Buzdolabınızı temizleyin ve son kullanma tarihi geçmiş ürünlerden kurtulun",
                "Arabanı temizle",
                "Eski kağıtları ve postaları gözden geçirin",
                "Dondurucunuzu boşaltın",
                "Cüzdanını temizle",
                "Mutfağınızı düzenleyin",
                "Masanızı veya çalışma alanınızı boşaltın",
                "Eski kıyafetlerden kurtulun",
                "Temizlik malzemelerinizi düzenleyin",
                "Komodininizi düzenleyin",
                "Artık kullanmadığınız uygulamaları kaldırın",
                "İlaç dolaplarını temizleyin",
                "Bilgisayarınızdaki her şeyi klasörler halinde düzenleyin",
                "Oturma odanızı düzenleyin",
                "İşlevsel depolama öğeleri satın alın",
                "Kişisel aksesuarları temizleyin",
                "Arabanızı/motosikletinizi/bisikletinizi temizleyerek vakit geçirin",
                "Takviminizi güncelleyin ve düzenleyin",
                "Ölü bitkileri temizle ve saksıları düzenle",
                "Kuru ürünleri (baharatları) düzenleyin ve süresi dolmuş ürünleri temizleyin",
                "Saklama kaplarını ve rafları düzenleyin ve etiketleyin",
                "Zihninizi temizlemek için meditasyon yapın"
            ]
        },
        {
            "challenge_name": "Verimlilik",
            "challenge_description": "İyi üretkenlik, daha iyi hedefler belirlemenize, daha etkili olmanıza, odağı ve motivasyonu artırmanıza yardımcı olabilir.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Yatağınızı sabah yapın, böylece yatağa geri dönme isteğiniz olmasın",
                "Her gün şükrettiğiniz 3 şeyi yazın",
                "İş yerini iyileştirmek için dağınık bir alan düzenleyin",
                "Telefonda daha az zaman geçirin ve daha üretken olun",
                "Planladığınız her şeyi gerçekleştirmek için bir günlük planlayıcı kullanın",
                "Dikkat dağıtmamak için telefondaki gereksiz bildirimleri kapatın",
                "Bütün hafta için bir yemek planı oluşturun",
                "Bir yapılacaklar listesi yapın ve tüm görevleri tamamlamaya çalışın",
                "Biraz temiz hava almak ve dünyayı fethetmek için motive olmak için 30 dakikalık bir yürüyüş yapın",
                "E-posta kutusunu boşaltın. Bazen biraz bunaltıcı olabilir",
                "Gün içinde hiçbir şey yapmasanız bile 30 dakika egzersiz yapın, egzersiz yaptıktan sonra süper üretken hissedeceksiniz",
                "Sosyal medyayı unutmak için yatmadan önce bir kitabın bölümünü okuyun",
                "Televizyon izlemeyin ki kendinize daha çok zaman ayırın",
                "Dolabını düzenle ve artık istemediğin şeyleri bağışla",
                "En sevdiğiniz şarkılarla bir müzik çalma listesi oluşturun ve kimsenin sizi izlemediği dans çizgisi",
                "Uyanır uyanmaz telefonunuza bakmayın yavaş ve huzurlu bir sabah geçirin",
                "10 dakika meditasyon yapın ve kendinizi yenilenmiş hissedeceksiniz",
                "Kilerinizi ve buzdolabınızı düzenleyin.",
                "Odanızı derinlemesine temizleyin. Boş alanı, zihni boşaltın",
                "Artık size neşe getirmeyen kişilerin aboneliğini iptal edin. Çok daha rahatlamış hissedeceksiniz",
                "Dinlenmek için biraz zaman ayırmak için gün içinde bir dinlenme süresi planlayın",
                "Normalden erken kalkın. Başarılı insanlar güne erken başlar.",
                "Motive edici ve ilham verici kitaplar okuyun, kendinize olan inancınızı yeniden kazanmanıza yardımcı olur",
                "Çoklu göreve çalışmayı bırak",
                "Yapmayı bırakmak istediğin şeylerin bir listesini yap",
                "Hareket edin. Yürüyün. Uzanın. Düz oturun",
                "Aklınıza gelen fikirleri yazın, ancak üzerinde çalışmaya başlamayın. Planlayın",
                "Gün boyu daha verimli olacak enerjiye sahip olmak için sağlıklı bir kahvaltının tadını çıkarın",
                "Bir şeyi bitirdiğinde, ne kadar küçük olursa olsun, onu yaz",
                "Temsilci. Her şeyi yapmak zorunda değilsin"
            ]
        },
        {
            "challenge_name": "Mutluluk",
            "challenge_description": "Bilimsel araştırmalar, mutluluğun daha yüksek üretkenlik, daha fazla yaratıcılık ve stres karşısında daha güçlü dayanıklılık gibi birçok faydayla ilişkili olduğunu gösteriyor.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Kendin hakkında sevdiğin şeyleri yaz",
                "Geçtiğin herkese gülümse",
                "Biraz egzersiz yap",
                "Yemeği pişir",
                "Sevdiğin birine sarıl",
                "Komedi filmi izle",
                "Bir arkadaşınızı arayın",
                "Kimse izlemiyormuş gibi dans et",
                "Doğaya çıkın ve bir günlüğüne kaşif olun",
                "Sevdiğin birine hediye al",
                "Yoga yapmayı dene",
                "Erken yatıp erken kalkın da",
                "İlham verici bir şeyler okuyun",
                "10 dakika meditasyon yap",
                "Gelecekte bir tatil planlayın",
                "Yeni bir tarif deneyin veya en sevdiğiniz yemeği pişirin",
                "Güzel gün batımını izle",
                "Eski arkadaşınla bağlantı kur",
                "Birini affet",
                "Yeni bir şey dene",
                "Dışarıda yürüyüşe çık",
                "En sevdiğin şarkıyı dinle",
                "Küçük bir iyilik yapın veya bir arkadaşınıza veya komşunuza yardım edin",
                "Biriyle gülüşünü paylaş",
                "Çocuklarınıza/ebeveynlerinize/arkadaşlarınıza/kardeşlerinize sarılın",
                "Köpeğinizle veya diğer evcil hayvanlarınızla oynayın",
                "Telefonunuzda daha az zaman geçirin",
                "İnsanlara senin için ne anlama geldiklerini söyle",
                "Toksik insanları ve alışkanlıkları bırak",
                "1. Günden itibaren yolculuğunuzu yansıtın"
            ]
        },
        {
            "challenge_name": "Finansal Özgürlük Mücadelesi",
            "challenge_description": "Finansal bağımsızlığın en önemli faydalarından biri, size kendi hayatınız üzerinde daha fazla kontrol sağlamasıdır.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Finansal hedeflerinizi tanımlayın",
                "Gelecek ayın bütçesini oluştur",
                "Acil durum fonu geliştirin",
                "Finansal web sitelerini ve blogları keşfedin",
                "Emeklilik için tasarruf edin",
                "Youtube'da finansal okuryazarlık vlogları bulun",
                "Minimalizmi benimseyin",
                "Bir para kitabı al ve okumaya başla",
                "Kariyerini düşün",
                "Paranızı otomatikleştirin",
                "Kredi puanınızı izleyin",
                "Paranızı bütçeleyin",
                "Bakkal faturanızı azaltmanın yollarını bulun",
                "Yüzdeyi hesaplamayı öğren",
                "Ek gelir elde etmenin yollarını keşfedin",
                "İhtiyacın olmayanı sat/kullan",
                "Yatırım hakkında daha fazla bilgi edinin",
                "Duygusal harcamaları önlemek için bir strateji bulun",
                "Daha az harcama günü",
                "Gelecekteki satın almalar için bir tasarruf planı yazın",
                "Faturaları kısmanın yollarını arayın",
                "Para yönetimi hakkında bilgi edinin",
                "Temel finans terimlerini öğrenin",
                "Kredi kartlarının nasıl çalıştığını öğrenin",
                "Borcu ödemek için bir plan yazın",
                "Gereksiz harcamalarınızı en aza indirmenin yollarını bulun",
                "Faturalarınızı otomatikleştirin",
                "İlerlemenizi kutlayın",
                "Finansal okuryazarlık kursuna kaydolun",
                "Finansal özgürlüğe giden yolda kalın"
            ]
        },
        {
            "challenge_name": "Olumlu Ebeveynlik",
            "challenge_description": "Olumlu ebeveynlik uygulamak, ebeveynler ve çocuklar arasında özsaygı, güven, öz yeterlilik, ebeveynler ve çocuklar arasında daha güçlü bağ ve daha iyi ve etkili iletişim akışı gibi olumlu gelişim sonuçları elde etmek için temel bir kılavuzdur.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Çocuğunuzla sevdiğini bildiğiniz bir şey yapın",
                "Çocuğunuza en sevdiği şeyleri sorun",
                "Kağıt tabak kelebeğimiz gibi çocuklarla zanaat yapın",
                "Çocuğunuzla tek seferde en az 30 dakika geçirin",
                "Yatma zamanı hikayesini oku",
                "Birlikte yürüyüşe çıkın",
                "Bugün çocuğunuza dört kez sarılın",
                "Çocuğunuza seveceği bir şeyler pişirin",
                "Birlikte birkaç fotoğraf çekin, hatta bir DIY fotoğraf kabini yapın",
                "Çocuğunuza hangi özel şeyi yapmak istediğini sorun",
                "Onları en sevdikleri yere götür",
                "Birlikte 'Mutlu Kutu' yapın",
                "Birlikte hikaye yazın. Çocuğunuza resim yaptırın",
                "Birlikte el izleri yapın",
                "Çocuğunuza bugün yeni bir şey yapmayı öğretin",
                "Çocuğunuza parayı öğretin",
                "Biraz müzik aç ve birlikte dans et",
                "Bir aile masa oyunu yap",
                "Onlara küçük bir hediye al ve bulmaları için evde sakla",
                "Çörek pişirin veya krep pişirin ve onları bir komşuya götürün",
                "Diğer ebeveyn için birlikte bir kart hazırlayın",
                "Bugün çocuğunuz hakkında olumlu şeyler söyleyin",
                "Onlara ne düşündüklerini sorun",
                "En sevdikleri hayvana sor ve birlikte eğlenceli bir proje yap",
                "Çocuğunuza bir yaşam becerisi öğretin",
                "Doğa yürüyüşüne çıkın. Listeden eşya toplayın",
                "Renkli bir gününüz olsun. Rengarenk giyinin, renk veren yiyecekler yiyin.",
                "Büyükanne ve büyükbaba için eğlenceli bir zanaat yap",
                "Oyun hamuruyla birlikte oynayın. Kalıp yarışmaları yapın",
                "Çocuğunuza en sevdiği anısını sorun. Tekrar yapmayı planlayın"
            ]
        },
        {
            "challenge_name": "Depresyonun üstesinden gelin",
            "challenge_description": "Bu zorluk, depresyonun üstesinden gelmeniz için size rehberlik eder ve iyileşmek için büyük bir umut olduğunu hatırlatır. Depresyon büyük ölçüde tedavi edilebilir. Depresyon yaşayan birçok insan tamamen iyileşir. Diğerleri semptomlarından bir miktar rahatlama bulur. buna değer – gelişme kapasitesidepresyondan sonraki hayatta vardır.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Depresyonu iyileştirmede dokunma çok önemlidir. Evcil hayvanları okşayın, arkadaşlarınıza ve ailenize sarılın, partnerinizle sekse devam edin veya masaj yaptırın.",
                "15 dakika fiziksel aktivite için dışarı çıkın. Koşmayı deneyin. Avluyu temizleyin. Evcil hayvanınızla yürüyüşe çıkın.",
                "Diyet, depresyonun hafifletilmesinde büyük rol oynayabilir. İştahınız olmasa bile iyi ve düzenli beslendiğinizden emin olun",
                "Yeterli uyku almak",
                "Nasıl hissettiğinizi değiştirmek için gülümseyin ve duruşunuzu değiştirin.",
                "İnsanların zihinsel sağlık sorunlarının üstesinden nasıl geldiğine dair olumlu örnekleri okuyun ve bunun sizin için de mümkün olduğunu bilin.",
                "Geleceği ve geçmişi unutun. Kendinize 'Şu anda, tam burada, şu anda sorun ne?' diye sorun",
                "Mutluluk hormonlarını artırmak için vitamin takviyesi yapın. Güneş ışığıyla deride üretilen B3 vitamini ve D vitamini eksikliği de depresyonla ilişkilendirildi",
                "İç sesinizi dinleyin. Sert mi yoksa eleştirel mi? Başkalarına da aynı yargıda bulunur musunuz? Bu düşünceler yapıcı mı yoksa yıkıcı mı?",
                "Gün ışığı ve güneş ışığı serotonini artırdığı ve D vitamini için gerekli olduğu için her gün dışarı çıktığınızdan emin olun",
                "Utanmayın. Kaç kişinin sessizce depresyona girdiğini öğrenince şaşırabilirsiniz. Aileniz ve arkadaşlarınızla konuşun.",
                "İstismarcı ilişkileri kesin",
                "Evcil hayvanınızla vakit geçirin",
                "Depresyonunuzdan daha güçlüsünüz",
                "Her gün müzik dinle",
                "Bir zamanlar seni mutlu eden şeyleri canın istemese de yap",
                "İzolasyondan kaçının",
                "Gülmek, depresyonun önemli bir panzehiridir.",
                "Neyi seviyorsan onu yap",
                "Alkol ve uyuşturucudan uzak durun",
                "Kendinizi Daha Az Yalnız Hissetmenin Bir Yolu Olarak Gönüllü Fırsatı Bulun",
                "Çevrimiçi Dünyaya Ne Zaman Katılacağınızı veya Ne Zaman Ayrılacağınızı Bilin",
                "İleriye Bakacak Bir Şey Bul",
                "'Depresyon sesinin' önerdiğinin tersini yapın",
                "Başkalarına hizmet etmenin küçük yollarını bul",
                "Sorunlar üzerinde durmayın. Bunun yerine doğru çözüme odaklanın",
                "Size bir başarı hissi verecek uygulanabilir hedefleriniz olsun",
                "Minnettar ol ve her gün 3 güzel şeyin farkına var",
                "Sevdiğiniz bir kişiden sizi düzenli olarak kontrol etmesini isteyin.",
                "Olumsuz düşüncelere meydan okuyun."
            ]
        }
    ]
}