{
    "all_challenges": [
        {
            "challenge_name": "Manage anxiety Challenge",
            "challenge_description": "Worry less and enjoy life more with our proven challenge. Say yes to challenge yourself and you will feel better in one month.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Take care of your sleeping routine.",
                "It's ok to ask for help.",
                "Acknowledge your feelings.",
                "Pray and ask for God's guidance.",
                "Write down your emotions.",
                "Visualize something inspiring.",
                "Stop negative thinking patterns.",
                "Find the positives in life.",
                "Have self compassion for yourself and your anxiety.",
                "Examine the root of any negative thoughts.",
                "Build up your courage to face something you're avoiding.",
                "It’s okay to have anxiety. Recognise the symptoms and learn how to control it.",
                "List things you avoid because of your anxiety. Share it",
                "Strengthen one of  your coping skills by doing some research",
                "Do a yoga routine on Youtube specifically for anxiety",
                "Read something that is good for your mental health",
                "Repair something that's been damaged by your anxiety",
                "Go somewhere that relaxes you and eases anxiety",
                "Eat today in a way that feels good to the body, mind, and soul",
                "Do something that helps you recharge where you feel drained",
                "Spend 20 minutes listening to the nature sounds",
                "Make sure your social media feeds are anxiety free",
                "Work on your self talk, no mean words directed at yourself",
                "Do a full body scan. Where are you holding your anxiety",
                "Focus on sleep and rest and a healthy bedtime",
                "Change one thing in your day that will improve your anxiety",
                "Practice mindfulness",
                "Scroll through your phone camera roll. When you find a picture that makes you smile, share it with whoever else is in it",
                "Reach out to someon you think might be struggling with anxiety too. Just talking about it can help both of you",
                "Check in with your goal from the Day 1. What’s your progress?"
            ]
        },
        {
            "challenge_name": "Feel Wonderful",
            "challenge_description": "Spend your time that will make you feel a bit more awesome and wonderful by taking this affective challenge.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Reflect on the amazing things you already did this year.",
                "Focus on being positive",
                "Make a list of things that make you happy.",
                "Eat your favorite childhood snacks.",
                "Dance around your house.",
                "Try to drink 8 glasses of water.",
                "Watch your favorite movie.",
                "Give your bedroom/workplace a makeover",
                "Watch the sunset/sunrise while listening to your favorite songs",
                "Make a healthy meal",
                "Buy something that you really want (chocolate, flower…)",
                "Do something nice for someone",
                "Make your own playlist with songs that bring you joy",
                "Stargaze whenever you can",
                "Order your favorite foodand treat yourself",
                "Go for a walk",
                "Make you favorite drink at home",
                "Listen to a podcast about something that interests you",
                "Put together a puzzle",
                "Watch movie from your childhood",
                "Make your own pizza/favorite meal",
                "Send someone a 'Thank You' message on Messenger/WhatsApp",
                "Wear your favorite things today.",
                "Learn a new word",
                "Make menu plan for the week",
                "Hang out with your kids/siblings",
                "Compliment 3 people today",
                "Finally finish the unfinished project",
                "No sweets, soda, or fast food today",
                "Plan a fun day with your family"
            ]
        },
        {
            "challenge_name": "Intentional Living",
            "challenge_description": "Commit to this daily small challenge will transform you life to be the best version of yourself",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Pray when you wake up today. Thank God for a brand new day with full of opportunities.",
                "Set an intention or just 3 goals for the day",
                "Be intentional with the words you speak over yourself and others",
                "Write a gratitude list, try to incorporate this every morning/night",
                "Stay away from screens at least 1 hour before bed",
                "Cook something you love and eat your meal mindfully with no distractions",
                "Have a self-care session, take a bath, doa facial mask and enjoy every second of the process",
                "Take a 20 minutes journal about your experiences this month",
                "Keep your phone away while you're having a meal",
                "Reward yourself when you get your tasks done. It can be as simple as just giving yourself time to do something you really enjoy",
                "Look in the mirror and tell yourself you're beautiful and capable of everything",
                "Do a 15-minute yoga/meditation session",
                "Listen to uplifing music. Choose to have songs in your playlist that will keep your emotions good",
                "Express your creativity today. Draw, paint, write, dance, just do something",
                "Go for a walk in nature",
                "Make a conscious choice to use social media wisely and mindfully. Set boundaries and choose the content that affects your well-being in a positive way",
                "Take 10 minutes to write down all of the things you'd love to do and make a plan to do at least one of them next month",
                "Unfollow Instagram accounts you don't enjoy anymore",
                "Allow yourself to take a few minutes to just sit and breathe. Just be in the moment",
                "Treat yourself with a slice of heaven. Go to your favorite pastry shop, buy your favorite one, sit somewhere quiet and savor every bite",
                "Pay attention to your mental health. Be intentional and aware of your emotions and state of mind. Don't be afraid to ask for help when you need it",
                "Eat and enjoy meals today without any phone or screen on",
                "Reconnect with someone. Make a plan with a friend on Messenger, Facetime, WhatApp, or meet to catch up",
                "Listen to a motivational speech on Youtube",
                "Check out the Habitualize blog",
                "Consume 3 different kinds of fruit today",
                "Write down 3 things to accomplish tomorrow",
                "Do an intuitive walking",
                "Write a journal for 10 minutes or more",
                "Dream big. Set intentions. Create a vision board"
            ]
        },
        {
            "challenge_name": "Learn New Language",
            "challenge_description": "Learning a new language is challenging but it can also be fun, simple and effortless. Following the 30 day language learning challenge will allow you to boost your language learning everday.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Learn 5 new words",
                "Try a new language app",
                "Watch a movie in the language you're learning with subtitles",
                "Write shopping/to do lists in your target language",
                "Teach someone some words and phrases",
                "Ask 'How are you?' to a friend",
                "Watch a tutorial for something in the language",
                "Write about your experience today",
                "Narrate something you’re doing",
                "Watch a Youtube video tutorial about the language",
                "Teach someone 5 new words",
                "Learn basic grammar",
                "Journal in your target language",
                "Read a news article",
                "Talk to a person or to your pet",
                "Change your phone setting for a day",
                "Write review for a book/film",
                "Read something",
                "Record yourself practicing the language",
                "Write 40 words you've learned",
                "Write how this challenge helped you",
                "Can you still remember the words you've learned on Day 1?",
                "Answer an online quiz on the target language",
                "Teach a family member with 7-10 new words",
                "Write 50 words you have learned",
                "Write something about your day",
                "Listen to a song in the language",
                "Write a story",
                "Listen to podcast",
                "Create flash cards to easily memorize words"
            ]
        },
        {
            "challenge_name": "Mindfulness Challenge",
            "challenge_description": "Mindfulness practice helps reset your mind and have a clear perspective when become unfocused or feel overwhelmed in life",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Before doing any task today, ask yourself what is your reason for doing the task and contemplate it for a moment",
                "Mindful shower. Visualize washing away your negative thoughts and concentrate on the feel of the water on your skin",
                "Before going to sleep, write down 3 things you've really appreciated from the day",
                "Practice gratitude. Start to focus on positive thoughts and let go your fearful, anxious brain pattern",
                "Reset your posture each time you sit down, gently straight your back",
                "Get some exercise today and focus on the physical sensations",
                "Practice active listening today. This means focusing on what the other person is saying and responding in a way that is appropriate",
                "Do a body scan. Bring your attention to your body and send the breath to any areas of tension",
                "Find peaceful spot where you can sit down and write whatever you're feeling at the moment",
                "Be curious today. Practice being interested in what is going on and putting your attention towards learning more about it",
                "Notice your sense when you taste, touch, smell and hear something",
                "Mindful breathing. Breath in, hold for 3 seconds and then exhale",
                "Walk mindfully. Take a stance to feel connected to the earth and solidly rooted to the ground",
                "Drink a mindful cup of tea. Focus on the taste, smell and warmth",
                "Practice non-judgemental listening while having a conversation",
                "Do one thing at a time and focus just on that",
                "Sit comfortably, feel your feet firmly grounded on the floor, straight back and hands on your lap. Focus on the breathing for a while",
                "Listen to yourself answering the phone or while you're having a conversation, the way you talk, the words you choose",
                "Appreciate everything today. Notice everything tha thappens and find a way to appreciate it",
                "Observe mindfully. Describe mentally an object in details, the color, texture, shape…",
                "Sit in a cozy and quite place for a while",
                "Do one task at a time and keep your focus on whatever you are doing",
                "Practice empathy towards someone who normally makes you feel upset",
                "Find an article or video about why mistakes and failures are good for you. Take it to heart so that you can spend less time focusing on the past",
                "Eat mindfully. Taste the dish and try to guess how many ingredients went into it",
                "Look around you. Look at a particular leaf/tree/flower and focus your attention",
                "Find funny movies, tell funny jokes, listen to funny people . Laugh as much as possible today",
                "Take advantage of times you need to wait and be mindful by focusing on your sens and breath",
                "Brush your teeth with your non-dominant hand today to help encourage attention",
                "Always check on the Habitualizer App and be reminded to be mindful at all times"
            ]
        },
        {
            "challenge_name": "Family Time",
            "challenge_description": "Family time offers many benefits, including building confidence, creating a stronger emotional bond between family members, improving communication skills, better performance in school and reduced behavioral issues, as well as providing an opportunity to make memories built on fun, laughter and togetherness",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Ask your children to share one kind of thing they did today or plan to do. Offer your plans first",
                "Teach you children a card trick or card game, or play one that you both enjoy",
                "Choose a landmark, city, or country that interests your child and spend time exploring it via Youtube or Facebook",
                "Make special dinner. Put fresh flower on the table, light candles, and take a moment to express gratitude that you are a family",
                "Take a family photo",
                "Go to the church and pray together",
                "Family movie and pizza night",
                "Draw portraits of each other",
                "Cook dinner together",
                "Play 'would you rather' together",
                "Do a puzzle together",
                "Bake a cake or cookies for your family",
                "Plan a family picnic",
                "Play video games together",
                "Sing karaoke songs together",
                "Take an after-dinner walk together",
                "Play a board game together",
                "Plan a trip or vacation",
                "Carve out a special time to tell your child jokes. Laugh at his or her too",
                "Cook a special dinner for your family",
                "Create a family bucket list",
                "Look at old family photos or watch old videos",
                "Go for a walk/hike together",
                "Watch a sunrise (or sunset) together",
                "Spend 15 minutes with each family member",
                "Visit a nature center and appreciate its beauty",
                "Attend to your child's extra curricular activities",
                "Encourage your kids in their hobbies",
                "Surprise your kids with a trip or fun activity",
                "Always tell them how much you love them"
            ]
        },
        {
            "challenge_name": "Get out of your comfort zone",
            "challenge_description": "Implement this challenge will lead you to become a stronger person, you to gain self-confidence through experiences, help you continue your personal development, and get a chance to meet new people.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Get up 1 hour before you normally would",
                "Say 'Hi!' to a random stranger",
                "Do not get on social media or watch TV for 24 hours",
                "Walk up to someone at work and give them a genuine compliment",
                "Reach out to someone you haven't spoken to in a while",
                "Take a different route while going to work/school",
                "Have a difficult conversation with someone about a topic you've been avoiding",
                "Buy something you'd never buy at the grocery store",
                "Start learning a new language",
                "Walk up to stranger, smile, and give them a compliment",
                "Ask for help if you need it or help someone without them asking",
                "Make plans for the weekend or for the dayoff",
                "Try a new hobby/sport that you've always wanted too",
                "Start a conversation with  a stranger",
                "Try a digital detox today",
                "Create a vision board (get inspired on Pinterest)",
                "Take yourself out on a date",
                "Ask someone on a date/complimet someone who intimidates you",
                "Start a blog/youtube channel/ Instagram page/ a book, whatever your heart desires",
                "Go somewhere new to eat or to take out",
                "Start a new challenge with a friend (you can use one from this app or create your own)",
                "Try a new workout (zumba, yoga, pilates, kickboxing, etc)",
                "Give someone a spontaneous gift",
                "Sign up for something new",
                "Take a new route going home/work/school",
                "Go to sleep earlier than expected",
                "Travelling a new place",
                "Developing a new skill",
                "Send 5 gratitude message to 5 people",
                "Try a new look"
            ]
        },
        {
            "challenge_name": "Find Inner Peace",
            "challenge_description": "Inner peace calms our mind and allows us to see our path much clearer, helping us focus and keep track of our goals.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Try aromatherapy. Scent can evoke vivid and realistic meories. When we smell something good, we feel relaxed",
                "Plan for tomorrow. This is not only gives you more time in the morning, but it also makes your life calmer and simpler, allowing you time to plan ahead",
                "With our busy and distracted lives, it can be easy to forget about showing appreciation to the people we interact with every day. Take some time to show gratitude for the people around you",
                "Try eating something and focus on your five senses. Really focus on each sense, taste, smell, touch and sight.",
                "Declutter a space in your home. This is a path to healing emotional blocks and inner confusion. Create a calm, peaceful environment",
                "Smile in the mirror. This may seem ridiculous, but it has many benefits to your well being. It slows the heart, relaxes the body and releases hormones to counteact stress",
                "Take a deep breath and close your eyes. Mentally list 5 things you fell grateful for. This can shift your thoughts from negative to positive",
                "Set a timer for 60 seconds and focus solely on your breathing. Notice how it sound and how your body feels",
                "Have a mindful bath. Take a time out, turn the lights down. Let the water flow over your body and focus on the sensations and warmth you feel",
                "Create a tea or coffee ritual. All you really need to do is slow down. Pay attention to what you are doing and savor the taste",
                "If your body is tense throughout the day, take a moment to relax. Take a deep breath, relax your shoulders, and unclench your jaw",
                "Set 3 daily goals. This is a manageable number and allows you the time and mental energy needed focus on them mindlfully and thoroughly",
                "Try a 4 minute meditation. Set a 4 minute alarm on your phone, sit comfortably, close your eyes, and breath naturally. If your mind starts to wander, bring it back to your breathing",
                "Hug  someone tight and take 3 big breaths together. Breathing will ground you",
                "Take a digital break. Don't rely on your digital devices as a source of comfort. These create a false sense of urgency and leave us feeting as though we are missing something",
                "Instead of judging what someone is saying, mindfully listen to them, and give attention to what is being said",
                "Walking is very calming on the body, mind and sprit. Start by finding a suitable location. Observe the environment around you, stop and focus on the trees, the foliage and the ground you are walking on",
                "Focus on the moment. A basic tip is to stop comparing the present with the past and focus on what is happeing at the moment. It could be as simple as focusing your attention on a task you are doing",
                "Stand up and breathe. Feel your connection to the earth",
                "Scan your body and notice phusical sensations or emotions. Discharge any unpleasant sensations, emotions or feelings on the out breath. Notice any pleasant feelings and fill them you up on the breath",
                "Direct your attention to what you are thinking about in the present. Being aware of your mental activity can help you gain perspective on your thoughts",
                "Know yourself and Love yourself",
                "Stay out of negative things",
                "Identify and let go of the factors that stop your peace",
                "Close your eyes when you are angry",
                "Stop caring about others think of you",
                "Peace comes by living a meaningful life",
                "Always pray when you wake up in the morning and before going to sleep",
                "Resolve the conflicts of your life",
                "Accept limitations to foster resiliency"
            ]
        },
        {
            "challenge_name": "Night Routine",
            "challenge_description": "Night routine results of getting sufficient hours of sleep, you will have a sharper focus and a higher energy level for a productive day come morning",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Reflect on the day. Write at least one thing that went pretty well",
                "Take a moment to communicate with God through prayer. Open your heart to him, release everything that’s on your mind, and thank him for everything that happened during the day. This is a great way to not only practice gratitude, but to also stay connected with God.",
                "Take a moment to reflect on what you have to do the next day and plan accordingly.",
                "Grab a paper and write down whatever is on your mind. This only means that you can go to sleep without having to worry about what you’ll do tomorrow because it’s already written down",
                "Have a good sleep environment. Keep the bedroom at a good temperature, use blackout curtains or a sleeo mask to block the light",
                "Write a journal. Take the time to pause and reflect",
                "Light some scented candles and play a relaxing playlist",
                "Do some stretching/yoga before bed",
                "Write a gratitude list",
                "Read a good book before going to sleep. Helps you unwind and sleep better.",
                "Plan your next day tasks, food, outfit, …",
                "Send a special good night to text to someine you love",
                "Take a nice hot shower or bath",
                "Cut out caffeine, alcohol, or sugar at least 3 hours before bed",
                "Meditate/pray. Just be alone with your thoughts",
                "Tidy up your place.You'll be able to feel calmer and relaxed",
                "Have a light dinner before bed",
                "Set intentions for tomorrow",
                "Diffuse some essentails oils to imporve your sleep quality",
                "Avoid checking emails, news, studying ro working before sleep",
                "Don't go to bed hungry. Eat some almonds, a banana or porridge to help you sleep better",
                "Avoid your phone at least 1 hour before going to sleep",
                "Drink some camomile tea or other herbal tea (decaffeinated) before bed",
                "Take a warm bath or shower about an hour or two before bedtime can do wonders to help you relax in time for bed",
                "Make sure to drink water before go to bed. We lose moisture when we sleep. It's important to hydrate well ",
                "Brush your teeth in 2 minutes",
                "Think about your last 24 hours and write down at least one thing that went pretty well",
                "Write top priorities for tomorrow in a planner or notebook.",
                "Reduce anxiety aith a To-Do List",
                "Always pray before go to sleep and forgive yourself"
            ]
        },
        {
            "challenge_name": "Positive Affirmation",
            "challenge_description": "This challenge can help strengthen self-worth by boosting both your positive opinion of yourself and your confidence in your ability to achieve your goals. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "I embrace the posibilities and potential of this day",
                "I choose to be happy and to love myself today",
                "I am willing to change and grow",
                "I embrace experiences outside of my comfort zone",
                "I am talented and intelligent",
                "Challenges bring me opportunities to grow",
                "I trust my intuition to guide me",
                "I am in love with myself and my body",
                "I am in peace with my past",
                "I will be kind to myself and others today",
                "I choose faith over fear",
                "Today will be a positive day",
                "I am grateful for all that I have",
                "I am more than my negative thoughts",
                "I accept myself unconditionally",
                "I am healthy and happy",
                "Everything that is happening now is happening for my ultimate good",
                "I am in charge of how I feel and today I'm choosing  happiness",
                "Today I will not compare myself to the strangers on the Internet",
                "I have the power to create change",
                "My feelings and thoughts are valid",
                "I have abundance and inner strength",
                "I am ready to see things with a new perspective",
                "I am worthy of love and respect",
                "My mind is clear, strong and focused",
                "I face the day with energy and courage",
                "I am inspired and motivated by my dreams",
                "I deserve the best and accept it now",
                "I am unique and confident",
                "I see endless opportunities in my life"
            ]
        },
        {
            "challenge_name": "Daily Journaling",
            "challenge_description": "Journaling helps control your symptoms and improve your mood by: Helping you prioritize problems, fears, and concerns. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Write about someone who inspires you",
                "Write about 5 blessings in your life",
                "Post 30 facts about yourself",
                "What are you excited about?",
                "What are the 3 lessons do you want your children/friends/siblings to learn from you",
                "Write about a current challenge",
                "Write solutions to the problems",
                "Write down what you want to learn in the future",
                "List what you love about your parents/family",
                "What would your perfect day look like?",
                "Write all the things wou want to achieve this year",
                "What do you need more in your life?",
                "Make a list of things you would do if you weren't afraid, and how would they impact your life",
                "What piece of advice would you give to ten years old you?",
                "How can you make tomorrow better?",
                "Write about all the things that make you nervous and how could you change that?",
                "What is something you learned yesterday?",
                "Write about a past struggle that you overcome. How has it made you stronger?",
                "What is something you are looking forward t right now?",
                "What brings you the most joy? How can you make more time for it?",
                "What is something that's missing from your life? And how can you change that?",
                "Write about a time that you felt proud of yourself",
                "If you had 3 wishes for this year, what would you wish for?",
                "What's on your mind right now?",
                "Write about something or someone that you miss",
                "What do you value most about today?",
                "Write about a moment in your life that makes you happy when you think about it",
                "If life stopped today, what would you regret not doing?",
                "How do you want people to remember you and why?",
                "What aspects of yourself do you need to show more love?"
            ]
        },
        {
            "challenge_name": "Morning Routine",
            "challenge_description": "Having a morning routine can increase your energy, productivity and positivity.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Sit or stand in the sun for 20 minutes while you go through your morning routine, eating breakfast, checking the news, or exercising",
                "Choose 3 Things to Accomplish Before Midday",
                "Prioritize Your Day.What tasks are you hoping to get done today?",
                "This morning, take a few minutes to listen to your thoughts and feelings, identify them, and shift them if you need to",
                "Write a to-do list for today",
                "Connect with your family and friends or send a simple good morning text to someone you love",
                "Take a Deep Breath and Say Thank You For This Day",
                "Write 5 things you're proud of yourself ",
                "Meditate for 15 minutes",
                "Drink a glass of water before breakfast",
                "Open your windows for fresh air and let some sunshine in",
                "Take a walk or do a home workout session",
                "Read some chapters of your favorite book",
                "Do a 15 minutes yoga",
                "Listen to a podcast or audiobook while you're getting ready",
                "Go outside and just breath the fresh morning air",
                "Make a list of 3 things to do for the day",
                "Avoid checking morning news and social media",
                "Make your bed and tidy up your space to feel more productive",
                "Choose an affirmation to guide your day. For example:' 'Today is a great day.'",
                "Take a shower and get ready even if you're not going anywhere",
                "Do not check any form of social media first thing in the morning",
                "When you wake up, attract good idea to have good vibes all day",
                "Write a morning gratitude list",
                "Listen to your favorite music playlist to put you in a good mood in the morning",
                "Do some stretching after you wake up",
                "Make yourself a healthy and delicious breakfast",
                "Don't Check Notifications Before Breakfast",
                "Paint, play a musical intrument. Do something that fuels your creativity",
                "Wake up with a smile and a positive attitude for the day ahead"
            ]
        },
        {
            "challenge_name": "Positive Mindset",
            "challenge_description": "Thinking positively is a habit we can train ourselves to do. Research shows it has a positive impact on health both body and mind.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Practice smiling. Smile at strangers, in the mirror, smile whenever you can. You'll feel so much more positive",
                "Appreciate the little things today. Someone's smile, the sunset, your morning coffee, the warmth of a sun ray, the sky",
                "Instead of thinking 'my life is horrible', things aren't great at the moment, but this shall pass. Better days are coming",
                "Rather than thinking of the horrible things that might happen, consider the great things that could come from your current situation",
                "Instead of saying 'I give up', say 'this is hard but I'm going to keep trying'",
                "Stop caring for what other people think. The thoughts of other people are not designed to make you happy and positive",
                "Instead of thinking 'why this is happening to me?', Think 'what is this teaching me?'",
                "Trust that better things are coming if you're open to the possibilities'",
                "Instead of thinking 'I can't do this', think 'I don't know how to do this yet'",
                "Don’t compare yourself to anybody else today. It's a total waste of time",
                "Remember, even if you can't control a certain situation, you can control your respose",
                "Meditate. This will help you with overthinking, lowers your stress and can help you to be more positive",
                "Practice positive self talk. You can use positive affirmations with your meditation",
                "Start or end you day writing your gratitude journal",
                "Surround yourself with people you love and who love you back",
                "Listen to music. Music can have a positive effect on your health and day",
                "Practice acceptance. Appreciate everything you have right now",
                "Listen to an inspirational youtube video/podcast. Fill you brain with motivation",
                "List 5 things that made you smile today",
                "Instead of saying 'I failed', say 'Mistakes help me learn'",
                "Limit social media time. Spend more time creating and working on yourself that consuming other people's content",
                "Write down your top priorities and plans for the future knowing that you will achieve everything you want",
                "Stay present and appreciate the beauty of the moment. (Feel the sun in your face, appreciate the fresh air….)",
                "Be proud of yourself on the little wins today (and in your day to day)",
                "Shift your mood by doing something you really enjoy",
                "For an upcoming situation you're worried about, write down the best scenario that can happen",
                "Focus on solutions, not the problems",
                "Let go of the expectations of others and focus on what matters",
                "Surround yourself with positive kind of people",
                "Take care of yourself. When we feel our best, we can see things in a more positive manner"
            ]
        },
        {
            "challenge_name": "Self Love",
            "challenge_description": "Engaging in a self-care routine has been clinically proven to reduce or eliminate anxiety and depression, reduce stress, improve concentration, minimize frustration and anger, increase happiness, and improve energy",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "List 10 things you love about yourself",
                "Say 'Thank You' to your five body parts in the mirror today",
                "Write a post note everytime you are proud of yourself. Put it in a 'I am proud of myself' jar ",
                "Forgive yourself for a regret you've been hanging on to and let it go",
                "Write a list with all the things you love about yourself",
                "Treat you body with health food and lots of water",
                "Clean your room/desk/closet and clean out all the thins that no longer bring joy to you",
                "Take a picture of yourself and write down everything you love about your appearance",
                "Unfollow anyone who makes you feel insecure and bad about yourself",
                "Go somewhere you can watch the sunrise/sunset and enjoy it by yourself",
                "Always dress for yourself. Wear your favorite outfit today",
                "Reflect in your week and write 5 things you are grateful for",
                "Make journal about how you feel and what's going on in your life",
                "Go on date with yourself. Go to your favorite restaurant, go to the beach…Somewhere you feel good and relaxed where you can connect with yourself",
                "Plan a reward to yourself when you finish this challenge",
                "Take a long walk and connect with nature",
                "Write down the biggest challenge you've overcome",
                "Unplug for the whole day form any tech (unless you have work to do)",
                "Eat your favorite meal or dessert",
                "Write a love letter to yourself",
                "Write down what you've learned from this challenge and don't forget about your reward that you planned in Day 15",
                "What is something you loved to do when you were a child? Do it today",
                "Make a nourishing meal",
                "Catch up with an old friend or relative",
                "Take a power nap in the afternoon",
                "Watch a movie you have been wanting to",
                "Make a video collage of your favorite selfies",
                "List 5 things you are really good at",
                "Write about an achievement you are proud of",
                "Pick 3 positive affirmations to say everyday. Ex. I can do it."
            ]
        },
        {
            "challenge_name": "Improve Confidence",
            "challenge_description": "Confidence can also give you a positive outlook on life, increasing your mental and emotional wellbeing.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Unfollow all social media accounts that makes you feel insecure about yourself",
                "Work on accepting compliments rather than denying them today",
                "Be conscious about your posture. Good posture develop more confidence",
                "Do something you loved to do as a child",
                "Do something challenging today, rememver that we don't grow when we're in our comfort zone",
                "Write down 10 things you love about yourself",
                "Say yes to something you normally wouldn't",
                "Implement a new healthy habit",
                "Speak up when you'vd got something to say",
                "Focus on what you want rather than what you don't want",
                "Work on improving your skills on something you love to do or that you would like to start doing",
                "Write down all of your accomplishments including the ones in the future",
                "Do a quick workout, take a shower, get ready and put on an outfit that makes you feel great",
                "Go out by yourself to watch the sunset",
                "Reach out to an old friend",
                "Come up with positive thoughts for every negative one",
                "Give someone a good piece of advice",
                "Do a workout you enjoy",
                "Work on small things. Little achievements make you feel good",
                "Pause and reflect on something before you act, instead of reacting impulsively",
                "Be aunthentic and embrace your uniqueness. Life is not a competition",
                "Don’t talk negatively about other people for the entire day",
                "Write out one thing you've done for your family",
                "Write a love letter to yourself",
                "Write out 3 fears and how can you overcome each",
                "Identify a change you want to make and the steps to do it",
                "Do something that make you feel special",
                "Ask three friends to tell yo their favorite thing about you",
                "Write down 3 of your mistakes and lessons learned",
                "Set an attainable goal for yourself"
            ]
        },
        {
            "challenge_name": "Act of Kindness",
            "challenge_description": "An act of kindness can boost feelings of confidence, being in control, happiness and optimism. They may also encourage others to repeat the good deeds they've experienced themselves – contributing to a more positive community.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Show support to someone today",
                "Donate blood. Save lives",
                "Leave a positive review of your favorite restaurant/coffee shop",
                "Make a family member/loved one breakfast in bed",
                "Ask someone how you can help them - and then do it.",
                "Smile at someone who needs it",
                "Leave a positive review of your favorite app",
                "Give a tip for the trash collector",
                "Ask your parents/siblings/children if there is anything you can do to help them",
                "Write a list of reasons why you love someone and give it to them",
                "Give someone a tip",
                "Spend the day saying only positive things aout people",
                "Tell someone you love how much you appreciate them",
                "Do a chore that you typically wouldn't do",
                "Say 'Have a nice day' at least 3 person you encountered",
                "Buy a meal for a homeless person",
                "Help someone before they ask",
                "Bake cookies and gift it to someone",
                "Try to donate clothes/toys/books to a local charity",
                "Call someone you haven't talked to in a while",
                "Most important of all, always be kind to yourself",
                "Write a thank you note to someone who made an impact in your life",
                "Let someone go ahead in front of you while falling in line",
                "Surprise someone with a gift",
                "Put positive sticky notes on mirrors",
                "Check in with an elderly relative",
                "Give 3 honest compliments to someone you love",
                "Say thank you as much as you can",
                "Compliment someone",
                "Avoid negative thoughts for a day. Show yourself some kindness, too!"
            ]
        },
        {
            "challenge_name": "Mental Wellness",
            "challenge_description": "When it comes to your mental health, self-care can help you manage stress, lower your risk of illness, and increase your energy. Even small acts of self-care in your daily life can have a big impact.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Manage Anxiety",
                "Before going to sleep, write 3 things you've appreciated from the day",
                "Practice self compassion",
                "Practice mindfulness. Pull yourself back to the present",
                "Spend time on a hobby. Boost your mood and engage in a task you enjoy",
                "Take social media break for the day and focus on the life around you",
                "Plant something. Taking care of something other than yourself has many mental benefits.",
                "Think of the best parts of your life while you're waiting for something",
                "Learn how to talk about mental wellness to your parents, educators, friends, family members, and others close to you.",
                "Open up about something on your mind",
                "Focus on resting and relaxing today and go to bed early",
                "Go for a walk without looking at your phone, focused on your surroundings",
                "Imagine a happy place whenever you feel anxious",
                "Read or watch something that's good for your mental health",
                "Imagine your dream life and write down what steps you need to talk to get there",
                "Practice positive self talk",
                "Renew your motivation",
                "Start exploring the root of any negative thoughts",
                "Write down 5 things you're grateful for",
                "Practice self-care and pamper yourself",
                "Write down positive affirmations and read them before sleep",
                "Take 3 full deep breaths whenever you can",
                "Plan a healthy meal",
                "Give a shoutout to someone you value.",
                "Call someone you love that you haven't talked in a while",
                "Try a guided meditation",
                "Learn a new skill to shift your thoughts away from problems and anxiety",
                "Write journal of everything that goes on in your mind",
                "Eat a nutritious meal.",
                "Sing your favorite song. Singing helps regulate breathing and decrease anxiety"
            ]
        },
        {
            "challenge_name": "Fix your sleep schedule",
            "challenge_description": "These daily challenges intended to help you adopt a healthy bedtime routine, get enough sleep, and wake up feeling refreshed each morning.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Put your phone away so in the next morning you have to get out of bed to turn the alarm off",
                "Turn off all of your screens 1 hour before bed to get your brain ready to sleep",
                "Reward yourself with a tasty breakfast so you have more motivation to wake up early",
                "Shower at night, a hot shower or bath will help you to relax before bed",
                "Try to wake up at the same time every day, consistency is the key",
                "After dinner put your cozy pajamas on, journal, read a nook and prepare to relax and let your mind unwind",
                "Drink lots of water after you wake up, you're not going to feel too tired throughout the day",
                "Try to eat dinner early, since you'll digest your food earlier, you body can focus on getting the resrful sleep it needs",
                "Have a quick morning workout/run, this will help you feel energized during the day and sleepy when you should be going to bed",
                "Meditate before bed, it's relaxing and stress reducing",
                "Open the windows when you wake up and le thte sun rays touch your skin",
                "Pre-plan your activities tonight and also your to-do-list for the next morning",
                "Listen to your favorite playlist after you wake up to put you on the good mood",
                "Set a reminder that will alert you 30 minutes before it's time to go to bed",
                "Expend energy during the day so you fell tired at night",
                "Stop drinking water 1 hour before bed so you don't have to wake up during the nignt or get up as you're trying to fall asleep",
                "Make your bed after waking up so yo won't be tempted to go back to sleep again",
                "Listen to light music before bedtime, this will help you to sleep soon",
                "After waking up head straight up to the bathroomo to wash your face or have a nice shower",
                "Eat food with magnesium (like almonds, peanuts and squash seeds) and zinc to improve your quality of sleep",
                "Breath fresh air when you wake up. Refresh your thoughts that helps your brain clear out in the morning",
                "Use your bed purely for sleep and sex only. No watching tv.",
                "No caffaine 6 hours before the chosen time of sleep",
                "Avoid eating big meals before you sleep",
                "Make your room as dark and quiet as possible",
                "Avoid naps. It can disrupt your sleep cycle",
                "Establish a cool and consistent temperature",
                "Go to bed only when you are sleepy",
                "Avoid difficult conversation before bedtime",
                "Wash or change your bed sheets and pillow cases"
            ]
        },
        {
            "challenge_name": "Self care",
            "challenge_description": "Self-care means taking the time to do things that help you live well and improve both your physical health and mental health.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Plan your day and stick to it",
                "Write a journal, log your emotions and experiences",
                "Practice a hobby you really enjoy",
                "Read a favorite book from when you were a child",
                "Exercise at home. Search workout videos on Youtube",
                "Try to cook something new",
                "Share something you are thinking about with your parents or friends",
                "Create morning routine",
                "Call your family and friends",
                "Solve a puzzle game",
                "Do some artworks. You can find ideas on the internet",
                "Listen to your favorite songs",
                "Play board games",
                "Write a letter to someone special",
                "Take an online course to learn something new skills",
                "Watch a new film",
                "Take a powerful nap to rest your mind and body",
                "Listen to some of the podcast",
                "Meditate to calm your mind and free from anxiety",
                "Take a relaxing bath",
                "Set your goals for the future",
                "Sing along to your favorite song",
                "Video chat with someone you care about",
                "Establish a sleep routine",
                "No complaining",
                "Always find time to pray.",
                "Say 'No' to negativity",
                "Clean and organize your place",
                "Set a goal for next week",
                "Ask for help if you need it"
            ]
        },
        {
            "challenge_name": "Effective Study",
            "challenge_description": "Learning how to become mo successful with your study. Set an effective and clear goals in order to achieve higher grades, learn how to manage your time and improve your study skills.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Organize and clean your desk for studying",
                "Plan a study session and prepare study materials",
                "Overcome your weaknesses and find your study goal and motivation",
                "Study your syllabus and start being active in your course",
                "Always organize your schedule and take notes",
                "Hand write your notes and highlights key words",
                "50-10 rule. Study 50 minutes of every hours. Spend 10 minutes cleaning your mind",
                "Review your notes before you sleep",
                "Set a timer and solely focus on a single task",
                "Study like you are teaching someone",
                "Promise yourself a reward if you complete all the tasks",
                "Use colors and highlighters in your notes",
                "Use only Google and Youtube to understand concepts",
                "Eat healthy. Your body will feel better and you will be more alert",
                "Summarize concepts",
                "Study with your friend. Ask your friend to quiz you on subjects that are difficult",
                "Review what you learned today or this week",
                "Use apps or flash cards for better learning",
                "Prioritize your tasks. Complete the major tasks first",
                "Use mind map to organize information",
                "Choose a quiet study place without distractions",
                "Don’t forget to De-Stress. Keep your stress level low and worry less",
                "Review your notes before you begin your homework",
                "Restudy homework problems, cover the answers and quiz yourself",
                "Make a list of important concept or formulas",
                "Make your own mock exam",
                "Study like the surprise exam is tomorrow.",
                "Get enough sleep as it greatly aids memory retention",
                "Search for memory techniques that suit your study effectively",
                "Never be afraid to ask for help"
            ]
        },
        {
            "challenge_name": "Couples Relationship",
            "challenge_description": "This relationship challenge is designed to be easy to integrate into your daily lives. Many of the challenges should only take a few minutes to do and can be done at any time throughout the day. Some requires a bit more energy and planning, but it will be worth it.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Make a list of things you love about your partner",
                "Plan a surprise date night",
                "Tell your partner you love them unconditionally",
                "Share the fear that you have about your relationship",
                "Share a good memory you have about your partner",
                "Send your partner a romantic morning message",
                "Thank your partner for something today",
                "Surprise your partner with something good",
                "Share a goal you have for your relationship",
                "Give your partner a compliment",
                "Plan a weekend getaway",
                "Look at old pictures together",
                "Reminisce about when you first met",
                "Make a bucket list together",
                "Pick a random word and start a deep conversation with your partner",
                "Do a puzzle together",
                "Write a love letter to your partner and hide it for them to find later",
                "Do something your partner enjoy doing together",
                "Make a favorite treat",
                "Tell your partner something you remember they like",
                "Give your partner a surprise kiss and hug",
                "Give your partner a  relaxing massage",
                "Make your partner breakfast in bed",
                "Play a board game together",
                "Ask him/her how you can be a better partner",
                "Leave him/her a sweet little note",
                "Take a walk together",
                "Give your partner a compliment today",
                "Take a relationship quiz",
                "Slow dance to a romantic song"
            ]
        },
        {
            "challenge_name": "Declutter",
            "challenge_description": "Reducing the clutter in our lives—be it physical, digital or otherwise—allows us to tackle stressors head-on and that benefits our mental health.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Clean out your closet",
                "Organize your books",
                "Organize your bedroom",
                "Clear out your nightstand",
                "Sort through your mail",
                "Organize your pantry",
                "Donate unused clothes",
                "Clear space of your computer or laptop",
                "Clean your fridge and get rid of expired items",
                "Clean your car",
                "Go through old papers and mail",
                "Empty your freezer",
                "Clean your wallet",
                "Organize your kitchen",
                "Clear off your desk or workspace",
                "Get rid of old clothes",
                "Organize your cleaning supplies",
                "Organize your dresser",
                "Remove apps you don't use anymore",
                "Clean out medicine cabinets",
                "Organize everything into folders on your computer",
                "Organize your living room",
                "Buy functional storage items",
                "Purge personal accessories",
                "Spend time cleaning your car/motorcycle/bike",
                "Update and organize your calendar",
                "Clear dead plants and organize pots",
                "Organize dry goods (spices) and clean out expired goods",
                "Organize and label the storage containers and shelves",
                "Meditate to clean your mind"
            ]
        },
        {
            "challenge_name": "Productivity",
            "challenge_description": "Good productivity can help you set better goals, be more effective, increase focus and boost motivation.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Make your bed in the morning so you won't be tempeted to go back to bed",
                "Write down 3 things you are grateful for every day",
                "Organize a cluttered space to improve work place",
                "Spend less time on the phone and be more productive",
                "Use a daily planner to achieve everything you have planned",
                "Turn off unnecessary notifications on the phone to avoid distractions",
                "Create a meal plan for the entire week ",
                "Make a to-do list and try to complete all the tasks",
                "Take a 30 minutes walk to get some fresh air and feel motivated to conquer the world",
                "Declutter email box. Sometimes it can be a little overwhelming",
                "Exercise for 30 minutes even if you don't do anything during the day, you will feel super productive after you workout",
                "Read chapter of a book before bed to forget about social media",
                "Avoid to watch TV so you have more time for yourself",
                "Organize your closet and donate the things you don’t want anymore",
                "Create a music playlist with your favorite songs and dance line no one is watching you",
                "Don’t check your phone right after you wake up and have a slow and peaceful morning",
                "Meditate for 10 minutes and you will feel rejuvenated",
                "Organize your pantry and fridge.",
                "Deep clean your room. Clear space, clear mind",
                "Unsubscribe people that don’t bring you joy anymore. You will feel much more relieved",
                "Schedule a rest period during your day to have some time to relax",
                "Wake up earlier than normal. Successful people start their day early.",
                "Read motivational and inspirational books help you to regain your faith in yourself",
                "Stop trying to multi task",
                "Make a list of things you want to stop doing",
                "Move. Walk. Stretch. Sit up straight",
                "Write down ideas that pop up into your head, but don’t start working on them. Schedule them",
                "Enjoy a healthy breakfast to have an energy to be more productive all day",
                "When you finish something, no matter how small, write it down",
                "Delegate. You don’t have to do everything"
            ]
        },
        {
            "challenge_name": "Happiness",
            "challenge_description": "Scientific studies show that happiness is associated with a host of benefits, including higher productivity, greater creativity, and stronger resilience in the face of stress.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Write down things you love about yourself",
                "Smile at everyone you pass",
                "Do some exercise",
                "Cook the dinner",
                "Hug someone you love",
                "Watch a comedy film",
                "Call a friend",
                "Dance like nobody is watching",
                "Go out into nature and be an explorer for a day",
                "Buy a gift for someone you love",
                "Try doing yoga",
                "Go to sleep early and wake up early as well",
                "Read something inspiring",
                "Meditate for 10 minutes",
                "Plan a future vacation",
                "Try a new recipe or cook your favorite meal",
                "Watch the beautiful sunset",
                "Connect with your old friend",
                "Forgive someone",
                "Try something new",
                "Go for a walk outside",
                "Listen to your favorite song",
                "Do one small act of kindness or help a friend or neighbor",
                "Share a laugh with someone",
                "Give your kids/parents/friends/siblings a hug",
                "Play with your dog or other pets",
                "Spend less time on your phone",
                "Tell people how much they mean to you",
                "Let go of toxic people and habit",
                "Reflect on your journey from Day 1"
            ]
        },
        {
            "challenge_name": "Financial Freedom Challenge",
            "challenge_description": "One of the most important benefits of financial independence is that it gives you greater control over your own life. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Define your financial goals",
                "Create next month's budget",
                "Develop an emegency fund",
                "Discover financial websites and blogs",
                "Save for retirement",
                "Find financial literacy vlogs on Youtube",
                "Adopt minimalism",
                "Buy a money book and start reading it",
                "Consider your career",
                "Automate your money",
                "Monitor your credit score",
                "Budget your money",
                "Find ways to cut down your grocery bill",
                "Learn to calculate percentage",
                "Explore ways to make additional income",
                "Sell what you don't need/use",
                "Read more about investing",
                "Find a strategy to prevent emotional spending",
                "Less-spend day",
                "Write a saving plan for future purchases",
                "Look for the ways to cut down bills",
                "Read about money management",
                "Learn basic finance terms",
                "Learn how credit cards work",
                "Write a plan to pay off debt",
                "Find ways to minimize your non-essential spendings",
                "Automate your bills",
                "Celebrate your progress ",
                "Sign up for financial literacy course",
                "Stay on the road to financial freedom"
            ]
        },
        {
            "challenge_name": "Positive Parenting",
            "challenge_description": "Practicing positive parenting is an essential guide between parents and children to have positive developmental outcomes like self-esteem, trust, self-competence, stronger bonding between parents and children, and better and effective flow of communication.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Do something with your child that you know they love",
                "Ask your child what are their favorites",
                "Do craft with the kids such as our paper plate butterfly",
                "Spend at least 30 minutes of one on one time with your child",
                "Read bed time story",
                "Take a walk together",
                "Hug your child four times today",
                "Cook something for your child that they like ",
                "Take some photos together or even make a DIY photobooth",
                "Ask your child what special thing they would like to do",
                "Take them to their favorite place",
                "Make a 'Happy box' together ",
                "Write a story together. Get your child to draw pictures",
                "Make handprints together",
                "Teach your child how to do something new today",
                "Teach your child about money",
                "Put on some music and dance together",
                "Make a family board game",
                "Get a small gift for them and hid it in the home for them to find",
                "Bake muffins or Cook pancakes and take them to a neighbor",
                "Make a card for the other parent together",
                "Speak positive things over your child today",
                "Ask them what they think about",
                "Ask their favorite animal and do a fun project together",
                "Teach your child a life skill",
                "Go on a nature walk. Collect items from a list",
                "Have a color day. Dress in the color, eat foods that colors.",
                "Do a fun craft for the grandparents",
                "Play with play dough together. Have a moulding competitions",
                "Ask your child their favorite memory. Plan to do it again"
            ]
        },
        {
            "challenge_name": "Overcome Depression",
            "challenge_description": "This challenge guides you to overcome depression and  reminds you that there is great hope for healing. Depression is highly treatable. Many people who experience depression will fully recover. Others find some level of relief from their symptoms. The fight is worth it – the capacity to flourish in life after depression is there.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Touch is very important in healing depression. Stroke pets, hug friends and family, resume sex with your partner or have a massage.",
                "Get outside for 15 minutes of physical activity. Try running. Clean the yard. Take a walk with your pet.",
                "Diet can play a huge part in helping alleviate depression. Make sure you eat well and regularly, even if you have no appetite",
                "Get enough sleep",
                "Smile and change your posture to change how you feel. ",
                "Read positive examples of how people have overcome mental health issues and know it is possible for you too.",
                "Forget the future and the past. Ask yourself 'Right now, right here in this very moment what is wrong?'",
                "Supplement your vitamins to increase happy hormones. A lack of vitamin B3 and vitamin D, which is made in the skin by sunlight, has also been linked to depression",
                "Listen to your inner voice. Is it harsh or critical? Would you treat others with the same judgement? Are these thoughts contructive or destructive?",
                "Make sure you get outside every day as daylight and sunlight increase serotonin and is needed for vitamin D",
                "Don't feel ashamed. You might be surprised to learn how many people suffer from depression silently. Talk with your family and friends.",
                "Cut off abusive relationships",
                "Spend time with your pet",
                "You are stronger than your depression",
                "Listen to music everyday",
                "Do things which once made you happy even though you don’t feel like it",
                "Avoid isolation",
                "Laughter is an important antidote to depression.",
                "Do what you love",
                "Avoid alcohol and drugs",
                "Find a Volunteer Opportunity as a Way to Feel Less Lonely",
                "Know When to Engage or Disengage From the Online World",
                "Find Something to Look Forward To",
                "Do the opposite of what the ‘depression voice’ suggests",
                "Find small ways to be of servife to others",
                "Don’t dwell on problems. Focus on the right solution instead",
                "Have workable goals to give you a senst of accomplishment",
                "Be grateful and  notice 3 good things in every day",
                "Ask a loved one to check in with you regularly.",
                "Challenge negative thoughts."
            ]
        }
    ]
}