{
    "all_challenges": [
        {
            "challenge_name": "चिंता चुनौती प्रबंधित करें",
            "challenge_description": "चिंता कम करें और हमारी सिद्ध चुनौती के साथ जीवन का अधिक आनंद लें। अपने आप को चुनौती देने के लिए हाँ कहें और आप एक महीने में बेहतर महसूस करेंगे।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "अपनी नींद की दिनचर्या का ध्यान रखें।",
                "मदद मांगना ठीक है।",
                "अपनी भावनाओं को स्वीकार करें।",
                "प्रार्थना करें और ईश्वर से मार्गदर्शन मांगें।",
                "अपनी भावनाओं को लिखें।",
                "कुछ प्रेरक की कल्पना करें।",
                "नकारात्मक सोच पैटर्न बंद करो।",
                "जीवन में सकारात्मक खोजें।",
                "अपने लिए और अपनी चिंता के प्रति आत्म-करुणा रखें।",
                "किसी भी नकारात्मक विचार की जड़ की जांच करें।",
                "जिस चीज से आप परहेज कर रहे हैं उसका सामना करने के लिए अपने साहस का निर्माण करें।",
                "चिंता होना ठीक है। लक्षणों को पहचानें और इसे नियंत्रित करना सीखें।",
                "उन चीजों की सूची बनाएं जिन्हें आप अपनी चिंता के कारण टालते हैं। इसे साझा करें",
                "कुछ शोध करके अपने मुकाबला कौशल में से एक को मजबूत करें",
                "विशेष रूप से चिंता के लिए Youtube पर योग दिनचर्या करें",
                "कुछ ऐसा पढ़ें जो आपके मानसिक स्वास्थ्य के लिए अच्छा हो",
                "किसी ऐसी चीज़ की मरम्मत करें जो आपकी चिंता से क्षतिग्रस्त हो गई हो",
                "कहीं जाना है जो आपको आराम देता है और चिंता को कम करता है",
                "आज इस तरह से खाओ जो शरीर, मन और आत्मा को अच्छा लगे",
                "कुछ ऐसा करें जो आपको थका हुआ महसूस करने पर रिचार्ज करने में मदद करे",
                "प्रकृति की आवाज़ सुनने में 20 मिनट बिताएं",
                "सुनिश्चित करें कि आपके सोशल मीडिया फीड चिंता मुक्त हैं",
                "अपनी स्वयं की बात पर काम करें, अपने आप पर निर्देशित कोई मतलबी शब्द नहीं",
                "एक पूरे शरीर का स्कैन करें। आप अपनी चिंता को कहाँ पकड़ रहे हैं",
                "नींद और आराम और स्वस्थ सोने के समय पर ध्यान दें",
                "अपने दिन में एक चीज़ बदलें जिससे आपकी चिंता में सुधार होगा",
                "ध्यान का अभ्यास करें",
                "अपने फोन कैमरा रोल के माध्यम से स्क्रॉल करें। जब आपको कोई तस्वीर मिलती है जो आपको मुस्कुराती है, तो इसे किसी और के साथ साझा करें",
                "किसी ऐसे व्यक्ति तक पहुंचें जो आपको लगता है कि चिंता से भी जूझ रहा है। इसके बारे में बात करने से आप दोनों को मदद मिल सकती है",
                "पहले दिन से अपने लक्ष्य के साथ चेक इन करें। आपकी प्रगति क्या है?"
            ]
        },
        {
            "challenge_name": "अद्भुत महसूस करें",
            "challenge_description": "अपना समय व्यतीत करें जो आपको इस स्नेहपूर्ण चुनौती को लेकर थोड़ा अधिक भयानक और अद्भुत महसूस कराए।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "इस साल आपने जो अद्भुत चीजें की हैं, उन पर चिंतन करें।",
                "सकारात्मक होने पर ध्यान दें",
                "उन चीजों की सूची बनाएं जो आपको खुश करती हैं।",
                "अपने बचपन के पसंदीदा स्नैक्स खाओ।",
                "अपने घर के आसपास नाचो।",
                "8 गिलास पानी पीने की कोशिश करो।",
                "अपनी पसंदीदा फिल्म देखें।",
                "अपने बेडरूम/कार्यस्थल को एक मेकओवर दें",
                "अपने पसंदीदा गाने सुनते हुए सूर्यास्त/सूर्योदय देखें",
                "स्वस्थ भोजन करें",
                "कुछ ऐसा खरीदें जो आप वास्तव में चाहते हैं (चॉकलेट, फूल ...)",
                "किसी के लिए कुछ अच्छा करो",
                "उन गीतों के साथ अपनी खुद की प्लेलिस्ट बनाएं जो आपको आनंदित करें",
                "जब भी आप कर सकते हैं स्टारगेज़",
                "अपना पसंदीदा खाना ऑर्डर करें और अपना इलाज करें",
                "सैर के लिए जाओ",
                "आप घर पर पसंदीदा पेय बनाएं",
                "किसी ऐसी चीज़ के बारे में पॉडकास्ट सुनें जिसमें आपकी रुचि हो",
                "एक पहेली को एक साथ रखो",
                "बचपन से फिल्म देखें",
                "अपना खुद का पिज्जा / पसंदीदा भोजन बनाएं",
                "मैसेंजर/व्हाट्सएप पर किसी को 'धन्यवाद' संदेश भेजें",
                "आज अपनी पसंदीदा चीजें पहनें।",
                "एक नया शब्द सीखें",
                "सप्ताह के लिए मेनू योजना बनाएं",
                "अपने बच्चों / भाई-बहनों के साथ घूमें",
                "आज 3 लोगों की तारीफ करें",
                "आखिरकार अधूरे प्रोजेक्ट को पूरा करें",
                "आज कोई मिठाई, सोडा, या फास्ट फूड नहीं",
                "अपने परिवार के साथ एक मजेदार दिन की योजना बनाएं"
            ]
        },
        {
            "challenge_name": "जानबूझकर जीना",
            "challenge_description": "इस दैनिक छोटी चुनौती के लिए प्रतिबद्ध होने से आपका जीवन खुद का सबसे अच्छा संस्करण बन जाएगा",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "आज जब आप उठें तो प्रार्थना करें। अवसरों से भरे एक नए दिन के लिए ईश्वर का धन्यवाद करें।",
                "एक इरादा या दिन के लिए सिर्फ 3 लक्ष्य निर्धारित करें",
                "उन शब्दों के साथ जानबूझकर रहें जो आप अपने और दूसरों के बारे में बोलते हैं",
                "एक आभार सूची लिखें, इसे हर सुबह / रात में शामिल करने का प्रयास करें",
                "सोने से कम से कम 1 घंटे पहले स्क्रीन से दूर रहें",
                "कुछ ऐसा पकाएं जिससे आप प्यार करते हैं और अपना भोजन ध्यान से बिना किसी विकर्षण के खाएं",
                "एक आत्म-देखभाल सत्र लें, स्नान करें, दोआ फेशियल मास्क करें और प्रक्रिया के हर सेकंड का आनंद लें",
                "इस महीने के अपने अनुभवों के बारे में 20 मिनट की पत्रिका लें",
                "भोजन करते समय अपना फ़ोन दूर रखें",
                "जब आप अपने कार्यों को पूरा कर लेते हैं तो खुद को पुरस्कृत करें। यह उतना ही सरल हो सकता है जितना कि अपने आप को कुछ ऐसा करने के लिए समय देना जिसे आप वास्तव में पसंद करते हैं",
                "आईने में देखो और अपने आप को बताओ कि तुम सुंदर हो और हर चीज में सक्षम हो",
                "15 मिनट का योग/ध्यान सत्र करें",
                "उत्साहजनक संगीत सुनें। अपनी प्लेलिस्ट में ऐसे गाने चुनें जो आपकी भावनाओं को अच्छा बनाए रखें",
                "आज अपनी रचनात्मकता व्यक्त करें। ड्रा करें, पेंट करें, लिखें, नृत्य करें, बस कुछ करें",
                "प्रकृति में टहलने जाएं",
                "सोशल मीडिया का बुद्धिमानी और दिमाग से उपयोग करने के लिए एक सचेत विकल्प बनाएं। सीमाएं निर्धारित करें और ऐसी सामग्री चुनें जो आपकी भलाई को सकारात्मक तरीके से प्रभावित करे",
                "उन सभी चीजों को लिखने के लिए 10 मिनट का समय लें जो आप करना पसंद करते हैं और अगले महीने उनमें से कम से कम एक करने की योजना बनाएं",
                "उन Instagram खातों को अनफ़ॉलो करें जिनका आप अब आनंद नहीं लेते हैं",
                "अपने आप को बस बैठने और सांस लेने के लिए कुछ मिनट दें। बस पल में रहें",
                "स्वर्ग के एक टुकड़े के साथ खुद का इलाज करें। अपनी पसंदीदा पेस्ट्री की दुकान पर जाएं, अपना पसंदीदा खरीदें, कहीं शांत बैठें और हर काटने का स्वाद लें",
                "अपने मानसिक स्वास्थ्य पर ध्यान दें। जानबूझकर और अपनी भावनाओं और मन की स्थिति के बारे में जागरूक रहें। जरूरत पड़ने पर मदद मांगने से न डरें",
                "आज बिना किसी फोन या स्क्रीन के भोजन करें और आनंद लें",
                "किसी के साथ फिर से कनेक्ट करें। मैसेंजर, फेसटाइम, व्हाट्सएप पर किसी मित्र के साथ योजना बनाएं या पकड़ने के लिए मिलें",
                "यूट्यूब पर एक प्रेरक भाषण सुनें",
                "आदतन ब्लॉग देखें",
                "आज 3 अलग-अलग तरह के फलों का सेवन करें",
                "कल को पूरा करने के लिए 3 चीजें लिखें",
                "एक सहज चलना करें",
                "10 मिनट या उससे अधिक समय के लिए एक पत्रिका लिखें",
                "बड़े सपने देखें। इरादे सेट करें। एक विजन बोर्ड बनाएं"
            ]
        },
        {
            "challenge_name": "नई भाषा सीखें",
            "challenge_description": "नई भाषा सीखना चुनौतीपूर्ण है लेकिन यह मजेदार, सरल और सहज भी हो सकती है। 30 दिन की भाषा सीखने की चुनौती का पालन करने से आप अपनी भाषा सीखने को हर रोज बढ़ावा देंगे।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "5 नए शब्द सीखें",
                "एक नई भाषा ऐप आज़माएं",
                "जिस भाषा में आप सबटाइटल के साथ सीख रहे हैं उसमें एक फिल्म देखें",
                "अपनी लक्षित भाषा में खरीदारी/करने के लिए सूचियां लिखें",
                "किसी को कुछ शब्द और वाक्यांश सिखाएं",
                "पूछो 'आप कैसे हैं?' दोस्त बनाना",
                "भाषा में कुछ के लिए एक ट्यूटोरियल देखें",
                "आज के अपने अनुभव के बारे में लिखें",
                "आप जो कुछ कर रहे हैं उसे बताएं",
                "भाषा के बारे में एक Youtube वीडियो ट्यूटोरियल देखें",
                "किसी को 5 नए शब्द सिखाएं",
                "बुनियादी व्याकरण सीखें",
                "आपकी लक्षित भाषा में जर्नल",
                "एक समाचार लेख पढ़ें",
                "किसी व्यक्ति या अपने पालतू जानवर से बात करें",
                "एक दिन के लिए अपनी फ़ोन सेटिंग बदलें",
                "एक किताब/फिल्म के लिए समीक्षा लिखें",
                "कुछ पढ़ो",
                "भाषा का अभ्यास करते हुए खुद को रिकॉर्ड करें",
                "आपके द्वारा सीखे गए 40 शब्द लिखें",
                "लिखें कि इस चुनौती ने आपकी कैसे मदद की",
                "क्या आप अभी भी उन शब्दों को याद कर सकते हैं जो आपने पहले दिन सीखे हैं?",
                "लक्षित भाषा पर एक ऑनलाइन प्रश्नोत्तरी का उत्तर दें",
                "परिवार के किसी सदस्य को 7-10 नए शब्द सिखाएं",
                "आपके द्वारा सीखे गए 50 शब्द लिखें",
                "अपने दिन के बारे में कुछ लिखें",
                "भाषा में एक गाना सुनें",
                "कहानी लिखें",
                "पॉडकास्ट सुनें",
                "शब्दों को आसानी से याद रखने के लिए फ्लैश कार्ड बनाएं"
            ]
        },
        {
            "challenge_name": "माइंडफुलनेस चैलेंज",
            "challenge_description": "माइंडफुलनेस अभ्यास आपके दिमाग को रीसेट करने में मदद करता है और एक स्पष्ट दृष्टिकोण रखता है जब आप एकाग्र हो जाते हैं या जीवन में अभिभूत महसूस करते हैं",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "आज कोई भी कार्य करने से पहले अपने आप से पूछें कि उस कार्य को करने का आपका कारण क्या है और एक पल के लिए उस पर विचार करें",
                "सावधानीपूर्वक स्नान। अपने नकारात्मक विचारों को दूर करने की कल्पना करें और अपनी त्वचा पर पानी की अनुभूति पर ध्यान केंद्रित करें",
                "सोने जाने से पहले, 3 चीजें लिख लें जो आपने वास्तव में उस दिन से सराहना की हैं",
                "कृतज्ञता का अभ्यास करें। सकारात्मक विचारों पर ध्यान देना शुरू करें और अपने भयभीत, चिंतित मस्तिष्क पैटर्न को जाने दें",
                "हर बार जब आप बैठते हैं तो अपना आसन रीसेट करें, धीरे से अपनी पीठ को सीधा करें",
                "आज कुछ व्यायाम करें और शारीरिक संवेदनाओं पर ध्यान दें",
                "आज सक्रिय रूप से सुनने का अभ्यास करें। इसका मतलब है कि दूसरा व्यक्ति क्या कह रहा है और उचित तरीके से जवाब दे रहा है, उस पर ध्यान केंद्रित करना",
                "बॉडी स्कैन करें। अपना ध्यान अपने शरीर पर लाएं और सांस को तनाव के किसी भी क्षेत्र में भेजें",
                "शांतिपूर्ण स्थान खोजें जहाँ आप बैठ सकें और जो कुछ भी आप इस समय महसूस कर रहे हैं उसे लिख सकें",
                "आज जिज्ञासु बनें। जो हो रहा है उसमें दिलचस्पी लेने का अभ्यास करें और अपना ध्यान इसके बारे में अधिक जानने की ओर लगाएं",
                "जब आप कुछ चखते हैं, छूते हैं, सूंघते हैं और सुनते हैं तो अपनी इंद्रियों पर ध्यान दें",
                "सावधानी से साँस लेना। साँस अंदर लें, 3 सेकंड के लिए रुकें और फिर साँस छोड़ें",
                "दिमाग से चलें। पृथ्वी से जुड़ाव महसूस करने के लिए एक रुख अपनाएं और जमीन पर मजबूती से टिके रहें",
                "चाय का ध्यानपूर्वक प्याला पीएं। स्वाद, गंध और गर्मी पर ध्यान दें",
                "बातचीत करते समय गैर-निर्णयात्मक सुनने का अभ्यास करें",
                "एक समय में एक काम करें और उसी पर ध्यान केंद्रित करें",
                "आराम से बैठो, अपने पैरों को फर्श पर मजबूती से, सीधे पीठ और हाथों को अपनी गोद में महसूस करो। थोड़ी देर के लिए श्वास पर ध्यान केंद्रित करें",
                "अपने आप को फोन का जवाब देते हुए सुनें या जब आप बातचीत कर रहे हों, जिस तरह से आप बात करते हैं, जो शब्द आप चुनते हैं",
                "आज हर चीज की सराहना करें। जो कुछ भी होता है उसे नोटिस करें और उसकी सराहना करने का एक तरीका खोजें",
                "ध्यान से देखें। मानसिक रूप से किसी वस्तु का विवरण, रंग, बनावट, आकार में वर्णन करें ...",
                "थोड़ी देर के लिए एक आरामदायक और काफी जगह पर बैठें",
                "एक समय में एक ही कार्य करें और जो भी कर रहे हैं उस पर अपना ध्यान केंद्रित करें",
                "किसी ऐसे व्यक्ति के प्रति सहानुभूति का अभ्यास करें जो सामान्य रूप से आपको परेशान करता है",
                "गलतियाँ और असफलताएँ आपके लिए अच्छी क्यों हैं, इसके बारे में एक लेख या वीडियो खोजें। इसे दिल से लें ताकि आप अतीत पर ध्यान केंद्रित करने में कम समय बिता सकें",
                "ध्यान से खाओ। पकवान का स्वाद चखो और अनुमान लगाने की कोशिश करो कि उसमें कितनी सामग्री चली गई",
                "अपने चारों ओर देखें। एक विशेष पत्ते/पेड़/फूल को देखें और अपना ध्यान केंद्रित करें",
                "मजेदार फिल्में ढूंढें, मजेदार चुटकुले सुनाएं, मजाकिया लोगों को सुनें। आज जितना हो सके हंसें",
                "अपनी इंद्रियों और सांसों पर ध्यान केंद्रित करके आपको प्रतीक्षा करने और सावधान रहने की आवश्यकता के समय का लाभ उठाएं",
                "ध्यान को प्रोत्साहित करने में मदद करने के लिए आज अपने दांतों को अपने गैर-प्रमुख हाथ से ब्रश करें",
                "हमेशा आदतन ऐप पर जांच करें और हर समय सावधान रहने के लिए याद दिलाएं"
            ]
        },
        {
            "challenge_name": "पारिवारिक समय",
            "challenge_description": "पारिवारिक समय कई लाभ प्रदान करता है, जिसमें आत्मविश्वास का निर्माण, परिवार के सदस्यों के बीच एक मजबूत भावनात्मक बंधन बनाना, संचार कौशल में सुधार, स्कूल में बेहतर प्रदर्शन और व्यवहार संबंधी मुद्दों को कम करना, साथ ही साथ मस्ती पर बनी यादें बनाने का अवसर प्रदान करना, हँसी और एक साथ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "अपने बच्चों से एक तरह की बात साझा करने के लिए कहें जो उन्होंने आज किया या करने की योजना बना रहे हैं। पहले अपनी योजनाओं की पेशकश करें",
                "अपने बच्चों को ताश की चाल या ताश का खेल सिखाएं, या ऐसा कोई खेल खेलें जो आप दोनों को पसंद हो",
                "एक मील का पत्थर, शहर या देश चुनें जो आपके बच्चे की रुचि रखता है और इसे Youtube या Facebook के माध्यम से तलाशने में समय व्यतीत करता है",
                "खास भोजन करें। मेज पर ताजे फूल रखें, मोमबत्तियां जलाएं, और कृतज्ञता व्यक्त करने के लिए कुछ समय निकालें कि आप एक परिवार हैं",
                "एक पारिवारिक फ़ोटो लें",
                "चर्च जाओ और एक साथ प्रार्थना करो",
                "पारिवारिक फिल्म और पिज्जा रात",
                "एक दूसरे के चित्र बनाएं",
                "रात का खाना एक साथ पकाएं",
                "खेलें 'क्या आप एक साथ पसंद करेंगे",
                "एक पहेली एक साथ करो",
                "अपने परिवार के लिए केक या कुकीज बेक करें",
                "एक पारिवारिक पिकनिक की योजना बनाएं",
                "एक साथ वीडियो गेम खेलें",
                "एक साथ कराओके गाने गाएं",
                "रात के खाने के बाद साथ में टहलें",
                "एक साथ बोर्ड गेम खेलें",
                "एक यात्रा या छुट्टी की योजना बनाएं",
                "अपने बच्चे को चुटकुले सुनाने के लिए एक विशेष समय निकालें। उस पर भी हंसें",
                "अपने परिवार के लिए एक विशेष रात का खाना पकाएं",
                "एक परिवार बकेट लिस्ट बनाएं",
                "पुरानी पारिवारिक तस्वीरें देखें या पुराने वीडियो देखें",
                "एक साथ टहलने / लंबी पैदल यात्रा के लिए जाएं",
                "एक साथ सूर्योदय (या सूर्यास्त) देखें",
                "परिवार के प्रत्येक सदस्य के साथ 15 मिनट बिताएं",
                "एक प्रकृति केंद्र पर जाएँ और उसकी सुंदरता की सराहना करें",
                "अपने बच्चे की पाठ्येतर गतिविधियों में भाग लें",
                "अपने बच्चों को उनके शौक में प्रोत्साहित करें",
                "अपने बच्चों को एक यात्रा या मजेदार गतिविधि से आश्चर्यचकित करें",
                "हमेशा उन्हें बताएं कि कितनाआप उन्हें प्यार करते हैं"
            ]
        },
        {
            "challenge_name": "अपने कम्फर्ट जोन से बाहर निकलो",
            "challenge_description": "इस चुनौती को लागू करने से आप एक मजबूत व्यक्ति बनेंगे, आप अनुभवों के माध्यम से आत्मविश्वास हासिल करेंगे, आपको अपने व्यक्तिगत विकास को जारी रखने में मदद मिलेगी, और नए लोगों से मिलने का मौका मिलेगा।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "आप सामान्य रूप से 1 घंटे पहले उठें",
                "नमस्ते कहे!' एक यादृच्छिक अजनबी के लिए",
                "सोशल मीडिया पर न आएं या 24 घंटे टीवी न देखें",
                "काम पर किसी के पास चलो और उनकी सच्ची तारीफ करो",
                "किसी ऐसे व्यक्ति से संपर्क करें जिससे आपने कुछ समय से बात नहीं की है",
                "काम/विद्यालय जाते समय कोई दूसरा रास्ता अपनाएं",
                "किसी ऐसे विषय के बारे में किसी के साथ कठिन बातचीत करें जिसे आप टाल रहे हैं",
                "कुछ ऐसा खरीदें जो आप किराने की दुकान पर कभी नहीं खरीदेंगे",
                "एक नई भाषा सीखना शुरू करें",
                "अजनबी के पास जाओ, मुस्कुराओ, और उनकी तारीफ करो",
                "यदि आपको इसकी आवश्यकता हो तो मदद मांगें या बिना पूछे किसी की मदद करें",
                "सप्ताहांत या दिन के लिए योजना बनाएं",
                "एक नया शौक/खेल आज़माएं जिसे आप हमेशा से चाहते हैं",
                "एक अजनबी के साथ बातचीत शुरू करें",
                "आज ही डिजिटल डिटॉक्स आज़माएं",
                "एक विज़न बोर्ड बनाएं (Pinterest पर प्रेरित हों)",
                "खुद को डेट पर ले जाओ",
                "किसी से डेट पर पूछें / किसी ऐसे व्यक्ति की तारीफ करें जो आपको डराता हो",
                "एक ब्लॉग / यूट्यूब चैनल / इंस्टाग्राम पेज / एक किताब शुरू करें, जो भी आपका दिल चाहता है",
                "खाने या बाहर ले जाने के लिए कहीं नया जाओ",
                "एक दोस्त के साथ एक नई चुनौती शुरू करें (आप इस ऐप से एक का उपयोग कर सकते हैं या अपना खुद का बना सकते हैं)",
                "एक नया कसरत आज़माएं (ज़ुम्बा, योग, पाइलेट्स, किकबॉक्सिंग, आदि)",
                "किसी को सहज उपहार दें",
                "कुछ नया करने के लिए साइन अप करें",
                "घर/कार्य/विद्यालय जाने के लिए एक नया मार्ग अपनाएं",
                "उम्मीद से पहले सो जाओ",
                "एक नई जगह की यात्रा",
                "एक नया कौशल विकसित करना",
                "5 लोगों को 5 आभार संदेश भेजें",
                "एक नया रूप आज़माएं"
            ]
        },
        {
            "challenge_name": "आंतरिक शांति पाएं",
            "challenge_description": "आंतरिक शांति हमारे दिमाग को शांत करती है और हमें अपने रास्ते को और अधिक स्पष्ट देखने की अनुमति देती है, जिससे हमें ध्यान केंद्रित करने और अपने लक्ष्यों पर नज़र रखने में मदद मिलती है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "अरोमाथेरेपी का प्रयास करें। सुगंध ज्वलंत और यथार्थवादी यादें पैदा कर सकती है। जब हम कुछ अच्छा सूंघते हैं, तो हम आराम महसूस करते हैं",
                "कल के लिए योजना बनाएं। यह न केवल आपको सुबह में अधिक समय देता है, बल्कि यह आपके जीवन को शांत और सरल बनाता है, जिससे आपको आगे की योजना बनाने का समय मिलता है",
                "हमारे व्यस्त और विचलित जीवन के साथ, उन लोगों की सराहना करना भूलना आसान हो सकता है जिनसे हम हर दिन बातचीत करते हैं। अपने आस-पास के लोगों के लिए कृतज्ञता दिखाने के लिए कुछ समय निकालें",
                "कुछ खाने की कोशिश करो और अपनी पांच इंद्रियों पर ध्यान केंद्रित करो। वास्तव में प्रत्येक इंद्रिय, स्वाद, गंध, स्पर्श और दृष्टि पर ध्यान केंद्रित करें।",
                "अपने घर में एक जगह खाली करें। यह भावनात्मक अवरोधों और आंतरिक भ्रम को ठीक करने का एक मार्ग है। एक शांत, शांतिपूर्ण वातावरण बनाएं",
                "आईने में मुस्कुराओ। यह हास्यास्पद लग सकता है, लेकिन इससे आपकी भलाई के लिए कई लाभ हैं। यह हृदय को धीमा कर देता है, शरीर को आराम देता है और तनाव का सामना करने के लिए हार्मोन जारी करता है",
                "एक गहरी सांस लें और अपनी आंखें बंद करें। मानसिक रूप से उन 5 चीजों की सूची बनाएं जिनके लिए आप आभारी थे। यह आपके विचारों को नकारात्मक से सकारात्मक में बदल सकता है",
                "60 सेकंड के लिए टाइमर सेट करें और केवल अपनी सांस लेने पर ध्यान केंद्रित करें। ध्यान दें कि यह कैसा लगता है और आपका शरीर कैसा महसूस करता है",
                "सावधानीपूर्वक स्नान करें। कुछ समय निकालें, रोशनी कम करें। पानी को अपने शरीर पर बहने दें और संवेदनाओं और गर्माहट पर ध्यान केंद्रित करें जो आप महसूस करते हैं",
                "एक चाय या कॉफी अनुष्ठान बनाएं। आपको वास्तव में केवल धीमा करना है। आप जो कर रहे हैं उस पर ध्यान दें और स्वाद का स्वाद लें",
                "यदि आपका शरीर पूरे दिन तनाव में रहता है, तो आराम करने के लिए कुछ समय निकालें। एक गहरी सांस लें, अपने कंधों को आराम दें, और अपने जबड़े को साफ करें",
                "3 दैनिक लक्ष्य निर्धारित करें। यह एक प्रबंधनीय संख्या है और आपको समय और मानसिक ऊर्जा की आवश्यकता होती है, उन पर ध्यानपूर्वक और पूरी तरह से ध्यान केंद्रित करने की अनुमति देता है",
                "4 मिनट के ध्यान का प्रयास करें। अपने फोन पर 4 मिनट का अलार्म सेट करें, आराम से बैठें, अपनी आंखें बंद करें, और स्वाभाविक रूप से सांस लें। यदि आपका मन भटकने लगे, तो इसे अपनी श्वास पर वापस लाएं",
                "किसी को कसकर गले लगाओ और एक साथ 3 बड़ी सांसें लें। सांसें आपको धराशायी कर देंगी",
                "डिजिटल ब्रेक लें। आराम के स्रोत के रूप में अपने डिजिटल उपकरणों पर भरोसा न करें। ये तात्कालिकता की झूठी भावना पैदा करते हैं और हमें इस तरह छोड़ देते हैं जैसे कि हम कुछ याद कर रहे हैं",
                "कोई क्या कह रहा है, इसका न्याय करने के बजाय, उनकी बात ध्यान से सुनें और जो कहा जा रहा है उस पर ध्यान दें",
                "चलना शरीर, मन और आत्मा को बहुत शांत करता है। एक उपयुक्त स्थान ढूंढकर शुरू करें। अपने आस-पास के वातावरण का निरीक्षण करें, रुकें और पेड़ों, पत्ते और जिस जमीन पर आप चल रहे हैं, उस पर ध्यान केंद्रित करें",
                "इस पल पर ध्यान दें। एक बुनियादी सलाह है कि वर्तमान की तुलना अतीत से करना बंद कर दें और इस समय जो हो रहा है उस पर ध्यान केंद्रित करें। यह आपके द्वारा किए जा रहे कार्य पर अपना ध्यान केंद्रित करने जितना आसान हो सकता है",
                "खड़े हो जाओ और सांस लो। पृथ्वी से अपने संबंध को महसूस करो",
                "अपने शरीर को स्कैन करें और शारीरिक संवेदनाओं या भावनाओं को नोटिस करें। किसी भी अप्रिय उत्तेजना, भावनाओं या भावनाओं को बाहर की सांस पर छोड़ दें। किसी भी सुखद भावनाओं को नोटिस करें और उन्हें सांस पर भरें",
                "आप वर्तमान में क्या सोच रहे हैं, उस पर अपना ध्यान केंद्रित करें। अपनी मानसिक गतिविधि से अवगत होने से आपको अपने विचारों पर परिप्रेक्ष्य प्राप्त करने में मदद मिल सकती है",
                "खुद को जानो और खुद से प्यार करो",
                "नकारात्मक बातों से दूर रहें",
                "उन कारकों को पहचानें और जाने दें जो आपकी शांति को रोकते हैं",
                "गुस्से में आँखे बंद कर लो",
                "दूसरों की परवाह करना बंद करो जो तुम्हारे बारे में सोचते हैं",
                "शांति एक सार्थक जीवन जीने से आती है",
                "हमेशा सुबह उठकर और सोने से पहले प्रार्थना करें",
                "अपने जीवन के संघर्षों को हल करें",
                "लचीलापन को बढ़ावा देने के लिए सीमाएं स्वीकार करें"
            ]
        },
        {
            "challenge_name": "नाइट रूटीन",
            "challenge_description": "पर्याप्त घंटों की नींद लेने के नियमित परिणाम, सुबह आने वाले उत्पादक दिन के लिए आपके पास एक तेज फोकस और उच्च ऊर्जा स्तर होगा",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "दिन को प्रतिबिंबित करें। कम से कम एक ऐसी चीज़ लिखें जो बहुत अच्छी रही",
                "प्रार्थना के माध्यम से भगवान के साथ संवाद करने के लिए कुछ समय निकालें। उसके लिए अपना दिल खोलो, अपने दिमाग में जो कुछ भी है उसे छोड़ दो, और दिन के दौरान जो कुछ भी हुआ उसके लिए उसे धन्यवाद दें। यह न केवल कृतज्ञता का अभ्यास करने का एक शानदार तरीका है, बल्कि रहने के लिए भी है भगवान के साथ जुड़ा हुआ है।",
                "अगले दिन आपको क्या करना है, इस पर चिंतन करने के लिए कुछ समय निकालें और उसके अनुसार योजना बनाएं।",
                "एक कागज पकड़ो और जो कुछ भी आपके दिमाग में है उसे लिख लें। इसका मतलब केवल यह है कि आप इस बारे में चिंता किए बिना सो सकते हैं कि आप कल क्या करेंगे क्योंकि यह पहले से ही लिखा हुआ है",
                "नींद का अच्छा वातावरण रखें। बेडरूम को अच्छे तापमान पर रखें, प्रकाश को अवरुद्ध करने के लिए काले पर्दे या स्लीओ मास्क का उपयोग करें",
                "एक पत्रिका लिखें। रुकने और प्रतिबिंबित करने के लिए समय निकालें",
                "कुछ सुगंधित मोमबत्तियां जलाएं और आराम से प्लेलिस्ट चलाएं",
                "सोने से पहले कुछ स्ट्रेचिंग / योगा करें",
                "एक आभार सूची लिखें",
                "सोने से पहले एक अच्छी किताब पढ़ें। आपको आराम करने और बेहतर नींद लेने में मदद करता है।",
                "अपने अगले दिन के कार्यों की योजना बनाएं, भोजन, पहनावा, ...",
                "जिसे आप प्यार करते हैं उसे पाठ करने के लिए एक विशेष शुभ रात्रि भेजें",
                "एक अच्छा गर्म स्नान करें या स्नान करें",
                "सोने से कम से कम 3 घंटे पहले कैफीन, शराब, या चीनी काट लें",
                "ध्यान/प्रार्थना करें। बस अपने विचारों के साथ अकेले रहें",
                "अपना स्थान व्यवस्थित करें। आप शांत और तनावमुक्त महसूस कर सकेंगे",
                "सोने से पहले हल्का डिनर करें",
                "कल के लिए इरादा सेट करें",
                "अपनी नींद की गुणवत्ता को बेहतर बनाने के लिए कुछ एसेंटेल ऑयल डिफ्यूज़ करें",
                "ईमेल, समाचार चेक करने से बचें, सोने से पहले काम कर रहे आरओ का अध्ययन करें",
                "भूखे न सोएं। बेहतर नींद के लिए बादाम, केला या दलिया खाएं।",
                "सोने जाने से कम से कम 1 घंटे पहले अपने फोन से बचें",
                "सोने से पहले कुछ कैमोमाइल चाय या अन्य हर्बल चाय (डिकैफ़िनेटेड) पिएं",
                "सोने से लगभग एक या दो घंटे पहले गर्म स्नान करें या स्नान करें, बिस्तर के लिए समय पर आराम करने में आपकी मदद करने के लिए चमत्कार कर सकते हैं",
                "सोने से पहले पानी पीना सुनिश्चित करें। सोते समय हम नमी खो देते हैं। अच्छी तरह से हाइड्रेट करना महत्वपूर्ण है",
                "2 मिनट में अपने दाँत ब्रश करें",
                "अपने पिछले 24 घंटों के बारे में सोचें और कम से कम एक ऐसी चीज़ लिखें जो बहुत अच्छी रही हो",
                "एक योजनाकार या नोटबुक में कल के लिए सर्वोच्च प्राथमिकताएँ लिखें।",
                "एक टू-डू सूची में चिंता कम करें",
                "सोने से पहले हमेशा प्रार्थना करें और अपने आप को क्षमा करें"
            ]
        },
        {
            "challenge_name": "सकारात्मक पुष्टि",
            "challenge_description": "यह चुनौती स्वयं के बारे में आपकी सकारात्मक राय और आपके लक्ष्यों को प्राप्त करने की आपकी क्षमता में आपके आत्मविश्वास दोनों को बढ़ाकर आत्म-मूल्य को मजबूत करने में मदद कर सकती है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "मैं इस दिन की संभावनाओं और संभावनाओं को गले लगाता हूं",
                "मैं आज खुश रहना और खुद से प्यार करना चुनता हूं",
                "मैं बदलने और बढ़ने के लिए तैयार हूं",
                "मैं अपने आराम क्षेत्र के बाहर के अनुभवों को गले लगाता हूं",
                "मैं प्रतिभाशाली और बुद्धिमान हूँ",
                "चुनौतियाँ मुझे बढ़ने के अवसर देती हैं",
                "मुझे मार्गदर्शन करने के लिए मेरे अंतर्ज्ञान पर भरोसा है",
                "मैं अपने और अपने शरीर से प्यार करता हूँ",
                "मैं अपने अतीत के साथ शांति में हूँ",
                "मैं आज अपने और दूसरों के प्रति दयालु रहूंगा",
                "मैं डर पर विश्वास चुनता हूं",
                "आज का दिन सकारात्मक रहेगा",
                "मेरे पास जो कुछ है उसके लिए मैं आभारी हूं",
                "मैं अपने नकारात्मक विचारों से ज्यादा हूं",
                "मैं खुद को बिना शर्त स्वीकार करता हूं",
                "मैं स्वस्थ और खुश हूँ",
                "अभी जो कुछ भी हो रहा है वह मेरे परम भले के लिए हो रहा है",
                "मैं कैसा महसूस करता हूं इसका प्रभारी हूं और आज मैं खुशी चुन रहा हूं",
                "आज मैं इंटरनेट पर अजनबियों से अपनी तुलना नहीं करूंगा",
                "मेरे पास परिवर्तन पैदा करने की शक्ति है",
                "मेरी भावनाएँ और विचार मान्य हैं",
                "मेरे पास बहुतायत और आंतरिक शक्ति है",
                "मैं चीजों को एक नए नजरिए से देखने के लिए तैयार हूं",
                "मैं प्यार और सम्मान के योग्य हूं",
                "मेरा दिमाग स्पष्ट, मजबूत और केंद्रित है",
                "मैं ऊर्जा और साहस के साथ दिन का सामना करता हूं",
                "मैं अपने सपनों से प्रेरित और प्रेरित हूं",
                "मैं सर्वश्रेष्ठ के लायक हूं और अब इसे स्वीकार करता हूं",
                "मैं अद्वितीय और आत्मविश्वासी हूं",
                "मैं अपने जीवन में अनंत अवसर देखता हूं"
            ]
        },
        {
            "challenge_name": "डेली जर्नलिंग",
            "challenge_description": "जर्नलिंग आपके लक्षणों को नियंत्रित करने और आपके मूड को बेहतर बनाने में मदद करती है: समस्याओं, आशंकाओं और चिंताओं को प्राथमिकता देने में आपकी मदद करती है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "किसी ऐसे व्यक्ति के बारे में लिखें जो आपको प्रेरित करता हो",
                "अपने जीवन में लगभग 5 आशीर्वाद लिखें",
                "अपने बारे में 30 तथ्य पोस्ट करें",
                "आप किस बारे में उत्साहित हैं?",
                "आप अपने बच्चों/दोस्तों/भाई-बहन से कौन से 3 सबक सीखना चाहते हैं",
                "वर्तमान चुनौती के बारे में लिखें",
                "समस्याओं का समाधान लिखें",
                "लिखें कि आप भविष्य में क्या सीखना चाहते हैं",
                "सूचीबद्ध करें कि आप अपने माता-पिता/परिवार के बारे में क्या प्यार करते हैं",
                "आपका संपूर्ण दिन कैसा दिखेगा?",
                "उन सभी चीजों को लिखें जो आप इस वर्ष हासिल करना चाहते हैं",
                "आपको अपने जीवन में और क्या चाहिए?",
                "उन चीजों की एक सूची बनाएं जो आप करेंगे यदि आप डरते नहीं थे, और वे आपके जीवन को कैसे प्रभावित करेंगे",
                "आप दस साल के बच्चे को क्या सलाह देंगे?",
                "आप कल को कैसे बेहतर बना सकते हैं?",
                "उन सभी चीजों के बारे में लिखें जो आपको परेशान करती हैं और आप इसे कैसे बदल सकते हैं?",
                "आपने कल क्या सीखा?",
                "एक पिछले संघर्ष के बारे में लिखें जिसे आपने दूर किया है। इसने आपको कैसे मजबूत बनाया है?",
                "अभी आप किस चीज़ की प्रतीक्षा कर रहे हैं?",
                "आपको सबसे ज्यादा खुशी किस चीज से मिलती है? आप इसके लिए और समय कैसे निकाल सकते हैं?",
                "ऐसा क्या है जो आपके जीवन से गायब है? और आप इसे कैसे बदल सकते हैं?",
                "उस समय के बारे में लिखें जब आपको खुद पर गर्व महसूस हुआ",
                "यदि इस वर्ष के लिए आपकी 3 इच्छाएँ हों, तो आप क्या चाहते हैं?",
                "अभी आपके दिमाग में क्या है?",
                "किसी ऐसी चीज़ या किसी व्यक्ति के बारे में लिखें जिसे आप याद करते हैं",
                "आज के बारे में आप सबसे ज्यादा क्या महत्व रखते हैं?",
                "अपने जीवन में एक पल के बारे में लिखें जो आपको इसके बारे में सोचने पर खुश करता है",
                "अगर ज़िन्दगी आज रुक गई तो क्या ना करने का पछताओगे?",
                "आप कैसे चाहते हैं कि लोग आपको याद रखें और क्यों?",
                "अधिक प्यार दिखाने के लिए आपको अपने आप के किन पहलुओं की आवश्यकता है?"
            ]
        },
        {
            "challenge_name": "सुबह का रूटीन",
            "challenge_description": "सुबह की दिनचर्या करने से आपकी ऊर्जा, उत्पादकता और सकारात्मकता बढ़ सकती है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "अपनी सुबह की दिनचर्या, नाश्ता खाने, समाचार देखने या व्यायाम करने के दौरान 20 मिनट के लिए धूप में बैठें या खड़े रहें",
                "दोपहर से पहले पूरी करने के लिए 3 चीजें चुनें",
                "अपने दिन को प्राथमिकता दें। आज आप किन कार्यों को पूरा करने की उम्मीद कर रहे हैं?",
                "आज सुबह, अपने विचारों और भावनाओं को सुनने के लिए कुछ मिनट निकालें, उन्हें पहचानें, और यदि आवश्यक हो तो उन्हें स्थानांतरित करें",
                "आज के लिए एक टू-डू सूची लिखें",
                "अपने परिवार और दोस्तों से जुड़ें या किसी ऐसे व्यक्ति को सुप्रभात पाठ भेजें जिसे आप प्यार करते हैं",
                "एक गहरी सांस लें और इस दिन के लिए धन्यवाद कहें",
                "5 चीजें लिखें जिन पर आपको खुद पर गर्व है",
                "15 मिनट के लिए ध्यान करें",
                "एक जी पियोनाश्ते से पहले पानी का गिलास",
                "ताज़ी हवा के लिए अपनी खिड़कियां खोलें और थोड़ी धूप अंदर आने दें",
                "चलें या होम वर्कआउट सेशन करें",
                "अपनी पसंदीदा पुस्तक के कुछ अध्याय पढ़ें",
                "15 मिनट योग करें",
                "तैयार होने के दौरान पॉडकास्ट या ऑडियोबुक सुनें",
                "बाहर जाओ और बस सुबह की ताजी हवा में सांस लो",
                "दिन में करने के लिए 3 चीजों की सूची बनाएं",
                "सुबह की खबरें और सोशल मीडिया चेक करने से बचें",
                "अपना बिस्तर बनाएं और अधिक उत्पादक महसूस करने के लिए अपने स्थान को व्यवस्थित करें",
                "अपने दिन का मार्गदर्शन करने के लिए एक प्रतिज्ञान चुनें। उदाहरण के लिए: 'आज एक महान दिन है।'",
                "नहाओ और तैयार हो जाओ, भले ही आप कहीं नहीं जा रहे हों",
                "सुबह सबसे पहले सोशल मीडिया के किसी भी रूप की जांच न करें",
                "जब आप जागते हैं, तो पूरे दिन अच्छी वाइब्स रखने के लिए अच्छे विचारों को आकर्षित करें",
                "सुबह की कृतज्ञता सूची लिखें",
                "सुबह अच्छे मूड में लाने के लिए अपनी पसंदीदा संगीत प्लेलिस्ट सुनें",
                "जागने के बाद कुछ स्ट्रेचिंग करें",
                "अपने आप को एक स्वस्थ और स्वादिष्ट नाश्ता बनाएं",
                "नाश्ते से पहले सूचनाओं की जांच न करें",
                "पेंट करें, एक संगीत वाद्ययंत्र बजाएं। कुछ ऐसा करें जो आपकी रचनात्मकता को बढ़ावा दे",
                "एक मुस्कान और आने वाले दिन के लिए सकारात्मक दृष्टिकोण के साथ जागें"
            ]
        },
        {
            "challenge_name": "सकारात्मक मानसिकता",
            "challenge_description": "सकारात्मक सोचना एक आदत है जिसे करने के लिए हम खुद को प्रशिक्षित कर सकते हैं। शोध से पता चलता है कि इसका शरीर और दिमाग दोनों के स्वास्थ्य पर सकारात्मक प्रभाव पड़ता है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "मुस्कुराने का अभ्यास करें। अजनबियों पर मुस्कुराएं, आईने में, जब भी आप कर सकते हैं मुस्कुराएं। आप बहुत अधिक सकारात्मक महसूस करेंगे",
                "आज छोटी-छोटी चीजों की सराहना करें। किसी की मुस्कान, सूर्यास्त, आपकी सुबह की कॉफी, सूरज की किरण की गर्मी, आकाश",
                "यह सोचने के बजाय कि 'मेरा जीवन भयानक है', इस समय चीजें बहुत अच्छी नहीं हैं, लेकिन यह बीत जाएगा। अच्छे दिन आने वाले हैं",
                "होने वाली भयानक चीजों के बारे में सोचने के बजाय, उन महान चीजों पर विचार करें जो आपकी वर्तमान स्थिति से आ सकती हैं",
                "मैंने हार मान ली कहने के बजाय, 'यह कठिन है लेकिन मैं कोशिश करता रहूंगा'",
                "दूसरे लोग क्या सोचते हैं, इसकी परवाह करना बंद करें। दूसरे लोगों के विचार आपको खुश और सकारात्मक बनाने के लिए नहीं बनाए गए हैं",
                "यह सोचने के बजाय कि 'यह मेरे साथ क्यों हो रहा है?', सोचें 'यह मुझे क्या सिखा रहा है?'",
                "विश्वास रखें कि यदि आप संभावनाओं के लिए खुले हैं तो बेहतर चीजें आ रही हैं'",
                "यह सोचने के बजाय कि 'मैं यह नहीं कर सकता', सोचें 'मुझे नहीं पता कि यह कैसे करना है'",
                "आज किसी और से अपनी तुलना न करें। यह समय की कुल बर्बादी है",
                "याद रखें, भले ही आप एक निश्चित स्थिति को नियंत्रित नहीं कर सकते हैं, आप अपनी प्रतिक्रिया को नियंत्रित कर सकते हैं",
                "ध्यान करें। यह आपको अधिक सोचने में मदद करेगा, आपके तनाव को कम करेगा और आपको अधिक सकारात्मक होने में मदद कर सकता है",
                "सकारात्मक आत्म-चर्चा का अभ्यास करें। आप अपने ध्यान के साथ सकारात्मक पुष्टि का उपयोग कर सकते हैं",
                "अपनी कृतज्ञता पत्रिका लिखकर अपना दिन शुरू करें या समाप्त करें",
                "अपने आप को उन लोगों के साथ घेरें जिन्हें आप प्यार करते हैं और जो आपको वापस प्यार करते हैं",
                "संगीत सुनें। संगीत आपके स्वास्थ्य और दिन पर सकारात्मक प्रभाव डाल सकता है",
                "स्वीकृति का अभ्यास करें। अभी आपके पास जो कुछ भी है उसकी सराहना करें",
                "एक प्रेरणादायक यूट्यूब वीडियो/पॉडकास्ट सुनें। अपने मस्तिष्क को प्रेरणा से भरें",
                "उन 5 चीजों की सूची बनाएं जिन्होंने आज आपको मुस्कुरा दिया",
                "मैं असफल' कहने के बजाय, 'गलतियाँ मुझे सीखने में मदद करती हैं' कहें",
                "सोशल मीडिया का समय सीमित करें। अन्य लोगों की सामग्री का उपभोग करने वाले स्वयं को बनाने और काम करने में अधिक समय व्यतीत करें",
                "अपनी सर्वोच्च प्राथमिकताओं और भविष्य की योजनाओं को यह जानते हुए लिखें कि आप वह सब कुछ हासिल करेंगे जो आप चाहते हैं",
                "मौजूद रहें और पल की सुंदरता की सराहना करें। (अपने चेहरे में सूरज को महसूस करें, ताजी हवा की सराहना करें…।)",
                "आज (और अपने दिन-प्रतिदिन में) छोटी जीत पर खुद पर गर्व करें",
                "कुछ ऐसा करके अपना मूड बदलें जो आपको वास्तव में पसंद हो",
                "आने वाली स्थिति के लिए आप चिंतित हैं, सबसे अच्छा परिदृश्य लिखें जो हो सकता है",
                "समाधान पर ध्यान दें, समस्याओं पर नहीं",
                "दूसरों की अपेक्षाओं को छोड़ दें और जो मायने रखता है उस पर ध्यान दें",
                "अपने आप को सकारात्मक प्रकार के लोगों से घेरें",
                "अपना ख्याल रखें। जब हम अपना सर्वश्रेष्ठ महसूस करते हैं, तो हम चीजों को अधिक सकारात्मक तरीके से देख सकते हैं"
            ]
        },
        {
            "challenge_name": "सेल्फ लव",
            "challenge_description": "एक स्व-देखभाल दिनचर्या में संलग्न होना चिंता और अवसाद को कम करने या समाप्त करने, तनाव को कम करने, एकाग्रता में सुधार करने, निराशा और क्रोध को कम करने, खुशी बढ़ाने और ऊर्जा में सुधार करने के लिए चिकित्सकीय रूप से सिद्ध हुआ है",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "उन 10 चीजों की सूची बनाएं जिन्हें आप अपने बारे में पसंद करते हैं",
                "आज आईने में अपने शरीर के पांच अंगों को 'धन्यवाद' कहें",
                "हर बार जब आपको खुद पर गर्व हो तो एक पोस्ट नोट लिखें। इसे 'मुझे अपने आप पर गर्व है' जार में डाल दें।",
                "अपने आप को उस पछतावे के लिए क्षमा करें जिस पर आप लटके हुए हैं और इसे जाने दें",
                "उन सभी चीजों की एक सूची लिखें जो आपको अपने बारे में पसंद हैं",
                "स्वस्थ भोजन और ढेर सारे पानी से अपने शरीर का इलाज करें",
                "अपने कमरे/डेस्क/कोठरी को साफ करें और उन सभी चीजों को साफ करें जो अब आपके लिए खुशी नहीं लाती हैं",
                "अपनी एक तस्वीर लें और अपनी उपस्थिति के बारे में जो कुछ भी आपको पसंद है उसे लिखें",
                "किसी ऐसे व्यक्ति को अनफॉलो करें जो आपको अपने बारे में असुरक्षित और बुरा महसूस कराता हो",
                "कहीं जाएं जहां आप सूर्योदय/सूर्यास्त देख सकते हैं और स्वयं इसका आनंद ले सकते हैं",
                "हमेशा अपने लिए कपड़े पहनें। आज ही अपना पसंदीदा पहनावा पहनें",
                "अपने सप्ताह में प्रतिबिंबित करें और 5 चीजें लिखें जिनके लिए आप आभारी हैं",
                "आप कैसा महसूस करते हैं और आपके जीवन में क्या चल रहा है, इसके बारे में पत्रिका बनाएं",
                "अपने साथ डेट पर जाएं। अपने पसंदीदा रेस्तरां में जाएं, समुद्र तट पर जाएं ... कहीं आपको अच्छा और आराम महसूस होता है जहां आप खुद से जुड़ सकते हैं",
                "जब आप इस चुनौती को पूरा कर लें तो अपने लिए एक पुरस्कार की योजना बनाएं",
                "लंबी सैर करें और प्रकृति से जुड़ें",
                "आपके द्वारा पार की गई सबसे बड़ी चुनौती को लिखें",
                "पूरे दिन के लिए किसी भी तकनीक को अनप्लग करें (जब तक आपके पास करने के लिए काम न हो)",
                "अपना पसंदीदा भोजन या मिठाई खाएं",
                "अपने लिए एक प्रेम पत्र लिखें",
                "लिखें कि आपने इस चुनौती से क्या सीखा है और अपने इनाम के बारे में मत भूलना जो आपने 15 दिन में योजना बनाई थी",
                "ऐसी कौन सी चीज़ है जिसे आप बचपन में करना पसंद करते थे? आज ही करें",
                "पौष्टिक भोजन करें",
                "किसी पुराने दोस्त या रिश्तेदार से मिलें",
                "दोपहर में बिजली की झपकी लें",
                "एक फिल्म देखें जिसे आप देखना चाहते हैं",
                "अपनी पसंदीदा सेल्फी का वीडियो कोलाज बनाएं",
                "उन 5 चीजों की सूची बनाएं जिनमें आप वास्तव में अच्छे हैं",
                "उस उपलब्धि के बारे में लिखें जिस पर आपको गर्व हो",
                "हर दिन कहने के लिए 3 सकारात्मक पुष्टि चुनें। उदा। मैं यह कर सकता हूं।"
            ]
        },
        {
            "challenge_name": "आत्मविश्वास में सुधार",
            "challenge_description": "आत्मविश्वास आपको जीवन के प्रति सकारात्मक दृष्टिकोण भी दे सकता है, जिससे आपकी मानसिक और भावनात्मक भलाई में वृद्धि होगी।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "उन सभी सोशल मीडिया अकाउंट्स को अनफॉलो करें जो आपको अपने बारे में असुरक्षित महसूस कराते हैं",
                "आज ही उन्हें नकारने के बजाय तारीफों को स्वीकार करने पर काम करें",
                "अपनी मुद्रा के बारे में जागरूक रहें। अच्छी मुद्रा अधिक आत्मविश्वास विकसित करती है",
                "कुछ ऐसा करें जिसे आप बचपन में करना पसंद करते थे",
                "आज कुछ चुनौतीपूर्ण करें, याद रखें कि जब हम अपने कम्फर्ट जोन में होते हैं तो हम बढ़ते नहीं हैं",
                "अपने बारे में 10 बातें लिखिए जो आपको पसंद हैं",
                "उस चीज़ के लिए हाँ कहो जो आप सामान्य रूप से नहीं करेंगे",
                "एक नई स्वस्थ आदत लागू करें",
                "जब आपके पास कहने के लिए कुछ हो तो बोलें",
                "आप जो नहीं चाहते उसके बजाय आप जो चाहते हैं उस पर ध्यान केंद्रित करें",
                "किसी ऐसी चीज़ पर अपने कौशल को सुधारने पर काम करें जिसे आप करना पसंद करते हैं या जिसे आप करना शुरू करना चाहते हैं",
                "भविष्य की उपलब्धियों सहित अपनी सभी उपलब्धियों को लिखें",
                "जल्दी कसरत करें, नहाएं, तैयार हों और ऐसा पहनावा पहनें जिससे आपको अच्छा महसूस हो",
                "सूर्यास्त देखने के लिए अकेले बाहर जाओ",
                "किसी पुराने मित्र से संपर्क करें",
                "हर नकारात्मक के लिए सकारात्मक विचार लेकर आएं",
                "किसी को अच्छी सलाह दें",
                "एक कसरत करें जो आपको पसंद हो",
                "छोटी-छोटी चीजों पर काम करें। छोटी-छोटी उपलब्धियां आपको अच्छा महसूस कराती हैं",
                "आवेगपूर्ण प्रतिक्रिया करने के बजाय, कार्य करने से पहले कुछ रोकें और प्रतिबिंबित करें",
                "प्रामाणिक बनें और अपनी विशिष्टता को अपनाएं। जीवन कोई प्रतियोगिता नहीं है",
                "पूरे दिन दूसरों के बारे में नकारात्मक बातें न करें",
                "एक काम लिखो जो तुमने अपने परिवार के लिए किया है",
                "अपने लिए एक प्रेम पत्र लिखें",
                "तीन डर लिखें और आप प्रत्येक को कैसे दूर कर सकते हैं",
                "एक परिवर्तन की पहचान करें जिसे आप करना चाहते हैं और इसे करने के लिए कदम",
                "कुछ ऐसा करें जो आपको विशेष महसूस कराए",
                "तीन दोस्तों को अपने बारे में अपनी पसंदीदा चीज़ बताने के लिए कहें",
                "अपनी 3 गलतियों और सीखे गए पाठों को लिखें",
                "अपने लिए एक प्राप्य लक्ष्य निर्धारित करें"
            ]
        },
        {
            "challenge_name": "कृपा का कार्य",
            "challenge_description": "दयालुता का कार्य आत्मविश्वास, नियंत्रण, खुशी और आशावाद की भावनाओं को बढ़ावा दे सकता है। वे दूसरों को उन अच्छे कामों को दोहराने के लिए भी प्रोत्साहित कर सकते हैं जो उन्होंने स्वयं अनुभव किए हैं - एक अधिक सकारात्मक समुदाय में योगदान करते हुए।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "आज किसी को समर्थन दिखाओ",
                "रक्त दान करें, जीवन बचाएं",
                "अपने पसंदीदा रेस्तरां/कॉफी शॉप की सकारात्मक समीक्षा छोड़ें",
                "परिवार का सदस्य बनाएं/बिस्तर में अपने प्रियजन का नाश्ता करें",
                "किसी से पूछें कि आप उनकी मदद कैसे कर सकते हैं - और फिर करें।",
                "किसी ऐसे व्यक्ति पर मुस्कुराएं जिसे इसकी आवश्यकता है",
                "अपने पसंदीदा ऐप की सकारात्मक समीक्षा छोड़ें",
                "कचरा संग्रहकर्ता के लिए एक टिप दें",
                "अपने माता-पिता/भाई-बहन/बच्चों से पूछें कि क्या आप उनकी मदद के लिए कुछ कर सकते हैं",
                "उन कारणों की एक सूची लिखें कि आप किसी से प्यार क्यों करते हैं और उन्हें दें",
                "किसी को टिप दें",
                "लोगों के बारे में केवल सकारात्मक बातें कहते हुए दिन बिताएं",
                "किसी ऐसे व्यक्ति को बताएं जिसे आप प्यार करते हैं आप उनकी कितनी सराहना करते हैं",
                "ऐसा काम करें जो आप आमतौर पर नहीं करते",
                "कहो 'आपका दिन शुभ हो' कम से कम 3 व्यक्ति जिनसे आप मिले",
                "एक बेघर व्यक्ति के लिए भोजन खरीदें",
                "किसी के पूछने से पहले उसकी मदद करो",
                "कुकीज़ बेक करें और किसी को उपहार में दें",
                "किसी स्थानीय चैरिटी को कपड़े/खिलौने/किताबें दान करने का प्रयास करें",
                "किसी ऐसे व्यक्ति को कॉल करें जिससे आपने कुछ समय से बात नहीं की है",
                "सबसे महत्वपूर्ण, हमेशा अपने आप पर दया करो",
                "किसी ऐसे व्यक्ति को धन्यवाद पत्र लिखें जिसने आपके जीवन में प्रभाव डाला",
                "लाइन में पड़ते हुए किसी को अपने सामने आने दो",
                "किसी को उपहार के साथ आश्चर्यचकित करें",
                "दर्पणों पर सकारात्मक चिपचिपा नोट लगाएं",
                "एक बुजुर्ग रिश्तेदार के साथ चेक इन करें",
                "जिस व्यक्ति से आप प्यार करते हैं, उसे 3 ईमानदार तारीफ दें",
                "जितना हो सके धन्यवाद कहो",
                "किसी की तारीफ करो",
                "एक दिन के लिए नकारात्मक विचारों से बचें। अपने आप को भी कुछ दया दिखाएँ!"
            ]
        },
        {
            "challenge_name": "मानसिक स्वास्थ्य",
            "challenge_description": "जब आपके मानसिक स्वास्थ्य की बात आती है, तो आत्म-देखभाल आपको तनाव को प्रबंधित करने, बीमारी के जोखिम को कम करने और आपकी ऊर्जा को बढ़ाने में मदद कर सकती है। यहां तक ​​कि आपके दैनिक जीवन में स्वयं की देखभाल के छोटे कार्य भी एक बड़ा प्रभाव डाल सकते हैं। ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "चिंता का प्रबंधन करें",
                "सोने जाने से पहले, 3 चीजें लिखें जो आपने दिन से सराहना की हैं",
                "आत्म करुणा का अभ्यास करें",
                "माइंडफुलनेस का अभ्यास करें। अपने आप को वर्तमान में वापस खींचो",
                "एक शौक पर समय बिताएं। अपने मूड को बढ़ावा दें और उस कार्य में संलग्न हों जिसका आप आनंद लेते हैं",
                "दिन के लिए सोशल मीडिया ब्रेक लें और अपने आस-पास के जीवन पर ध्यान दें",
                "कुछ लगाओ। अपने अलावा किसी और चीज की देखभाल करने से कई मानसिक लाभ होते हैं।",
                "जब आप किसी चीज़ का इंतज़ार कर रहे हों तो अपने जीवन के सबसे अच्छे हिस्सों के बारे में सोचें",
                "अपने माता-पिता, शिक्षकों, दोस्तों, परिवार के सदस्यों और अपने करीबी लोगों से मानसिक स्वास्थ्य के बारे में बात करना सीखें।",
                "अपने दिमाग में कुछ के बारे में खोलें",
                "आज आराम करने और आराम करने पर ध्यान दें और जल्दी सो जाएं",
                "अपने फोन को देखे बिना टहलने जाएं, अपने परिवेश पर ध्यान केंद्रित करें",
                "जब भी आप चिंतित हों तो एक सुखद जगह की कल्पना करें",
                "कुछ ऐसा पढ़ें या देखें जो आपके मानसिक स्वास्थ्य के लिए अच्छा हो",
                "अपने सपनों के जीवन की कल्पना करें और लिखें कि वहां पहुंचने के लिए आपको किन कदमों पर बात करने की आवश्यकता है",
                "सकारात्मक आत्म-चर्चा का अभ्यास करें",
                "अपनी प्रेरणा को नवीनीकृत करें",
                "किसी भी नकारात्मक विचार की जड़ की खोज करना शुरू करें",
                "5 चीजें लिखें जिनके लिए आप आभारी हैं",
                "आत्म-देखभाल का अभ्यास करें और स्वयं को लाड़-प्यार करें",
                "सकारात्मक पुष्टि लिखें और सोने से पहले उन्हें पढ़ें",
                "जब भी आप कर सकते हैं 3 पूरी गहरी सांसें लें",
                "एक स्वस्थ भोजन की योजना बनाएं",
                "किसी ऐसे व्यक्ति की जय-जयकार करें जिसे आप महत्व देते हैं।",
                "किसी ऐसे व्यक्ति को बुलाओ जिसे आप प्यार करते हैं जिससे आपने कुछ समय से बात नहीं की है",
                "एक निर्देशित ध्यान का प्रयास करें",
                "अपने विचारों को समस्याओं और चिंता से दूर करने के लिए एक नया कौशल सीखें",
                "आपके दिमाग में जो कुछ भी चल रहा है, उसका जर्नल लिखें",
                "पौष्टिक भोजन करें।",
                "अपना पसंदीदा गाना गाएं। गायन श्वास को नियंत्रित करने और चिंता को कम करने में मदद करता है"
            ]
        },
        {
            "challenge_name": "अपने सोने का समय तय करें",
            "challenge_description": "इन दैनिक चुनौतियों का उद्देश्य आपको स्वस्थ सोने की दिनचर्या अपनाने में मदद करना है, प्राप्त करें एनोउह सो जाओ, और हर सुबह तरोताजा महसूस कर उठो।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "अपना फोन दूर रखें ताकि अगली सुबह आपको अलार्म बंद करने के लिए बिस्तर से उठना पड़े",
                "अपने दिमाग को सोने के लिए तैयार करने के लिए सोने से 1 घंटे पहले अपनी सभी स्क्रीन बंद कर दें",
                "अपने आप को एक स्वादिष्ट नाश्ते के साथ पुरस्कृत करें ताकि आपको जल्दी उठने के लिए और अधिक प्रेरणा मिले",
                "रात में स्नान, गर्म स्नान या स्नान आपको सोने से पहले आराम करने में मदद करेगा",
                "हर दिन एक ही समय पर जागने की कोशिश करें, निरंतरता ही कुंजी है",
                "रात के खाने के बाद, अपने आरामदायक पजामा को पत्रिका पर रखें, एक नुक्कड़ पढ़ें और आराम करने के लिए तैयार हों और अपने दिमाग को आराम दें",
                "जागने के बाद खूब पानी पिएं, आप दिन भर थकान महसूस नहीं करेंगे",
                "रात का खाना जल्दी खाने की कोशिश करें, क्योंकि आप अपना खाना पहले पचा लेंगे, आप शरीर को फिर से नींद की जरूरत पर ध्यान केंद्रित कर सकते हैं",
                "सुबह की जल्दी कसरत करें/दौड़ें, इससे आपको दिन के दौरान ऊर्जावान महसूस करने में मदद मिलेगी और जब आप बिस्तर पर जा रहे होंगे तब नींद आएगी",
                "सोने से पहले ध्यान करें, इससे आराम मिलता है और तनाव कम होता है",
                "जब आप जागते हैं तो खिड़कियां खोलें और सूरज की किरणें आपकी त्वचा को छूएं",
                "आज रात अपनी गतिविधियों की पूर्व-योजना बनाएं और अगली सुबह के लिए अपनी टू-डू सूची भी",
                "अपने अच्छे मूड में लाने के लिए जागने के बाद अपनी पसंदीदा प्लेलिस्ट सुनें",
                "एक अनुस्मारक सेट करें जो आपको सोने के समय से 30 मिनट पहले सचेत करेगा",
                "दिन के दौरान ऊर्जा खर्च करें ताकि आप रात में थक जाएं",
                "सोने से 1 घंटे पहले पानी पीना बंद कर दें ताकि आपको रात के समय उठना न पड़े या जब आप सोने की कोशिश कर रहे हों तो उठना न पड़े",
                "जागने के बाद अपना बिस्तर बनाओ ताकि आपको फिर से सोने के लिए वापस जाने का मोह न हो",
                "सोने से पहले हल्का संगीत सुनें, इससे आपको जल्दी सोने में मदद मिलेगी",
                "अपना चेहरा धोने या अच्छा स्नान करने के लिए सीधे बाथरूम में सिर उठने के बाद",
                "अपनी नींद की गुणवत्ता में सुधार के लिए मैग्नीशियम (जैसे बादाम, मूंगफली और स्क्वैश के बीज) और जस्ता युक्त भोजन खाएं",
                "जब आप जागते हैं तो ताजी हवा में सांस लें। अपने विचारों को ताज़ा करें जो आपके मस्तिष्क को सुबह साफ करने में मदद करते हैं",
                "अपने बिस्तर का इस्तेमाल पूरी तरह से सोने और सेक्स के लिए ही करें। टीवी नहीं देखना।",
                "नींद के चुने हुए समय से 6 घंटे पहले कोई कैफीन नहीं",
                "सोने से पहले बड़ा खाना खाने से बचें",
                "अपने कमरे को जितना हो सके अंधेरा और शांत बनाएं",
                "झपकी से बचें। यह आपके नींद चक्र को बाधित कर सकता है",
                "एक ठंडा और सुसंगत तापमान स्थापित करें",
                "जब आप सो रहे हों तभी बिस्तर पर जाएं",
                "सोने से पहले कठिन बातचीत से बचें",
                "अपनी चादरें और तकिए को धोएं या बदलें"
            ]
        },
        {
            "challenge_name": "सेल्फ केयर",
            "challenge_description": "स्व-देखभाल का अर्थ है उन चीजों को करने के लिए समय निकालना जो आपको अच्छी तरह से जीने में मदद करती हैं और आपके शारीरिक स्वास्थ्य और मानसिक स्वास्थ्य दोनों को बेहतर बनाती हैं।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "अपने दिन की योजना बनाएं और उस पर टिके रहें",
                "एक पत्रिका लिखें, अपनी भावनाओं और अनुभवों को दर्ज करें",
                "एक शौक का अभ्यास करें जिसका आप वास्तव में आनंद लेते हैं",
                "जब आप बच्चे थे तब से एक पसंदीदा किताब पढ़ें",
                "घर पर व्यायाम करें। Youtube पर वर्कआउट वीडियो खोजें",
                "कुछ नया पकाने की कोशिश करो",
                "जो कुछ आप सोच रहे हैं उसे अपने माता-पिता या दोस्तों के साथ साझा करें",
                "सुबह की दिनचर्या बनाएं",
                "अपने परिवार और दोस्तों को बुलाओ",
                "एक पहेली खेल को हल करें",
                "कुछ कलाकृतियां करें। आप इंटरनेट पर विचार पा सकते हैं",
                "अपने पसंदीदा गाने सुनें",
                "फलक खेल खेलो",
                "किसी विशेष को पत्र लिखें",
                "कुछ नया कौशल सीखने के लिए ऑनलाइन पाठ्यक्रम लें",
                "एक नई फिल्म देखें",
                "अपने दिमाग और शरीर को आराम देने के लिए एक शक्तिशाली झपकी लें",
                "कुछ पॉडकास्ट सुनें",
                "अपने मन को शांत करने और चिंता से मुक्त करने के लिए ध्यान करें",
                "आराम से स्नान करें",
                "भविष्य के लिए लक्ष्य निर्धारित करें",
                "अपने पसंदीदा गीत के साथ गाएं",
                "किसी ऐसे व्यक्ति के साथ वीडियो चैट करें जिसकी आप परवाह करते हैं",
                "नींद की दिनचर्या स्थापित करें",
                "कोई शिकायत नहीं",
                "हमेशा प्रार्थना करने के लिए समय निकालें।",
                "नकारात्मकता को 'ना' कहें",
                "अपनी जगह को साफ और व्यवस्थित करें",
                "अगले सप्ताह के लिए एक लक्ष्य निर्धारित करें",
                "अगर आप की जरूरत है तो मदद के लिए पूछें"
            ]
        },
        {
            "challenge_name": "प्रभावी अध्ययन",
            "challenge_description": "अपने अध्ययन के साथ मो सफल बनना सीखना। उच्च ग्रेड प्राप्त करने के लिए एक प्रभावी और स्पष्ट लक्ष्य निर्धारित करें, जानें कि कैसेo अपने समय का प्रबंधन करें और अपने अध्ययन कौशल में सुधार करें।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "पढ़ने के लिए अपने डेस्क को व्यवस्थित और साफ करें",
                "एक अध्ययन सत्र की योजना बनाएं और अध्ययन सामग्री तैयार करें",
                "अपनी कमजोरियों पर काबू पाएं और अपने अध्ययन के लक्ष्य और प्रेरणा को खोजें",
                "अपने पाठ्यक्रम का अध्ययन करें और अपने पाठ्यक्रम में सक्रिय होना शुरू करें",
                "हमेशा अपना शेड्यूल व्यवस्थित करें और नोट्स लें",
                "हाथ से अपने नोट्स लिखें और मुख्य शब्दों को हाइलाइट करें",
                "50-10 नियम। हर घंटे में 50 मिनट का अध्ययन करें। 10 मिनट अपने दिमाग की सफाई में बिताएं",
                "सोने से पहले अपने नोट्स की समीक्षा करें",
                "एक टाइमर सेट करें और केवल एक ही कार्य पर ध्यान केंद्रित करें",
                "पढ़ो जैसे तुम किसी को पढ़ा रहे हो",
                "यदि आप सभी कार्यों को पूरा करते हैं तो अपने आप को एक पुरस्कार का वादा करें",
                "अपने नोट्स में रंगों और हाइलाइटर्स का प्रयोग करें",
                "अवधारणाओं को समझने के लिए केवल Google और Youtube का उपयोग करें",
                "स्वस्थ खाएं। आपका शरीर बेहतर महसूस करेगा और आप अधिक सतर्क रहेंगे",
                "अवधारणाओं को सारांशित करें",
                "अपने मित्र के साथ अध्ययन करें। अपने मित्र को कठिन विषयों पर आपसे प्रश्नोत्तरी करने के लिए कहें",
                "आज या इस सप्ताह आपने जो सीखा उसकी समीक्षा करें",
                "बेहतर सीखने के लिए ऐप्स या फ्लैश कार्ड का प्रयोग करें",
                "अपने कार्यों को प्राथमिकता दें। प्रमुख कार्यों को पहले पूरा करें",
                "सूचना को व्यवस्थित करने के लिए माइंड मैप का उपयोग करें",
                "बिना विचलित हुए एक शांत अध्ययन स्थान चुनें",
                "तनाव को कम करना न भूलें। अपने तनाव के स्तर को कम रखें और चिंता कम करें",
                "अपना होमवर्क शुरू करने से पहले अपने नोट्स की समीक्षा करें",
                "गृहकार्य की समस्याओं का अध्ययन करें, उत्तरों को कवर करें और स्वयं प्रश्नोत्तरी करें",
                "महत्वपूर्ण अवधारणा या सूत्रों की एक सूची बनाएं",
                "अपनी खुद की मॉक परीक्षा बनाएं",
                "पढ़ो जैसे सरप्राइज एग्जाम कल है।",
                "पर्याप्त नींद लें क्योंकि यह स्मृति प्रतिधारण में बहुत सहायता करता है",
                "स्मृति तकनीकों की खोज करें जो आपके अध्ययन के लिए प्रभावी रूप से उपयुक्त हों",
                "मदद मांगने से कभी न डरें"
            ]
        },
        {
            "challenge_name": "युगल संबंध",
            "challenge_description": "यह संबंध चुनौती आपके दैनिक जीवन में एकीकृत करने के लिए आसान बनाने के लिए डिज़ाइन की गई है। कई चुनौतियों को करने में केवल कुछ मिनट लगते हैं और पूरे दिन में किसी भी समय किया जा सकता है। कुछ को थोड़ी अधिक ऊर्जा की आवश्यकता होती है और योजना बना रहे हैं, लेकिन यह इसके लायक होगा।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "अपने साथी के बारे में उन चीजों की सूची बनाएं जो आपको पसंद हैं",
                "एक सरप्राइज डेट नाइट प्लान करें",
                "अपने साथी को बताएं कि आप उन्हें बिना शर्त प्यार करते हैं",
                "अपने रिश्ते को लेकर जो डर है उसे साझा करें",
                "अपने साथी के बारे में एक अच्छी याद साझा करें",
                "अपने साथी को एक रोमांटिक मॉर्निंग मैसेज भेजें",
                "आज कुछ के लिए अपने साथी को धन्यवाद",
                "अपने साथी को किसी अच्छी चीज से सरप्राइज दें",
                "अपने रिश्ते के लिए एक लक्ष्य साझा करें",
                "अपने साथी को एक तारीफ दें",
                "एक सप्ताहांत भगदड़ की योजना बनाएं",
                "पुरानी तस्वीरों को एक साथ देखें",
                "याद करो जब तुम पहली बार मिले थे",
                "एक साथ बकेट लिस्ट बनाएं",
                "एक यादृच्छिक शब्द चुनें और अपने साथी के साथ एक गहरी बातचीत शुरू करें",
                "एक पहेली एक साथ करो",
                "अपने साथी को एक प्रेम पत्र लिखें और इसे बाद में खोजने के लिए छुपाएं",
                "कुछ ऐसा करें जो आपके साथी को एक साथ करने में मज़ा आए",
                "पसंदीदा इलाज करें",
                "अपने साथी को कुछ ऐसा बताएं जो आपको याद हो कि वे पसंद करते हैं",
                "अपने साथी को एक सरप्राइज किस और गले लगाओ",
                "अपने साथी को आराम से मालिश दें",
                "अपने साथी को बिस्तर में नाश्ता कराएं",
                "एक साथ बोर्ड गेम खेलें",
                "उससे पूछें कि आप एक बेहतर साथी कैसे बन सकते हैं",
                "उसे एक प्यारा सा नोट छोड़ दो",
                "एक साथ टहलें",
                "आज अपने साथी को एक तारीफ दें",
                "एक रिश्ते प्रश्नोत्तरी लो",
                "एक रोमांटिक गाने के लिए धीमा नृत्य"
            ]
        },
        {
            "challenge_name": "डिक्लटर",
            "challenge_description": "हमारे जीवन में अव्यवस्था को कम करना - चाहे वह भौतिक हो, डिजिटल हो या अन्यथा - हमें तनाव से निपटने की अनुमति देता है और इससे हमारे मानसिक स्वास्थ्य को लाभ होता है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "अपनी कोठरी साफ करो",
                "अपनी किताबें व्यवस्थित करें",
                "अपना शयनकक्ष व्यवस्थित करें",
                "अपना नाइटस्टैंड साफ़ करें",
                "अपने मेल के माध्यम से छाँटें",
                "अपनी पेंट्री व्यवस्थित करें",
                "अप्रयुक्त कपड़े दान करें",
                "अपने कंप्यूटर या लैपटॉप का स्थान साफ़ करें",
                "अपना फ्रिज साफ करें और एक्सपायर्ड वस्तुओं से छुटकारा पाएं",
                "अपनी कार साफ करें",
                "पुराने कागजात और मेल के माध्यम से जाओ",
                "अपना फ्रीजर खाली करें",
                "अपना बटुआ साफ करें",
                "अपनी रसोई व्यवस्थित करें",
                "अपना डेस्क या कार्यक्षेत्र साफ़ करें",
                "पुराने कपड़ों से छुटकारा पाएं",
                "अपनी सफाई की आपूर्ति व्यवस्थित करें",
                "अपने ड्रेसर को व्यवस्थित करें",
                "उन ऐप्स को हटा दें जिनका आप अब उपयोग नहीं करते हैं",
                "दवा अलमारियाँ साफ करें",
                "सब कुछ अपने कंप्यूटर पर फ़ोल्डर्स में व्यवस्थित करें",
                "अपने रहने वाले कमरे को व्यवस्थित करें",
                "कार्यात्मक भंडारण आइटम खरीदें",
                "व्यक्तिगत सामान शुद्ध करें",
                "अपनी कार/मोटरसाइकिल/बाइक की सफाई में समय बिताएं",
                "अपना कैलेंडर अपडेट और व्यवस्थित करें",
                "मृत पौधों को साफ करें और गमलों को व्यवस्थित करें",
                "सूखे माल (मसालों) को व्यवस्थित करें और एक्सपायर्ड माल को साफ करें",
                "भंडारण कंटेनरों और अलमारियों को व्यवस्थित और लेबल करें",
                "मन को शुद्ध करने के लिए ध्यान करें"
            ]
        },
        {
            "challenge_name": "उत्पादकता",
            "challenge_description": "अच्छी उत्पादकता आपको बेहतर लक्ष्य निर्धारित करने, अधिक प्रभावी बनने, फ़ोकस बढ़ाने और प्रेरणा बढ़ाने में मदद कर सकती है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "सुबह अपना बिस्तर बना लें ताकि आपको वापस बिस्तर पर जाने का लालच न हो",
                "तीन चीजें लिखें जिनके लिए आप हर दिन आभारी हैं",
                "कार्यस्थल को बेहतर बनाने के लिए अव्यवस्थित स्थान व्यवस्थित करें",
                "फोन पर कम समय बिताएं और अधिक उत्पादक बनें",
                "आपने जो कुछ भी योजना बनाई है उसे प्राप्त करने के लिए एक दैनिक योजनाकार का उपयोग करें",
                "ध्यान भटकने से बचने के लिए फोन पर अनावश्यक सूचनाएं बंद करें",
                "पूरे सप्ताह के लिए भोजन योजना बनाएं",
                "एक टू-डू सूची बनाएं और सभी कार्यों को पूरा करने का प्रयास करें",
                "कुछ ताजी हवा लेने के लिए 30 मिनट की सैर करें और दुनिया को जीतने के लिए प्रेरित महसूस करें",
                "ईमेल बॉक्स को अस्वीकार करें। कभी-कभी यह थोड़ा भारी हो सकता है",
                "30 मिनट के लिए व्यायाम करें, भले ही आप दिन में कुछ भी न करें, आप कसरत के बाद सुपर उत्पादक महसूस करेंगे",
                "सोशल मीडिया के बारे में भूलने के लिए सोने से पहले एक किताब का अध्याय पढ़ें",
                "टीवी देखने से बचें ताकि आपके पास अपने लिए अधिक समय हो",
                "अपनी कोठरी व्यवस्थित करें और उन चीज़ों को दान करें जो आप अब और नहीं चाहते हैं",
                "अपने पसंदीदा गानों और डांस लाइन के साथ एक संगीत प्लेलिस्ट बनाएं जो आपको कोई नहीं देख रहा है",
                "सुबह उठने के तुरंत बाद अपने फोन की जांच न करें और धीमी और शांतिपूर्ण सुबह करें",
                "10 मिनट के लिए ध्यान करें और आप तरोताजा महसूस करेंगे",
                "अपनी पेंट्री और फ्रिज व्यवस्थित करें।",
                "अपने कमरे को गहराई से साफ करें। खाली जगह, साफ दिमाग",
                "उन लोगों की सदस्यता समाप्त करें जो अब आपको खुशी नहीं देते हैं। आप बहुत अधिक राहत महसूस करेंगे",
                "अपने दिन के दौरान आराम करने के लिए कुछ समय बिताने के लिए आराम की अवधि निर्धारित करें",
                "सामान्य से पहले उठो। सफल लोग अपने दिन की शुरुआत जल्दी करते हैं।",
                "प्रेरक और प्रेरक किताबें पढ़ें आपको अपने आप में अपना विश्वास फिर से हासिल करने में मदद करता है",
                "बहु कार्य करने की कोशिश करना बंद करो",
                "उन चीजों की सूची बनाएं जिन्हें आप करना बंद करना चाहते हैं",
                "हटो। चलो। खिंचाव। सीधे बैठो",
                "उन विचारों को लिखें जो आपके दिमाग में आते हैं, लेकिन उन पर काम करना शुरू न करें। उन्हें शेड्यूल करें",
                "पूरे दिन अधिक उत्पादक होने के लिए ऊर्जा प्राप्त करने के लिए स्वस्थ नाश्ते का आनंद लें",
                "जब आप कुछ खत्म कर लेते हैं, चाहे वह कितना भी छोटा क्यों न हो, उसे लिख लें",
                "प्रतिनिधि। आपको सब कुछ करने की ज़रूरत नहीं है"
            ]
        },
        {
            "challenge_name": "खुशी",
            "challenge_description": "वैज्ञानिक अध्ययनों से पता चलता है कि खुशी कई लाभों से जुड़ी है, जिसमें उच्च उत्पादकता, अधिक रचनात्मकता, और तनाव का सामना करने में मजबूत लचीलापन शामिल है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "उन चीज़ों को लिखें जिन्हें आप अपने बारे में पसंद करते हैं",
                "तुम्हारे पास से हर किसी पर मुस्कुराओ",
                "थोड़ी कसरत करो",
                "रात का भोजन बनाएं",
                "जिसे आप प्यार करते हैं उसे गले लगाओ",
                "एक कॉमेडी फिल्म देखें",
                "एक दोस्त को फोन",
                "ऐसे नाचो जैसे तुम्हें कोई नहीं देख रहा",
                "प्रकृति में बाहर जाएं और एक दिन के लिए खोजकर्ता बनें",
                "किसी ऐसे व्यक्ति के लिए उपहार खरीदें जिसे आप प्यार करते हैं",
                "योग करने का प्रयास करें",
                "जल्दी सो जाओ और जल्दी उठो भी",
                "कुछ प्रेरणादायक पढ़ें",
                "10 मिनट के लिए ध्यान करें",
                "भविष्य की छुट्टी की योजना बनाएं",
                "कोई नया नुस्खा आज़माएं या अपना पसंदीदा भोजन पकाएं",
                "सुंदर सूर्यास्त देखें",
                "अपने पुराने दोस्त से जुड़ें",
                "किसी को माफ कर दो",
                "कुछ नया करने का प्रयास करें",
                "बाहर टहलने जाओ",
                "अपना पसंदीदा गाना सुनें",
                "दया का एक छोटा सा काम करो या किसी दोस्त या पड़ोसी की मदद करो",
                "किसी के साथ हंसी साझा करें",
                "अपने बच्चों/माता-पिता/दोस्तों/भाई बहनों को गले लगाओ",
                "अपने कुत्ते या अन्य पालतू जानवरों के साथ खेलें",
                "अपने फोन पर कम समय बिताएं",
                "लोगों को बताएं कि वे आपके लिए कितना मायने रखते हैं",
                "विषाक्त लोगों और आदत को जाने दो",
                "दिन 1 से अपनी यात्रा पर विचार करें"
            ]
        },
        {
            "challenge_name": "वित्तीय स्वतंत्रता चुनौती",
            "challenge_description": "वित्तीय स्वतंत्रता के सबसे महत्वपूर्ण लाभों में से एक यह है कि यह आपको अपने स्वयं के जीवन पर अधिक नियंत्रण प्रदान करता है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "अपने वित्तीय लक्ष्यों को परिभाषित करें",
                "अगले महीने का बजट बनाएं",
                "एक आपातकालीन निधि विकसित करें",
                "वित्तीय वेबसाइटों और ब्लॉगों की खोज करें",
                "सेवानिवृत्ति के लिए सहेजें",
                "यूट्यूब पर वित्तीय साक्षरता व्लॉग खोजें",
                "अतिसूक्ष्मवाद को अपनाएं",
                "एक मनी बुक खरीदें और इसे पढ़ना शुरू करें",
                "अपने करियर पर विचार करें",
                "अपना पैसा स्वचालित करें",
                "अपने क्रेडिट स्कोर की निगरानी करें",
                "अपने पैसे का बजट",
                "अपने किराने के बिल में कटौती करने के तरीके खोजें",
                "प्रतिशत की गणना करना सीखें",
                "अतिरिक्त आय बनाने के तरीके खोजें",
                "वह बेचें जिसकी आपको आवश्यकता नहीं है / उपयोग करें",
                "निवेश के बारे में और पढ़ें",
                "भावनात्मक खर्च को रोकने के लिए एक रणनीति खोजें",
                "कम खर्च वाला दिन",
                "भविष्य की खरीदारी के लिए एक बचत योजना लिखें",
                "बिलों में कटौती के तरीकों की तलाश करें",
                "धन प्रबंधन के बारे में पढ़ें",
                "बुनियादी वित्त शर्तें सीखें",
                "जानें कि क्रेडिट कार्ड कैसे काम करते हैं",
                "कर्ज चुकाने की योजना लिखें",
                "अपने गैर-जरूरी खर्चों को कम करने के तरीके खोजें",
                "अपने बिलों को स्वचालित करें",
                "अपनी प्रगति का जश्न मनाएं",
                "वित्तीय साक्षरता पाठ्यक्रम के लिए साइन अप करें",
                "वित्तीय स्वतंत्रता की राह पर रहें"
            ]
        },
        {
            "challenge_name": "पॉजिटिव पेरेंटिंग",
            "challenge_description": "सकारात्मक पालन-पोषण का अभ्यास करना माता-पिता और बच्चों के बीच आत्म-सम्मान, विश्वास, आत्म-क्षमता, माता-पिता और बच्चों के बीच मजबूत संबंध और संचार के बेहतर और प्रभावी प्रवाह जैसे सकारात्मक विकासात्मक परिणामों के लिए एक आवश्यक मार्गदर्शिका है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "अपने बच्चे के साथ कुछ ऐसा करें जिसे आप जानते हैं कि वे प्यार करते हैं",
                "अपने बच्चे से पूछें कि उनका पसंदीदा क्या है",
                "बच्चों के साथ शिल्प करें जैसे कि हमारी पेपर प्लेट तितली",
                "अपने बच्चे के साथ एक बार में कम से कम 30 मिनट बिताएं",
                "बेड टाइम स्टोरी पढ़ें",
                "एक साथ टहलें",
                "आज अपने बच्चे को चार बार गले लगाओ",
                "अपने बच्चे के लिए कुछ ऐसा पकाएं जो उन्हें पसंद हो",
                "एक साथ कुछ तस्वीरें लें या एक DIY फोटोबूथ भी बनाएं",
                "अपने बच्चे से पूछें कि वे क्या खास काम करना चाहेंगे",
                "उन्हें उनकी पसंदीदा जगह पर ले जाएं",
                "एक 'हैप्पी बॉक्स' एक साथ बनाएं",
                "एक साथ एक कहानी लिखें। अपने बच्चे को चित्र बनाने के लिए कहें",
                "एक साथ हाथ के निशान बनाएं",
                "अपने बच्चे को आज कुछ नया करना सिखाएं",
                "अपने बच्चे को पैसे के बारे में सिखाएं",
                "कुछ संगीत रखो और एक साथ नृत्य करो",
                "एक परिवार बोर्ड गेम बनाएं",
                "उनके लिए एक छोटा सा उपहार प्राप्त करें और उन्हें खोजने के लिए इसे घर में छिपा दें",
                "मफिन्स बेक करें या पैनकेक पकाएं और उन्हें एक पड़ोसी के पास ले जाएं",
                "दूसरे माता-पिता के लिए एक साथ कार्ड बनाएं",
                "आज ही अपने बच्चे के बारे में सकारात्मक बातें बोलें",
                "उनसे पूछें कि वे क्या सोचते हैं",
                "उनके पसंदीदा जानवर से पूछें और एक साथ एक मजेदार प्रोजेक्ट करें",
                "अपने बच्चे को जीवन कौशल सिखाएं",
                "एक प्रकृति की सैर पर जाएं। एक सूची से आइटम एकत्र करें",
                "एक रंग दिवस है। रंग में पोशाक, रंग वाले खाद्य पदार्थ खाएं।",
                "दादा दादी के लिए एक मजेदार शिल्प करो",
                "खेल के आटे के साथ एक साथ खेलें। एक मोल्डिंग प्रतियोगिताएं करें",
                "अपने बच्चे से उनकी पसंदीदा स्मृति पूछें। इसे फिर से करने की योजना बनाएं"
            ]
        },
        {
            "challenge_name": "अवसाद पर काबू पाएं",
            "challenge_description": "यह चुनौती आपको अवसाद से उबरने के लिए मार्गदर्शन करती है और आपको याद दिलाती है कि उपचार के लिए बहुत उम्मीद है। अवसाद अत्यधिक उपचार योग्य है। बहुत से लोग जो अवसाद का अनुभव करते हैं वे पूरी तरह से ठीक हो जाएंगे। दूसरों को उनके लक्षणों से कुछ हद तक राहत मिलती है। लड़ाई है इसके लायक - फलने-फूलने की क्षमताजीवन में अवसाद के बाद है।",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "अवसाद को ठीक करने में स्पर्श बहुत महत्वपूर्ण है। पालतू जानवरों को स्ट्रोक करें, दोस्तों और परिवार को गले लगाएं, अपने साथी के साथ सेक्स फिर से शुरू करें या मालिश करें।",
                "15 मिनट की शारीरिक गतिविधि के लिए बाहर निकलें। दौड़ने की कोशिश करें। यार्ड को साफ करें। अपने पालतू जानवरों के साथ टहलें।",
                "आहार अवसाद को कम करने में एक बड़ी भूमिका निभा सकता है। सुनिश्चित करें कि आप अच्छी तरह से और नियमित रूप से खाते हैं, भले ही आपको भूख न हो",
                "पर्याप्त नींद",
                "मुस्कुराओ और अपनी मुद्रा को बदलने के लिए आप कैसा महसूस करते हैं।",
                "लोगों ने मानसिक स्वास्थ्य के मुद्दों को कैसे दूर किया है, इसके सकारात्मक उदाहरण पढ़ें और जानें कि यह आपके लिए भी संभव है।",
                "भविष्य और अतीत को भूल जाओ। अपने आप से पूछो 'अभी, ठीक यहीं इसी क्षण में क्या गलत है?'",
                "खुश हार्मोन को बढ़ाने के लिए अपने विटामिन को पूरक करें। विटामिन बी 3 और विटामिन डी की कमी, जो सूरज की रोशनी से त्वचा में बनती है, को भी अवसाद से जोड़ा गया है",
                "अपने भीतर की आवाज़ सुनें। क्या यह कठोर या आलोचनात्मक है? क्या आप दूसरों के साथ भी ऐसा ही व्यवहार करेंगे? क्या ये विचार रचनात्मक या विनाशकारी हैं?",
                "सुनिश्चित करें कि आप हर दिन बाहर निकलें क्योंकि दिन के उजाले और सूरज की रोशनी सेरोटोनिन को बढ़ाती है और विटामिन डी के लिए आवश्यक है",
                "शर्मिंदा महसूस न करें। आपको यह जानकर आश्चर्य हो सकता है कि कितने लोग चुपचाप अवसाद से पीड़ित हैं। अपने परिवार और दोस्तों से बात करें।",
                "अपमानजनक संबंधों को काटें",
                "अपने पालतू जानवरों के साथ समय बिताएं",
                "आप अपने अवसाद से ज्यादा मजबूत हैं",
                "हर रोज संगीत सुनें",
                "ऐसी चीजें करें जो एक बार आपको खुश कर दें, भले ही आपको ऐसा महसूस न हो",
                "अलगाव से बचें",
                "हँसी अवसाद के लिए एक महत्वपूर्ण मारक है।",
                "आप प्यार कीजिए",
                "शराब और नशीली दवाओं से बचें",
                "कम अकेलापन महसूस करने के तरीके के रूप में एक स्वयंसेवी अवसर खोजें",
                "जानें कि ऑनलाइन दुनिया से कब जुड़ना या अलग होना है",
                "आगे देखने के लिए कुछ खोजें",
                "'डिप्रेशन वॉयस' जो सुझाव देती है, उसके विपरीत करें",
                "दूसरों की सेवा करने के लिए छोटे-छोटे उपाय खोजें",
                "समस्याओं पर ध्यान न दें। इसके बजाय सही समाधान पर ध्यान दें",
                "आपको उपलब्धि की अनुभूति देने के लिए व्यावहारिक लक्ष्य रखें",
                "आभारी बनें और हर दिन 3 अच्छी चीजों पर ध्यान दें",
                "किसी प्रियजन को अपने साथ नियमित रूप से चेक इन करने के लिए कहें।",
                "नकारात्मक विचारों को चुनौती दें।"
            ]
        }
    ]
}