{
  "all_challenges": [
    {
      "challenge_name": "Gestisci la sfida dell'ansia",
      "challenge_description": "Preoccupati di meno e goditi di più la vita con la nostra provata sfida. Dì di sì per sfidare te stesso e ti sentirai meglio in un mese.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
      "challenges": [
        "Prenditi cura della tua routine del sonno.",
        "Va bene chiedere aiuto.",
        "Riconosci i tuoi sentimenti.",
        "Prega e chiedi la guida di Dio.",
        "Scrivi le tue emozioni.",
        "Visualizza qualcosa di stimolante.",
        "Stop ai modelli di pensiero negativo.",
        "Trova gli aspetti positivi nella vita.",
        "Abbi compassione di te stesso e della tua ansia.",
        "Esamina la radice di tutti i pensieri negativi.",
        "Costruisci il tuo coraggio per affrontare qualcosa che stai evitando.",
        "Va bene avere ansia. Riconosci i sintomi e impara a controllarli.",
        "Elenca le cose che eviti a causa della tua ansia. Condividilo",
        "Rafforza una delle tue capacità di coping facendo qualche ricerca",
        "Fai una routine di yoga su Youtube appositamente per l'ansia",
        "Leggi qualcosa che fa bene alla salute mentale",
        "Ripara qualcosa che è stato danneggiato dalla tua ansia",
        "Vai in un posto che ti rilassi e allevi l'ansia",
        "Mangia oggi in un modo che faccia bene al corpo, alla mente e all'anima",
        "Fai qualcosa che ti aiuti a ricaricarti dove ti senti svuotato",
        "Trascorri 20 minuti ascoltando i suoni della natura",
        "Assicurati che i tuoi feed sui social media siano privi di ansia",
        "Lavora sul tuo discorso personale, niente parole cattive rivolte a te stesso",
        "Fai una scansione completa del corpo. Dove stai trattenendo la tua ansia",
        "Concentrati sul sonno, sul riposo e su una sana ora della nanna",
        "Cambia una cosa nella tua giornata che migliorerà la tua ansia",
        "Praticare la consapevolezza",
        "Scorri il rullino della fotocamera del tuo telefono. Quando trovi una foto che ti fa sorridere, condividila con chiunque altro ci sia",
        "Rivolgiti a qualcuno che pensi possa anche essere alle prese con l'ansia. Anche solo parlarne può aiutare entrambi",
        "Controlla il tuo obiettivo del Day 1. Quali sono i tuoi progressi?"
      ]
    },
    {
      "challenge_name": "Sentiti meravigliosamente",
      "challenge_description": "Trascorri il tuo tempo che ti farà sentire un po' più fantastico e meraviglioso accettando questa sfida affettiva.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
      "challenges": [
        "Riflessi sulle cose straordinarie che hai già fatto quest'anno.",
        "Concentrati sull'essere positivo",
        "Fai una lista di cose che ti rendono felice.",
        "Mangia i tuoi snack preferiti d'infanzia.",
        "Balla intorno a casa tua.",
        "Cerca di bere 8 bicchieri d'acqua.",
        "Guarda il tuo film preferito.",
        "Dai un nuovo look alla tua camera da letto/luogo di lavoro",
        "Guarda il tramonto/l'alba mentre ascolti le tue canzoni preferite",
        "Fai un pasto sano",
        "Compra qualcosa che vuoi veramente (cioccolato, fiore...)",
        "Fai qualcosa di carino per qualcuno",
        "Crea la tua playlist con canzoni che ti portano gioia",
        "Osserva le stelle ogni volta che puoi",
        "Ordina il tuo cibo preferito e fatti un regalo",
        "Fare una passeggiata",
        "Fai la tua bevanda preferita a casa",
        "Ascolta un podcast su qualcosa che ti interessa",
        "Metti insieme un puzzle",
        "Guarda il film della tua infanzia",
        "Fai la tua pizza/pasto preferito",
        "Invia a qualcuno un messaggio di ringraziamento su Messenger/WhatsApp",
        "Indossa le tue cose preferite oggi.",
        "Impara una nuova parola",
        "Fare un programma di menu per la settimana",
        "Esci con i tuoi figli/fratelli",
        "Complimenti a 3 persone oggi",
        "Finalmente termina il progetto incompiuto",
        "Niente dolci, bibite o fast food oggi",
        "Pianifica una giornata divertente con la tua famiglia"
      ]
    },
    {
      "challenge_name": "Vita intenzionale",
      "challenge_description": "Impegnati in questa piccola sfida quotidiana ti trasformerà la vita per diventare la versione migliore di te stesso",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
      "challenges": [
        "Prega quando ti svegli oggi. Grazie a Dio per un giorno nuovo di zecca pieno di opportunità.",
        "Imposta un'intenzione o solo 3 obiettivi per la giornata",
        "Sii intenzionale con le parole che dici su te stesso e sugli altri",
        "Scrivi una lista di gratitudine, prova a incorporarla ogni mattina/notte",
        "Stai lontano dagli schermi almeno 1 ora prima di andare a letto",
        "Cucina qualcosa che ami e mangia il tuo pasto consapevolmente wsenza distrazioni",
        "Fai una sessione di cura di te stesso, fai un bagno, fai una maschera facciale e goditi ogni secondo del processo",
        "Fai un diario di 20 minuti sulle tue esperienze di questo mese",
        "Tieni lontano il telefono mentre stai mangiando",
        "Ricompensati quando porti a termine i tuoi compiti. Può essere semplice come concederti del tempo per fare qualcosa che ti piace davvero",
        "Guardati allo specchio e dì a te stesso che sei bella e capace di tutto",
        "Fai una sessione di yoga/meditazione di 15 minuti",
        "Ascolta musica edificante. Scegli di avere nella tua playlist brani che manterranno buone le tue emozioni",
        "Esprimi la tua creatività oggi. Disegna, dipingi, scrivi, balla, fai solo qualcosa",
        "Fai una passeggiata nella natura",
        "Fai una scelta consapevole di utilizzare i social media in modo saggio e consapevole. Stabilisci dei limiti e scegli i contenuti che influiscono sul tuo benessere in modo positivo",
        "Prendi 10 minuti per annotare tutte le cose che ti piacerebbe fare e fare un piano per farne almeno una il mese prossimo",
        "Smetti di seguire gli account Instagram che non ti piacciono più",
        "Concediti qualche minuto per sederti e respirare. Sii nel momento",
        "Regalati un angolo di paradiso. Vai nella tua pasticceria preferita, acquista la tua preferita, siediti in un posto tranquillo e assapora ogni boccone",
        "Presta attenzione alla tua salute mentale. Sii intenzionale e consapevole delle tue emozioni e del tuo stato d'animo. Non aver paura di chiedere aiuto quando ne hai bisogno",
        "Mangia e goditi i pasti oggi senza telefono o schermo acceso",
        "Riconnettiti con qualcuno. Fai un piano con un amico su Messenger, FaceTime, WhatApp o incontrati per aggiornarti",
        "Ascolta un discorso motivazionale su Youtube",
        "Dai un'occhiata al blog Habitualize",
        "Consuma 3 diversi tipi di frutta oggi",
        "Scrivi 3 cose da realizzare domani",
        "Fai una camminata intuitiva",
        "Scrivi un diario per 10 minuti o più",
        "Sogna in grande. Stabilisci le intenzioni. Crea una bacheca delle visioni"
      ]
    },
    {
      "challenge_name": "Impara una nuova lingua",
      "challenge_description": "Imparare una nuova lingua è impegnativo ma può anche essere divertente, semplice e senza sforzo. Seguire la sfida di apprendimento linguistico di 30 giorni ti permetterà di migliorare il tuo apprendimento linguistico ogni giorno.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
      "challenges": [
        "Impara 5 nuove parole",
        "Prova una nuova app per la lingua",
        "Guarda un film nella lingua che stai imparando con i sottotitoli",
        "Scrivi liste della spesa/delle cose da fare nella tua lingua di destinazione",
        "Insegna a qualcuno alcune parole e frasi",
        "Chiedi 'Come stai?' ad un amico",
        "Guarda un tutorial per qualcosa nella lingua",
        "Scrivi la tua esperienza di oggi",
        "Racconta qualcosa che stai facendo",
        "Guarda un video tutorial di Youtube sulla lingua",
        "Insegna a qualcuno 5 nuove parole",
        "Impara la grammatica di base",
        "Diario nella tua lingua di destinazione",
        "Leggi un articolo di notizie",
        "Parla con una persona o con il tuo animale domestico",
        "Cambia le impostazioni del telefono per un giorno",
        "Scrivi recensione per un libro/film",
        "Leggi qualcosa",
        "Registrati mentre pratichi la lingua",
        "Scrivi 40 parole che hai imparato",
        "Scrivi come questa sfida ti ha aiutato",
        "Riesci ancora a ricordare le parole che hai imparato il Day 1?",
        "Rispondi a un quiz online sulla lingua target",
        "Insegna a un familiare con 7-10 nuove parole",
        "Scrivi 50 parole che hai imparato",
        "Scrivi qualcosa sulla tua giornata",
        "Ascolta una canzone nella lingua",
        "Scrivi una storia",
        "Ascolta podcast",
        "Crea schede flash per memorizzare facilmente le parole"
      ]
    },
    {
      "challenge_name": "Sfida alla consapevolezza",
      "challenge_description": "La pratica della consapevolezza aiuta a ripristinare la tua mente e ad avere una prospettiva chiara quando diventi sfocato o ti senti sopraffatto nella vita",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
      "challenges": [
        "Prima di svolgere qualsiasi compito oggi, chiediti qual è il motivo per cui lo fai e contemplalo per un momento",
        "Doccia consapevole. Visualizza di lavare via i tuoi pensieri negativi e concentrati sulla sensazione dell'acqua sulla tua pelle",
        "Prima di andare a dormire, scrivi 3 cose che hai davvero apprezzato della giornata",
        "Pratica la gratitudine. Inizia a concentrarti sui pensieri positivi e lascia andare il tuo schema cerebrale pauroso e ansioso",
        "Ripristina la tua postura ogni volta che ti siedin, raddrizza delicatamente la schiena",
        "Fai un po' di esercizio oggi e concentrati sulle sensazioni fisiche",
        "Praticare l'ascolto attivo oggi. Questo significa concentrarsi su ciò che l'altra persona sta dicendo e rispondere in modo appropriato",
        "Fai una scansione del corpo. Porta la tua attenzione sul tuo corpo e manda il respiro in tutte le aree di tensione",
        "Trova un posto tranquillo dove puoi sederti e scrivere quello che senti in questo momento",
        "Sii curioso oggi. Esercitati a interessarti a ciò che sta succedendo e concentrando la tua attenzione per saperne di più su di esso",
        "Nota i tuoi sensi quando assaggi, tocchi, annusi e senti qualcosa",
        "Respirazione consapevole. Inspira, trattieni per 3 secondi e poi espira",
        "Cammina con consapevolezza. Prendi una posizione per sentirti connesso alla terra e saldamente radicato al suolo",
        "Bevi una tazza di tè consapevole. Concentrati sul gusto, sull'olfatto e sul calore",
        "Esercitati ad ascoltare senza giudicare durante una conversazione",
        "Fai una cosa alla volta e concentrati solo su quella",
        "Siediti comodamente, senti i piedi ben saldi a terra, la schiena dritta e le mani in grembo. Concentrati sulla respirazione per un po'",
        "Ascolta te stesso mentre rispondi al telefono o mentre stai conversando, il modo in cui parli, le parole che scegli",
        "Apprezza tutto oggi. Nota tutto ciò che accade e trova un modo per apprezzarlo",
        "Osserva con attenzione. Descrivi mentalmente un oggetto nei dettagli, il colore, la consistenza, la forma...",
        "Siediti in un posto accogliente e tranquillo per un po'",
        "Fai un compito alla volta e mantieni la concentrazione su quello che stai facendo",
        "Praticare l'empatia verso qualcuno che normalmente ti fa sentire sconvolto",
        "Trova un articolo o un video sul motivo per cui gli errori e i fallimenti fanno bene. Prendilo a cuore in modo da poter dedicare meno tempo a concentrarti sul passato",
        "Mangia consapevolmente. Assaggia il piatto e prova a indovinare quanti ingredienti ci sono andati",
        "Guardati intorno. Guarda una foglia/albero/fiore in particolare e concentra la tua attenzione",
        "Trova film divertenti, racconta barzellette divertenti, ascolta persone divertenti. Ridi il più possibile oggi",
        "Sfrutta i momenti in cui devi aspettare ed essere consapevole concentrandoti sui sensi e sul respiro",
        "Lavarsi i denti oggi con la mano non dominante per incoraggiare l'attenzione",
        "Controlla sempre sull'app Habitualizer e ricorda di prestare attenzione in ogni momento"
      ]
    },
    {
      "challenge_name": "Tempo in famiglia",
      "challenge_description": "Il tempo trascorso in famiglia offre molti vantaggi, tra cui la creazione di fiducia, la creazione di un legame emotivo più forte tra i membri della famiglia, il miglioramento delle capacità comunicative, il rendimento scolastico migliore e la riduzione dei problemi comportamentali, oltre a fornire l'opportunità di creare ricordi basati sul divertimento, risate e stare insieme",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
      "challenges": [
        "Chiedi ai tuoi figli di condividere un tipo di cosa che hanno fatto oggi o che hanno in programma di fare. Offri prima i tuoi progetti",
        "Insegna ai tuoi bambini un trucco con le carte o un gioco di carte, o giocane uno che piace a entrambi",
        "Scegli un punto di riferimento, una città o un paese che interessa a tuo figlio e trascorri del tempo ad esplorarlo tramite Youtube o Facebook",
        "Prepara una cena speciale. Metti fiori freschi sul tavolo, accendi candele e prenditi un momento per esprimere gratitudine per essere una famiglia",
        "Fai una foto di famiglia",
        "Andate in chiesa e pregate insieme",
        "Serata film e pizza in famiglia",
        "Disegnare ritratti l'uno dell'altro",
        "Cucinare insieme la cena",
        "Suonare 'preferiresti' insieme",
        "Fai un puzzle insieme",
        "Fai una torta o dei biscotti per la tua famiglia",
        "Pianifica un picnic in famiglia",
        "Gioca ai videogiochi insieme",
        "Cantate insieme le canzoni del karaoke",
        "Fate una passeggiata insieme dopo cena",
        "Giocate insieme a un gioco da tavolo",
        "Pianifica un viaggio o una vacanza",
        "Ritaglia un momento speciale per raccontare barzellette a tuo figlio. Ridere anche di lui",
        "Prepara una cena speciale per la tua famiglia",
        "Crea una lista dei desideri per la famiglia",
        "Guarda vecchie foto di famiglia o guarda vecchi video",
        "Fai una passeggiata/un'escursione insieme",
        "Guarda un'alba (o un tramonto) insieme",
        "Trascorri 15 minuti con ogni membro della famiglia",
        "Visitare un centro naturalistico e apprezzarne la bellezza",
        "Partecipa alle attività extracurriculari di tuo figlio",
        "Incoraggiate i vostri bambini nei loro hobby",
        "Sorprendi i tuoi bambini con un viaggio o un'attività divertente",
        "Dì sempre loro quanto amie loro"
      ]
    },
    {
      "challenge_name": "Esci dalla tua zona di comfort",
      "challenge_description": "Implementare questa sfida ti porterà a diventare una persona più forte, ad acquisire fiducia in te stesso attraverso le esperienze, ad aiutarti a continuare il tuo sviluppo personale e ad avere la possibilità di incontrare nuove persone.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
      "challenges": [
        "Alzati 1 ora prima del solito",
        "Dì ciao!' a un estraneo casuale",
        "Non andare sui social media e non guardare la TV per 24 ore",
        "Avvicinati a qualcuno al lavoro e fagli un complimento sincero",
        "Rivolgiti a qualcuno con cui non parli da un po'",
        "Prendi una strada diversa mentre vai al lavoro/a scuola",
        "Fai una conversazione difficile con qualcuno su un argomento che stavi evitando",
        "Compra qualcosa che non compreresti mai al supermercato",
        "Inizia ad imparare una nuova lingua",
        "Avvicinati allo sconosciuto, sorridi e fagli un complimento",
        "Chiedi aiuto se ne hai bisogno o aiuta qualcuno senza che lo chieda",
        "Fare programmi per il fine settimana o per il giorno libero",
        "Prova un nuovo hobby/sport che hai sempre desiderato anche tu",
        "Inizia una conversazione con uno sconosciuto",
        "Prova oggi una disintossicazione digitale",
        "Crea una vision board (lasciati ispirare su Pinterest)",
        "Esci per un appuntamento",
        "Chiedi a qualcuno per un appuntamento/complimenti qualcuno che ti intimidisce",
        "Avvia un blog/canale youtube/pagina Instagram/un libro, qualunque cosa desideri il tuo cuore",
        "Vai in un posto nuovo da mangiare o da portare fuori",
        "Inizia una nuova sfida con un amico (puoi usarne una da questa app o crearne una tua)",
        "Prova un nuovo allenamento (zumba, yoga, pilates, kickboxing, ecc.)",
        "Fai un regalo spontaneo",
        "Iscriviti per qualcosa di nuovo",
        "Prendi una nuova strada andando a casa/lavoro/scuola",
        "Vai a dormire prima del previsto",
        "Viaggiare in un posto nuovo",
        "Sviluppare una nuova abilità",
        "Invia 5 messaggi di gratitudine a 5 persone",
        "Prova un nuovo look"
      ]
    },
    {
      "challenge_name": "Trova la pace interiore",
      "challenge_description": "La pace interiore calma la nostra mente e ci permette di vedere il nostro percorso molto più chiaro, aiutandoci a concentrarci e tenere traccia dei nostri obiettivi.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
      "challenges": [
        "Prova l'aromaterapia. Il profumo può evocare ricordi vividi e realistici. Quando annusiamo qualcosa di buono, ci sentiamo rilassati",
        "Pianifica per domani. Questo non solo ti dà più tempo al mattino, ma rende anche la tua vita più calma e semplice, permettendoti di pianificare in anticipo",
        "Con le nostre vite occupate e distratte, può essere facile dimenticare di mostrare apprezzamento alle persone con cui interagiamo ogni giorno. Prenditi del tempo per mostrare gratitudine per le persone intorno a te",
        "Prova a mangiare qualcosa e concentrati sui tuoi cinque sensi. Concentrati davvero su ogni senso, gusto, olfatto, tatto e vista.",
        "Riordina uno spazio nella tua casa. Questo è un percorso per guarire i blocchi emotivi e la confusione interiore. Crea un ambiente calmo e pacifico",
        "Sorridi allo specchio. Può sembrare ridicolo, ma ha molti benefici per il tuo benessere. Rallenta il cuore, rilassa il corpo e rilascia ormoni per contrastare lo stress",
        "Fai un respiro profondo e chiudi gli occhi. Elenca mentalmente 5 cose per cui sei stato grato. Questo può spostare i tuoi pensieri da negativi a positivi",
        "Imposta un timer per 60 secondi e concentrati esclusivamente sulla respirazione. Nota come suona e come si sente il tuo corpo",
        "Fai un bagno consapevole. Prenditi una pausa, spegni le luci. Lascia che l'acqua scorra sul tuo corpo e concentrati sulle sensazioni e sul calore che senti",
        "Crea un rito del tè o del caffè. Non devi fare altro che rallentare. Presta attenzione a ciò che stai facendo e assaporane il gusto",
        "Se il tuo corpo è teso per tutto il giorno, prenditi un momento per rilassarti. Fai un respiro profondo, rilassa le spalle e apri la mascella",
        "Imposta 3 obiettivi giornalieri. Questo è un numero gestibile e ti consente il tempo e l'energia mentale necessari per concentrarti su di essi in modo consapevole e completo",
        "Prova una meditazione di 4 minuti. Imposta una sveglia di 4 minuti sul telefono, siediti comodamente, chiudi gli occhi e respira in modo naturale. Se la tua mente inizia a vagare, riportala al tuo respiro",
        "Abbraccia forte qualcuno e fai 3 grandi respiri insieme. Respirare ti radica",
        "Prenditi una pausa digitale. Non fare affidamento sui tuoi dispositivi digitali come fonte di comfort. Questi creano un falso senso di urgenza e ci lasciano in piedi come se ci mancasse qualcosa",
        "Invece di giudicare ciò che qualcuno sta dicendo,ascoltali con attenzione e presta attenzione a ciò che viene detto",
        "Camminare è molto rilassante per il corpo, la mente e lo spirito. Inizia trovando un luogo adatto. Osserva l'ambiente intorno a te, fermati e concentrati sugli alberi, sul fogliame e sul terreno su cui cammini",
        "Concentrati sul momento. Un consiglio fondamentale è smettere di confrontare il presente con il passato e concentrarti su ciò che sta accadendo in questo momento. Potrebbe essere semplice come concentrare la tua attenzione su un compito che stai svolgendo",
        "Alzati e respira. Senti la tua connessione con la terra",
        "Scansiona il tuo corpo e nota sensazioni o emozioni fisiche. Scarica eventuali sensazioni, emozioni o sentimenti spiacevoli durante l'espirazione. Nota eventuali sentimenti piacevoli e riempili con il respiro",
        "Dirigi la tua attenzione su ciò a cui stai pensando nel presente. Essere consapevoli della tua attività mentale può aiutarti a ottenere una prospettiva sui tuoi pensieri",
        "Conosci te stesso e ama te stesso",
        "Stai fuori dalle cose negative",
        "Identifica e lascia andare i fattori che bloccano la tua pace",
        "Chiudi gli occhi quando sei arrabbiato",
        "Smettila di preoccuparti degli altri, pensa a te",
        "La pace viene vivendo una vita significativa",
        "Prega sempre quando ti svegli la mattina e prima di andare a dormire",
        "Risolvi i conflitti della tua vita",
        "Accettare limitazioni per favorire la resilienza"
      ]
    },
    {
      "challenge_name": "Routine notturne",
      "challenge_description": "Risultati della routine notturna di ottenere sufficienti ore di sonno, avrai una concentrazione più nitida e un livello di energia più elevato per una giornata produttiva al mattino",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
      "challenges": [
        "Rifletti sulla giornata. Scrivi almeno una cosa che è andata abbastanza bene",
        "Prenditi un momento per comunicare con Dio attraverso la preghiera. Aprigli il tuo cuore, libera tutto ciò che hai in mente e ringrazialo per tutto ciò che è accaduto durante la giornata. Questo è un ottimo modo non solo per praticare la gratitudine, ma anche per rimanere connesso con Dio.",
        "Prenditi un momento per riflettere su ciò che devi fare il giorno successivo e pianificare di conseguenza.",
        "Prendi un foglio e scrivi quello che hai in mente. Questo significa solo che puoi andare a dormire senza doverti preoccupare di quello che farai domani perché è già scritto",
        "Avere un buon ambiente per dormire. Mantenere la camera da letto a una buona temperatura, utilizzare tende oscuranti o una maschera antisolare per bloccare la luce",
        "Scrivi un diario. Prenditi il ​​tempo per fermarti e riflettere",
        "Accendi delle candele profumate e riproduci una playlist rilassante",
        "Fai un po' di stretching/yoga prima di andare a letto",
        "Scrivi una lista di gratitudine",
        "Leggi un buon libro prima di andare a dormire. Ti aiuta a rilassarti e a dormire meglio.",
        "Pianifica le tue attività del giorno successivo, cibo, abbigliamento, …",
        "Invia una buona notte speciale per mandare un messaggio a qualcuno che ami",
        "Fai una bella doccia o un bagno caldo",
        "Ritagliare caffeina, alcol o zucchero almeno 3 ore prima di coricarsi",
        "Medita/prega. Sii solo con i tuoi pensieri",
        "Riordina il tuo posto. Potrai sentirti più calmo e rilassato",
        "Fai una cena leggera prima di andare a letto",
        "Imposta intenzioni per domani",
        "Diffondi alcuni oli essenziali per migliorare la qualità del sonno",
        "Evita di controllare e-mail, notizie, studiare o lavorare prima di dormire",
        "Non andare a letto affamato. Mangia delle mandorle, una banana o un porridge per aiutarti a dormire meglio",
        "Evita il telefono almeno 1 ora prima di andare a dormire",
        "Bevi della camomilla o altra tisana (decaffeinata) prima di coricarti",
        "Fare un bagno caldo o una doccia circa un'ora o due prima di coricarsi può fare miracoli per aiutarti a rilassarti prima di andare a letto",
        "Assicurati di bere acqua prima di andare a letto. Perdiamo umidità quando dormiamo. È importante idratarsi bene",
        "Lavarsi i denti in 2 minuti",
        "Pensa alle tue ultime 24 ore e scrivi almeno una cosa che è andata abbastanza bene",
        "Scrivi le priorità principali per domani in un pianificatore o un taccuino.",
        "Riduci l'ansia con una lista di cose da fare",
        "Prega sempre prima di andare a dormire e perdona te stesso"
      ]
    },
    {
      "challenge_name": "Affermazione positiva",
      "challenge_description": "Questa sfida può aiutare a rafforzare l'autostima aumentando sia la tua opinione positiva di te stesso che la tua fiducia nella tua capacità di raggiungere i tuoi obiettivi.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
      "challenges": [
        "Abbraccio le possibilità e il potenziale di questo giorno",
        "Scelgo di essere felice e di amarmi oggi",
        "Sonodisposti a cambiare e crescere",
        "Abbraccio le esperienze al di fuori della mia zona di comfort",
        "Io sono di talento e intelligente",
        "Le sfide mi portano opportunità di crescere",
        "Mi fido del mio intuito a guidarmi",
        "Sono innamorato di me stesso e del mio corpo",
        "Sono in pace con il mio passato",
        "Sarò gentile con me stesso e gli altri oggi",
        "Io scelgo la fede alla paura",
        "Oggi sarà una giornata positiva",
        "Sono grato per tutto quello che ho",
        "Io sono più dei miei pensieri negativi",
        "Mi accetto incondizionatamente",
        "Sono sano e felice",
        "Tutto ciò che sta accadendo ora sta accadendo per il mio bene finale",
        "Mi occupo di come mi sento e oggi scelgo la felicità",
        "Oggi non mi paragonerò agli estranei su Internet",
        "Ho il potere di creare cambiamento",
        "I miei sentimenti e pensieri sono validi",
        "Ho abbondanza e forza interiore",
        "Sono pronto a vedere le cose con una nuova prospettiva",
        "Sono degno di amore e rispetto",
        "La mia mente è chiara, forte e concentrata",
        "Affronto la giornata con energia e coraggio",
        "Sono ispirato e motivato dai miei sogni",
        "Mi merito il meglio e lo accetto ora",
        "Sono unico e fiducioso",
        "Vedo infinite opportunità nella mia vita"
      ]
    },
    {
      "challenge_name": "Diario quotidiano",
      "challenge_description": "Il diario aiuta a controllare i sintomi e a migliorare il tuo umore: Aiutandoti a dare priorità a problemi, paure e preoccupazioni. ",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
      "challenges": [
        "Scrivi di qualcuno che ti ispira",
        "Scrivi circa 5 benedizioni nella tua vita",
        "Pubblica 30 fatti su di te",
        "Di cosa sei entusiasta?",
        "Quali sono le 3 lezioni che vuoi che i tuoi figli/amici/fratelli imparino da te?",
        "Scrivi di una sfida attuale",
        "Scrivere soluzioni ai problemi",
        "Scrivi ciò che vuoi imparare in futuro",
        "Elenca ciò che ami dei tuoi genitori/famiglia",
        "Come sarebbe il tuo giorno perfetto?",
        "Scrivi tutte le cose che vorresti ottenere quest'anno",
        "Di cosa hai bisogno di più nella tua vita?",
        "Fai un elenco delle cose che faresti se non avessi paura e come avrebbero un impatto sulla tua vita",
        "Che consiglio daresti a te che hai dieci anni?",
        "Come puoi rendere migliore il domani?",
        "Scrivi di tutte le cose che ti rendono nervoso e come potresti cambiarle?",
        "Cos'è qualcosa che hai imparato ieri?",
        "Scrivi di una lotta passata che hai superato. Come ti ha reso più forte?",
        "Qual è qualcosa che non vedi l'ora di fare in questo momento?",
        "Cosa ti dà più gioia? Come puoi dedicare più tempo?",
        "Cos'è qualcosa che manca nella tua vita? E come puoi cambiarlo?",
        "Scrivi di un periodo in cui ti sei sentito orgoglioso di te stesso",
        "Se avessi 3 desideri per quest'anno, cosa vorresti?",
        "Cosa hai in mente in questo momento?",
        "Scrivi di qualcosa o qualcuno che ti manca",
        "Che cosa apprezzi di più oggi?",
        "Scrivi un momento della tua vita che ti rende felice quando ci pensi",
        "Se la vita si fermasse oggi, cosa ti pentiresti di non aver fatto?",
        "Come vuoi che le persone si ricordino di te e perché?",
        "Di quali aspetti di te hai bisogno per mostrare più amore?"
      ]
    },
    {
      "challenge_name": "Routine mattutina",
      "challenge_description": "Avere una routine mattutina può aumentare la tua energia, produttività e positività.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
      "challenges": [
        "Siediti o stai in piedi al sole per 20 minuti mentre svolgi la tua routine mattutina, fai colazione, controlla le notizie o fai esercizio",
        "Scegli 3 cose da realizzare prima di mezzogiorno",
        "Dai la priorità alla tua giornata. Quali compiti speri di svolgere oggi?",
        "Questa mattina, prenditi qualche minuto per ascoltare i tuoi pensieri e sentimenti, identificarli e spostarli se necessario",
        "Scrivi una lista di cose da fare per oggi",
        "Connettiti con la tua famiglia e i tuoi amici o invia un semplice messaggio di buongiorno a qualcuno che ami",
        "Fai un respiro profondo e ringrazia per questo giorno",
        "Scrivi 5 cose di cui sei orgoglioso",
        "Medita per 15 minuti",
        "Bevi un bicchiere diacqua prima di colazione",
        "Apri le finestre per una boccata d'aria fresca e lascia entrare un po' di sole",
        "Fai una passeggiata o fai una sessione di allenamento a casa",
        "Leggi alcuni capitoli del tuo libro preferito",
        "Fai uno yoga di 15 minuti",
        "Ascolta un podcast o un audiolibro mentre ti prepari",
        "Vai fuori e respira l'aria fresca del mattino",
        "Fai una lista di 3 cose da fare per la giornata",
        "Evita di controllare le notizie del mattino e i social media",
        "Rifai il tuo letto e riordina il tuo spazio per sentirti più produttivo",
        "Scegli un'affermazione per guidare la tua giornata. Ad esempio:' 'Oggi è un grande giorno.'",
        "Fai una doccia e preparati anche se non vai da nessuna parte",
        "Non controllare nessuna forma di social media come prima cosa al mattino",
        "Quando ti svegli, attira una buona idea per avere buone vibrazioni tutto il giorno",
        "Scrivi una lista di gratitudine mattutina",
        "Ascolta la tua playlist musicale preferita per metterti di buon umore al mattino",
        "Fai un po' di stretching dopo esserti svegliato",
        "Fai una colazione sana e sfiziosa",
        "Non controllare le notifiche prima di colazione",
        "Dipingi, suona uno strumento musicale. Fai qualcosa che alimenta la tua creatività",
        "Svegliati con un sorriso e un atteggiamento positivo per la giornata a venire"
      ]
    },
    {
      "challenge_name": "mentalità positiva",
      "challenge_description": "Pensare in modo positivo è un'abitudine a cui possiamo allenarci. La ricerca mostra che ha un impatto positivo sulla salute sia del corpo che della mente.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
      "challenges": [
        "Esercitati a sorridere. Sorridi agli estranei, allo specchio, sorridi ogni volta che puoi. Ti sentirai molto più positivo",
        "Apprezzare le piccole cose oggi. Il sorriso di qualcuno, il tramonto, il caffè del mattino, il calore di un raggio di sole, il cielo",
        "Invece di pensare 'la mia vita è orribile', le cose non vanno bene in questo momento, ma questo passerà. Stanno arrivando giorni migliori",
        "Invece di pensare alle cose orribili che potrebbero accadere, considera le grandi cose che potrebbero derivare dalla tua situazione attuale",
        "Invece di dire 'Mi arrendo', dì 'questo è difficile ma continuerò a provare'",
        "Smettila di preoccuparti di ciò che pensano gli altri. I pensieri delle altre persone non sono progettati per renderti felice e positivo",
        "Invece di pensare 'perché mi sta succedendo questo?', Pensa 'che cosa mi sta insegnando questo?'",
        "Fidati che cose migliori stanno arrivando se sei aperto alle possibilità'",
        "Invece di pensare 'Non posso farlo', pensa 'Non so ancora come farlo'",
        "Non paragonarti a nessun altro oggi. È una totale perdita di tempo",
        "Ricorda, anche se non puoi controllare una certa situazione, puoi controllare il tuo riposo",
        "Medita. Questo ti aiuterà a pensare troppo, riduce lo stress e può aiutarti a essere più positivo",
        "Esercitati a parlare di te stesso in modo positivo. Puoi usare affermazioni positive con la tua meditazione",
        "Inizia o termina la tua giornata scrivendo il tuo diario della gratitudine",
        "Circondati di persone che ami e che ricambiano il tuo amore",
        "Ascolta la musica. La musica può avere un effetto positivo sulla tua salute e sulla tua giornata",
        "Accettazione pratica. Apprezza tutto ciò che hai in questo momento",
        "Ascolta un video/podcast di YouTube di ispirazione. Riempi il cervello di motivazione",
        "Elenca 5 cose che ti hanno fatto sorridere oggi",
        "Invece di dire 'Ho fallito', dì 'Gli errori mi aiutano a imparare'",
        "Limita il tempo sui social media. Dedica più tempo a creare e lavorare su te stesso che a consumare i contenuti di altre persone",
        "Scrivi le tue priorità e i tuoi piani per il futuro sapendo che otterrai tutto ciò che desideri",
        "Rimani presente e apprezza la bellezza del momento. (Senti il ​​sole in faccia, apprezza l'aria fresca….)",
        "Sii orgoglioso di te stesso per le piccole vittorie di oggi (e nella tua giornata per giorno)",
        "Cambia il tuo umore facendo qualcosa che ti piace davvero",
        "Per una situazione imminente di cui sei preoccupato, scrivi lo scenario migliore che può accadere",
        "Concentrati sulle soluzioni, non sui problemi",
        "Lascia andare le aspettative degli altri e concentrati su ciò che conta",
        "Circondati di persone positive",
        "Abbi cura di te. Quando ci sentiamo al meglio, possiamo vedere le cose in modo più positivo"
      ]
    },
    {
      "challenge_name": "Amore per se stessi",
      "challenge_description": "È stato clinicamente dimostrato che impegnarsi in una routine di cura di sé riduce o elimina l'ansiae depressione, ridurre lo stress, migliorare la concentrazione, ridurre al minimo la frustrazione e la rabbia, aumentare la felicità e migliorare l'energia",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
      "challenges": [
        "Elenca 10 cose che ami di te stesso",
        "Dì 'Grazie' alle tue cinque parti del corpo allo specchio oggi",
        "Scrivi un post ogni volta che sei orgoglioso di te stesso. Mettilo in un barattolo 'Sono orgoglioso di me stesso'",
        "Perdona te stesso per un rimpianto a cui ti sei aggrappato e lascialo andare",
        "Scrivi una lista con tutte le cose che ami di te stesso",
        "Tratta il tuo corpo con alimenti salutari e tanta acqua",
        "Pulisci la tua stanza/scrivania/ripostiglio e ripulisci tutto ciò che non ti dà più gioia",
        "Fai una foto di te stesso e scrivi tutto ciò che ami del tuo aspetto",
        "Non seguire più chi ti fa sentire insicuro e cattivo con te stesso",
        "Vai da qualche parte dove puoi guardare l'alba/il tramonto e godertelo da solo",
        "Vestiti sempre per te stesso. Indossa il tuo outfit preferito oggi",
        "Rifletti nella tua settimana e scrivi 5 cose per cui sei grato",
        "Fai un diario su come ti senti e cosa sta succedendo nella tua vita",
        "Esci con te stesso. Vai al tuo ristorante preferito, vai in spiaggia... In un posto in cui ti senti bene e rilassato dove puoi entrare in contatto con te stesso",
        "Pianifica una ricompensa per te stesso quando finisci questa sfida",
        "Fai una lunga passeggiata e connettiti con la natura",
        "Annota la sfida più grande che hai superato",
        "Scollega per l'intera giornata da qualsiasi tecnico (a meno che tu non abbia del lavoro da fare)",
        "Mangia il tuo pasto o dessert preferito",
        "Scrivi una lettera d'amore a te stesso",
        "Scrivi ciò che hai imparato da questa sfida e non dimenticare la tua ricompensa che hai pianificato nel giorno 15",
        "Cos'è qualcosa che amavi fare quando eri bambino? Fallo oggi",
        "Fai un pasto nutriente",
        "Recuperare un vecchio amico o parente",
        "Fai un pisolino nel pomeriggio",
        "Guarda un film che hai sempre desiderato",
        "Crea un collage video dei tuoi selfie preferiti",
        "Elenca 5 cose in cui sei davvero bravo",
        "Scrivi di un traguardo di cui sei orgoglioso",
        "Scegli 3 affermazioni positive da dire ogni giorno. Es. Ce la posso fare."
      ]
    },
    {
      "challenge_name": "Migliora la fiducia",
      "challenge_description": "La fiducia può anche darti una visione positiva della vita, aumentando il tuo benessere mentale ed emotivo.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
      "challenges": [
        "Smetti di seguire tutti gli account sui social media che ti fanno sentire insicuro di te stesso",
        "Lavora per accettare i complimenti piuttosto che negarli oggi",
        "Sii consapevole della tua postura. Una buona postura sviluppa più sicurezza",
        "Fai qualcosa che amavi fare da bambino",
        "Fai qualcosa di impegnativo oggi, ricorda che non cresciamo quando siamo nella nostra zona di comfort",
        "Scrivi 10 cose che ami di te stesso",
        "Dì di sì a qualcosa che normalmente non vorresti",
        "Attuare una nuova sana abitudine",
        "Parla quando hai qualcosa da dire",
        "Concentrati su ciò che vuoi piuttosto che su ciò che non vuoi",
        "Lavora per migliorare le tue abilità su qualcosa che ami fare o che vorresti iniziare a fare",
        "Annota tutte le tue realizzazioni, comprese quelle future",
        "Fai un allenamento veloce, fatti una doccia, preparati e indossa un outfit che ti faccia sentire bene",
        "Esci da solo a guardare il tramonto",
        "Rivolgiti a un vecchio amico",
        "Inventa pensieri positivi per ogni negativo",
        "Date a qualcuno un buon consiglio",
        "Fai un allenamento che ti piace",
        "Lavora sulle piccole cose. I piccoli risultati ti fanno stare bene",
        "Fai una pausa e rifletti su qualcosa prima di agire, invece di reagire impulsivamente",
        "Sii autentico e abbraccia la tua unicità. La vita non è una competizione",
        "Non parlare negativamente delle altre persone per l'intera giornata",
        "Scrivi una cosa che hai fatto per la tua famiglia",
        "Scrivi una lettera d'amore a te stesso",
        "Scrivi 3 paure e come puoi superarle",
        "Identifica un cambiamento che vuoi apportare e i passaggi per farlo",
        "Fai qualcosa che ti faccia sentire speciale",
        "Chiedi a tre amici di raccontarti la loro cosa preferita di te",
        "Annota 3 dei tuoi errori e delle lezioni apprese",
        "Imposta un obiettivo raggiungibile per te stesso"
      ]
    },
    {
      "challenge_name": "Atto di gentilezza",
      "challenge_description": "Un atto di gentilezza può aumentare i sentimenti di fiducia, controllo, felicità e ottimismo. Possono anche incoraggiare gli altri a ripetere le buone azioni che hanno vissuto loro stessi, contribuendo a una comunità più positiva.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
      "challenges": [
        "Mostra supporto a qualcuno oggi",
        "Dona il sangue. Salva vite",
        "Lascia una recensione positiva sul tuo ristorante/caffetteria preferito",
        "Fai colazione a letto per un familiare/amato",
        "Chiedi a qualcuno come puoi aiutarlo - e poi fallo.",
        "Sorridi a qualcuno che ne ha bisogno",
        "Lascia una recensione positiva della tua app preferita",
        "Dai una mancia per il netturbino",
        "Chiedi ai tuoi genitori/fratelli/figli se c'è qualcosa che puoi fare per aiutarli",
        "Scrivi un elenco di motivi per cui ami qualcuno e daglielo",
        "Dai una mancia a qualcuno",
        "Trascorri la giornata dicendo solo cose positive sulle persone",
        "Di' a qualcuno che ami quanto lo apprezzi",
        "Fai un lavoro che di solito non faresti",
        "Di' 'Buona giornata' ad almeno 3 persone che hai incontrato",
        "Compra un pasto per un senzatetto",
        "Aiuta qualcuno prima che chieda",
        "Cuoci i biscotti e regalali a qualcuno",
        "Cerca di donare vestiti/giocattoli/libri a un ente di beneficenza locale",
        "Chiama qualcuno con cui non parli da un po'",
        "La cosa più importante di tutte, sii sempre gentile con te stesso",
        "Scrivi un biglietto di ringraziamento a qualcuno che ha avuto un impatto nella tua vita",
        "Lascia che qualcuno ti avanzi davanti mentre si mette in fila",
        "Sorprendi qualcuno con un regalo",
        "Metti note adesive positive sugli specchi",
        "Fai il check-in con un parente anziano",
        "Fai 3 sinceri complimenti a qualcuno che ami",
        "Di' grazie più che puoi",
        "Complimenti a qualcuno",
        "Evita i pensieri negativi per un giorno. Mostra anche a te stesso un po' di gentilezza!"
      ]
    },
    {
      "challenge_name": "Benessere Mentale",
      "challenge_description": "Quando si tratta di salute mentale, la cura di sé può aiutarti a gestire lo stress, ridurre il rischio di malattie e aumentare la tua energia. Anche piccoli atti di cura di sé nella vita quotidiana possono avere un grande impatto. ",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
      "challenges": [
        "Gestire l'ansia",
        "Prima di andare a dormire, scrivi 3 cose che hai apprezzato della giornata",
        "Praticare l'autocommiserazione",
        "Pratica la consapevolezza. Riporta te stesso al presente",
        "Trascorri del tempo in un hobby. Migliora il tuo umore e impegnati in un'attività che ti piace",
        "Prenditi una pausa dai social media per la giornata e concentrati sulla vita che ti circonda",
        "Pianta qualcosa. Prendersi cura di qualcosa di diverso da te stesso ha molti benefici mentali.",
        "Pensa alle parti migliori della tua vita mentre aspetti qualcosa",
        "Impara come parlare del benessere mentale ai tuoi genitori, educatori, amici, familiari e altri a te vicini.",
        "Apri qualcosa nella tua mente",
        "Concentrati sul riposo e sul relax oggi e vai a letto presto",
        "Fai una passeggiata senza guardare il telefono, concentrati su ciò che ti circonda",
        "Immagina un posto felice ogni volta che ti senti ansioso",
        "Leggi o guarda qualcosa che fa bene alla tua salute mentale",
        "Immagina la vita dei tuoi sogni e scrivi quali passaggi devi parlare per arrivarci",
        "Esercitati a parlare di te stesso in modo positivo",
        "Rinnova la tua motivazione",
        "Inizia ad esplorare la radice di tutti i pensieri negativi",
        "Scrivi 5 cose per cui sei grato",
        "Praticare la cura di sé e coccolarsi",
        "Scrivi affermazioni positive e leggile prima di dormire",
        "Fai 3 respiri profondi ogni volta che puoi",
        "Pianifica un pasto sano",
        "Fai un ringraziamento a qualcuno che apprezzi.",
        "Chiama qualcuno che ami con cui non parli da un po'",
        "Prova una meditazione guidata",
        "Impara una nuova abilità per spostare i tuoi pensieri lontano da problemi e ansia",
        "Scrivi un diario di tutto ciò che ti passa per la mente",
        "Mangia un pasto nutriente.",
        "Canta la tua canzone preferita. Cantare aiuta a regolare la respirazione e a ridurre l'ansia"
      ]
    },
    {
      "challenge_name": "Correggi il tuo programma di sonno",
      "challenge_description": "Queste sfide quotidiane hanno lo scopo di aiutarti ad adottare una sana routine della buonanotte, a dormire abbastanzap, e svegliarsi riposati ogni mattina.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
      "challenges": [
        "Metti via il telefono così la mattina dopo devi alzarti dal letto per spegnere la sveglia",
        "Spegni tutti gli schermi 1 ora prima di andare a letto per preparare il cervello a dormire",
        "Preparati con una gustosa colazione per avere più motivazione per svegliarti presto",
        "La doccia di notte, una doccia calda o un bagno ti aiuteranno a rilassarti prima di andare a letto",
        "Cerca di svegliarti tutti i giorni alla stessa ora, la coerenza è la chiave",
        "Dopo cena, indossa il tuo comodo pigiama, diario, leggi un angolo e preparati a rilassarti e lasciare che la tua mente si distenda",
        "Bevi molta acqua dopo esserti svegliato, non ti sentirai troppo stanco per tutto il giorno",
        "Cerca di cenare presto, dato che digerirai il cibo prima, il tuo corpo può concentrarsi sul sonno riposante di cui ha bisogno",
        "Fai un veloce allenamento/corsa mattutina, questo ti aiuterà a sentirti pieno di energia durante il giorno e assonnato quando dovresti andare a letto",
        "Medita prima di andare a letto, è rilassante e riduce lo stress",
        "Apri le finestre quando ti svegli e lascia che i raggi del sole ti tocchino la pelle",
        "Pianifica in anticipo le tue attività stasera e anche la tua lista di cose da fare per la mattina successiva",
        "Ascolta la tua playlist preferita dopo il risveglio per metterti di buon umore",
        "Imposta un promemoria che ti avviserà 30 minuti prima dell'ora di andare a letto",
        "Spendi energia durante il giorno così ti stanchi di notte",
        "Smetti di bere acqua 1 ora prima di andare a letto, così non devi svegliarti durante la notte o alzarti mentre stai cercando di addormentarti",
        "Rifai il letto dopo esserti svegliato così non sarai tentato di tornare a dormire di nuovo",
        "Ascolta la musica leggera prima di coricarti, questo ti aiuterà a dormire presto",
        "Dopo esserti svegliato vai dritto in bagno per lavarti il ​​viso o farti una bella doccia",
        "Mangia cibi con magnesio (come mandorle, arachidi e semi di zucca) e zinco per migliorare la qualità del sonno",
        "Respira aria fresca quando ti svegli. Aggiorna i tuoi pensieri che aiutano il tuo cervello a liberarsi al mattino",
        "Usa il tuo letto esclusivamente per dormire e fare sesso. Non guardare la TV.",
        "Niente caffeina 6 ore prima dell'orario di sonno prescelto",
        "Evita di mangiare pasti abbondanti prima di dormire",
        "Rendi la tua stanza il più buia e silenziosa possibile",
        "Evita i sonnellini. Può interrompere il ciclo del sonno",
        "Stabilire una temperatura fresca e costante",
        "Vai a letto solo quando hai sonno",
        "Evita conversazioni difficili prima di andare a dormire",
        "Lava o cambia lenzuola e federe"
      ]
    },
    {
      "challenge_name": "Cura di sé",
      "challenge_description": "La cura di sé significa prendersi il tempo necessario per fare cose che ti aiutano a vivere bene ea migliorare sia la tua salute fisica che quella mentale.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
      "challenges": [
        "Pianifica la tua giornata e attieniti ad essa",
        "Scrivi un diario, registra le tue emozioni ed esperienze",
        "Pratica un hobby che ti piace davvero",
        "Leggi un libro preferito di quando eri bambino",
        "Esercizi a casa. Cerca video di allenamento su Youtube",
        "Prova a cucinare qualcosa di nuovo",
        "Condividi qualcosa a cui stai pensando con i tuoi genitori o amici",
        "Crea routine mattutina",
        "Chiama la tua famiglia e i tuoi amici",
        "Risolvi un puzzle game",
        "Fai delle opere d'arte. Puoi trovare idee su internet",
        "Ascolta le tue canzoni preferite",
        "Giocare a giochi da tavolo",
        "Scrivi una lettera a qualcuno di speciale",
        "Fai un corso online per imparare qualcosa di nuovo",
        "Guarda un nuovo film",
        "Fai un pisolino potente per riposare la mente e il corpo",
        "Ascolta alcuni dei podcast",
        "Medita per calmare la mente e liberarti dall'ansia",
        "Fai un bagno rilassante",
        "Definisci i tuoi obiettivi per il futuro",
        "Canta insieme alla tua canzone preferita",
        "Chatta video con qualcuno a cui tieni",
        "Stabilire una routine del sonno",
        "Nessuna lamentela",
        "Trova sempre il tempo per pregare.",
        "Dì 'No' alla negatività",
        "Pulisci e organizza il tuo posto",
        "Imposta un obiettivo per la prossima settimana",
        "Chiedi aiuto se ne hai bisogno"
      ]
    },
    {
      "challenge_name": "Studio efficace",
      "challenge_description": "Imparare come avere successo con il tuo studio. Stabilisci obiettivi efficaci e chiari per ottenere voti più alti, impara a gestireil tuo tempo e migliora le tue capacità di studio.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
      "challenges": [
        "Organizza e pulisci la tua scrivania per studiare",
        "Pianificare una sessione di studio e preparare i materiali di studio",
        "Supera le tue debolezze e trova il tuo obiettivo di studio e motivazione",
        "Studia il tuo programma e inizia ad essere attivo nel tuo corso",
        "Organizza sempre il tuo programma e prendi appunti",
        "Scrivi a mano i tuoi appunti ed evidenzia le parole chiave",
        "Regola 50-10. Studia 50 minuti ogni ora. Passa 10 minuti a pulire la tua mente",
        "Rivedi i tuoi appunti prima di dormire",
        "Imposta un timer e concentrati esclusivamente su una singola attività",
        "Studi come se stessi insegnando a qualcuno",
        "Promettiti una ricompensa se completi tutti i compiti",
        "Usa colori ed evidenziatori nelle tue note",
        "Usa solo Google e Youtube per comprendere i concetti",
        "Mangia sano. Il tuo corpo si sentirà meglio e tu sarai più vigile",
        "Riassumere concetti",
        "Studi con il tuo amico. Chiedi al tuo amico di interrogarti su argomenti difficili",
        "Rivedi cosa hai imparato oggi o questa settimana",
        "Usa app o schede flash per un migliore apprendimento",
        "Dai la priorità alle tue attività. Completa prima le attività principali",
        "Usa la mappa mentale per organizzare le informazioni",
        "Scegli un luogo di studio tranquillo e senza distrazioni",
        "Non dimenticare di ridurre lo stress. Mantieni il livello di stress basso e preoccuparti meno",
        "Rivedi i tuoi appunti prima di iniziare i compiti",
        "Ristudia i problemi con i compiti, copri le risposte e interroga te stesso",
        "Fai un elenco di concetti o formule importanti",
        "Fai il tuo finto esame",
        "Studi come se l'esame a sorpresa fosse domani.",
        "Dormi a sufficienza perché aiuta notevolmente a trattenere la memoria",
        "Cerca le tecniche di memoria che si adattano efficacemente al tuo studio",
        "Non aver mai paura di chiedere aiuto"
      ]
    },
    {
      "challenge_name": "Relazione di coppia",
      "challenge_description": "Questa sfida relazionale è progettata per essere facilmente integrata nella tua vita quotidiana. Molte delle sfide dovrebbero richiedere solo pochi minuti e possono essere fatte in qualsiasi momento durante la giornata. Alcune richiedono un po' più di energia e pianificazione, ma ne varrà la pena.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
      "challenges": [
        "Fai una lista delle cose che ami del tuo partner",
        "Pianifica un appuntamento notturno a sorpresa",
        "Di' al tuo partner che lo ami incondizionatamente",
        "Condividi la paura che hai per la tua relazione",
        "Condividi un bel ricordo che hai del tuo partner",
        "Invia al tuo partner un romantico messaggio mattutino",
        "Ringrazia il tuo partner per qualcosa oggi",
        "Sorprendi il tuo partner con qualcosa di buono",
        "Condividi un obiettivo che hai per la tua relazione",
        "Fai un complimento al tuo partner",
        "Pianifica un weekend fuori porta",
        "Guarda insieme le vecchie foto",
        "Ricorda quando ti sei incontrato per la prima volta",
        "Fate insieme una lista di cose da fare",
        "Scegli una parola a caso e inizia una conversazione profonda con il tuo partner",
        "Fai un puzzle insieme",
        "Scrivi una lettera d'amore al tuo partner e nascondila per fargliela trovare in seguito",
        "Fai qualcosa che il tuo partner si diverte a fare insieme",
        "Fai una delizia preferita",
        "Dì al tuo partner qualcosa che ricordi che gli piace",
        "Dai al tuo partner un bacio e un abbraccio a sorpresa",
        "Fai un massaggio rilassante al tuo partner",
        "Fai colazione a letto per il tuo partner",
        "Giocate insieme a un gioco da tavolo",
        "Chiedigli come puoi essere un partner migliore",
        "Lascia a lui/lei una piccola nota dolce",
        "Fate una passeggiata insieme",
        "Fai un complimento al tuo partner oggi",
        "Fai un quiz sulla relazione",
        "Danza lenta su una canzone romantica"
      ]
    },
    {
      "challenge_name": "Declutter",
      "challenge_description": "Ridurre il disordine nelle nostre vite, sia esso fisico, digitale o altro, ci consente di affrontare i fattori di stress frontalmente e questo avvantaggia la nostra salute mentale.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
      "challenges": [
        "Pulisci il tuo armadio",
        "Organizza i tuoi libri",
        "Organizza la tua camera da letto",
        "Svuota il tuo comodino",
        "Ordina la tua posta",
        "Organizza la tua dispensa",
        "Dona vestiti inutilizzati",
        "Libera spazio sul tuo computer o laptop",
        "Pulisci il tuo frigorifero ed elimina gli articoli scaduti",
        "Cleuna tua macchina",
        "Sfoglia vecchie carte e posta",
        "Svuota il congelatore",
        "Pulisci il tuo portafoglio",
        "Organizza la tua cucina",
        "Svuota la scrivania o lo spazio di lavoro",
        "Sbarazzati dei vecchi vestiti",
        "Organizza i tuoi prodotti per la pulizia",
        "Organizza il tuo comò",
        "Rimuovi app che non usi più",
        "Ripulire gli armadietti dei medicinali",
        "Organizza tutto in cartelle sul tuo computer",
        "Organizza il tuo soggiorno",
        "Acquista oggetti di archiviazione funzionali",
        "Spurgare gli accessori personali",
        "Trascorri del tempo a pulire la tua auto/moto/bici",
        "Aggiorna e organizza il tuo calendario",
        "Cancella le piante morte e organizza i vasi",
        "Organizzare la merce secca (spezie) e ripulire la merce scaduta",
        "Organizzare ed etichettare i contenitori e gli scaffali",
        "Medita per pulire la tua mente"
      ]
    },
    {
      "challenge_name": "Produttività",
      "challenge_description": "Una buona produttività può aiutarti a fissare obiettivi migliori, essere più efficace, aumentare la concentrazione e aumentare la motivazione.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
      "challenges": [
        "Rifai il letto la mattina per non essere tentato di tornare a letto",
        "Scrivi 3 cose per cui sei grato ogni giorno",
        "Organizzare uno spazio disordinato per migliorare il posto di lavoro",
        "Trascorri meno tempo al telefono e sii più produttivo",
        "Utilizza un pianificatore giornaliero per realizzare tutto ciò che hai pianificato",
        "Disattiva le notifiche non necessarie sul telefono per evitare distrazioni",
        "Crea un piano alimentare per l'intera settimana",
        "Fai una lista di cose da fare e prova a completare tutte le attività",
        "Fai una passeggiata di 30 minuti per prendere una boccata d'aria fresca e sentirti motivato a conquistare il mondo",
        "Casella di posta elettronica Declutter. A volte può essere un po' opprimente",
        "Esercitati per 30 minuti anche se non fai nulla durante il giorno, ti sentirai super produttivo dopo l'allenamento",
        "Leggi il capitolo di un libro prima di andare a letto per dimenticare i social media",
        "Evita di guardare la TV per avere più tempo per te stesso",
        "Organizza il tuo armadio e dona le cose che non vuoi più",
        "Crea una playlist musicale con le tue canzoni preferite e la linea di ballo che nessuno ti sta guardando",
        "Non controllare il telefono subito dopo esserti svegliato e avere una mattinata lenta e tranquilla",
        "Medita per 10 minuti e ti sentirai ringiovanito",
        "Organizza la tua dispensa e il tuo frigorifero.",
        "Pulisci a fondo la tua stanza. Spazio libero, mente chiara",
        "Cancella le persone che non ti danno più gioia. Ti sentirai molto più sollevato",
        "Pianifica un periodo di riposo durante la giornata per avere un po' di tempo per rilassarti",
        "Svegliati prima del normale. Le persone di successo iniziano la giornata presto.",
        "Leggere libri motivazionali e di ispirazione ti aiutano a ritrovare la fiducia in te stesso",
        "Smetti di provare a fare più attività",
        "Fai una lista di cose che vuoi smettere di fare",
        "Muoviti. Cammina. Allungati. Siediti dritto",
        "Scrivi le idee che ti vengono in mente, ma non iniziare a lavorarci. Pianificale",
        "Goditi una sana colazione per avere l'energia per essere più produttivo tutto il giorno",
        "Quando finisci qualcosa, non importa quanto piccolo, scrivilo",
        "Delega. Non devi fare tutto"
      ]
    },
    {
      "challenge_name": "Felicità",
      "challenge_description": "Gli studi scientifici dimostrano che la felicità è associata a una serie di vantaggi, tra cui una maggiore produttività, una maggiore creatività e una maggiore resilienza di fronte allo stress.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
      "challenges": [
        "Scrivi le cose che ami di te stesso",
        "Sorridi a tutti quelli che incontri",
        "Fai qualche esercizio",
        "Prepara la cena",
        "Abbraccia qualcuno che ami",
        "Guarda un film comico",
        "Chiama un amico",
        "Balla come se nessuno stesse guardando",
        "Esci nella natura e sii un esploratore per un giorno",
        "Compra un regalo per qualcuno che ami",
        "Prova a fare yoga",
        "Andate a dormire presto e svegliatevi presto anche voi",
        "Leggi qualcosa di stimolante",
        "Medita per 10 minuti",
        "Pianifica una vacanza futura",
        "Prova una nuova ricetta o cucina il tuo piatto preferito",
        "Guarda il bel tramonto",
        "Connettiti con il tuo vecchio amico",
        "Perdona qualcuno",
        "Prova qualcosa di nuovo",
        "Vai fo una passeggiata fuori",
        "Ascolta la tua canzone preferita",
        "Fai un piccolo atto di gentilezza o aiuta un amico o un vicino",
        "Condividi una risata con qualcuno",
        "Abbraccia i tuoi figli/genitori/amici/fratelli",
        "Gioca con il tuo cane o altri animali domestici",
        "Trascorri meno tempo al telefono",
        "Dì alle persone quanto significano per te",
        "Lascia andare le persone tossiche e l'abitudine",
        "Riflessi sul tuo viaggio dal primo giorno"
      ]
    },
    {
      "challenge_name": "Sfida per la libertà finanziaria",
      "challenge_description": "Uno dei vantaggi più importanti dell'indipendenza finanziaria è che ti dà un maggiore controllo sulla tua vita.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
      "challenges": [
        "Definisci i tuoi obiettivi finanziari",
        "Crea il budget del prossimo mese",
        "Sviluppare un fondo di emergenza",
        "Scopri siti web e blog finanziari",
        "Risparmia per la pensione",
        "Trova vlog di alfabetizzazione finanziaria su Youtube",
        "Adotta il minimalismo",
        "Compra un libro di soldi e inizia a leggerlo",
        "Considera la tua carriera",
        "Automatizza i tuoi soldi",
        "Controlla il tuo punteggio di credito",
        "Fai un budget per i tuoi soldi",
        "Trova modi per ridurre il conto della spesa",
        "Impara a calcolare la percentuale",
        "Esplora modi per fare entrate aggiuntive",
        "Vendi ciò che non ti serve/usa",
        "Leggi di più sugli investimenti",
        "Trovare una strategia per prevenire la spesa emotiva",
        "Giornata da spendere meno",
        "Scrivi un piano di risparmio per acquisti futuri",
        "Cerca il modo di ridurre le bollette",
        "Leggi sulla gestione del denaro",
        "Impara i termini finanziari di base",
        "Scopri come funzionano le carte di credito",
        "Scrivi un piano per ripagare il debito",
        "Trova modi per ridurre al minimo le tue spese non essenziali",
        "Automatizza le tue bollette",
        "Celebra i tuoi progressi",
        "Iscriviti al corso di alfabetizzazione finanziaria",
        "Rimani sulla strada della libertà finanziaria"
      ]
    },
    {
      "challenge_name": "Genitorialità positiva",
      "challenge_description": "La pratica della genitorialità positiva è una guida essenziale tra genitori e figli per avere risultati positivi sullo sviluppo come autostima, fiducia, autocompetenza, legame più forte tra genitori e figli e un flusso di comunicazione migliore ed efficace.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
      "challenges": [
        "Fai qualcosa con tuo figlio che sai che ama",
        "Chiedi a tuo figlio quali sono i suoi preferiti",
        "Fai lavori con i bambini come la nostra farfalla con piatti di carta",
        "Trascorri almeno 30 minuti uno contro uno con tuo figlio",
        "Leggi la favola della buonanotte",
        "Fate una passeggiata insieme",
        "Abbraccia tuo figlio quattro volte oggi",
        "Cucina qualcosa per tuo figlio che gli piace",
        "Scatta alcune foto insieme o crea anche un photobooth fai-da-te",
        "Chiedi a tuo figlio quale cosa speciale vorrebbe fare",
        "Portali nel loro posto preferito",
        "Fai insieme una 'scatola felice'",
        "Scrivete una storia insieme. Fate disegnare a vostro figlio delle immagini",
        "Fai impronte di mani insieme",
        "Insegna a tuo figlio come fare qualcosa di nuovo oggi",
        "Insegna a tuo figlio i soldi",
        "Metti un po' di musica e balla insieme",
        "Fai un gioco da tavolo per famiglie",
        "Fai loro un piccolo regalo e nascondilo in casa perché lo trovino",
        "Cuocere i muffin o cuocere i pancake e portarli da un vicino",
        "Fate insieme un biglietto per l'altro genitore",
        "Parlare cose positive su tuo figlio oggi",
        "Chiedi loro cosa pensano",
        "Chiedi al loro animale preferito e realizza insieme un progetto divertente",
        "Insegna a tuo figlio un'abilità nella vita",
        "Fai una passeggiata nella natura. Raccogli gli oggetti da un elenco",
        "Fai una giornata a colori. Vestiti con il colore, mangia cibi che colorano.",
        "Fai un mestiere divertente per i nonni",
        "Gioca con la pasta da gioco insieme. Fai delle gare di modellatura",
        "Chiedi a tuo figlio il suo ricordo preferito. Pianifica di farlo di nuovo"
      ]
    },
    {
      "challenge_name": "Superare la depressione",
      "challenge_description": "Questa sfida ti guida a superare la depressione e ti ricorda che c'è una grande speranza di guarigione. La depressione è altamente curabile. Molte persone che soffrono di depressione si riprenderanno completamente. Altri trovano un certo livello di sollievo dai loro sintomi. La lotta è ne vale la pena – la capacità di prosperare nella vitadopo che la depressione è lì.",
      "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
      "challenges": [
        "Il tocco è molto importante nella cura della depressione. Accarezza gli animali domestici, abbraccia amici e familiari, riprendi il sesso con il tuo partner o fai un massaggio.",
        "Esci fuori per 15 minuti di attività fisica. Prova a correre. Pulisci il cortile. Fai una passeggiata con il tuo animale domestico.",
        "La dieta può svolgere un ruolo enorme nell'aiutare ad alleviare la depressione. Assicurati di mangiare bene e regolarmente, anche se non hai appetito",
        "Dormire a sufficienza",
        "Sorridi e cambia la tua postura per cambiare come ti senti.",
        "Leggi esempi positivi di come le persone hanno superato i problemi di salute mentale e sappi che è possibile anche per te.",
        "Dimentica il futuro e il passato. Chiediti 'In questo momento, proprio qui in questo preciso momento cosa c'è che non va?'",
        "Integra le tue vitamine per aumentare gli ormoni della felicità. Anche la mancanza di vitamina B3 e vitamina D, che viene prodotta nella pelle dalla luce solare, è stata collegata alla depressione",
        "Ascolta la tua voce interiore. È duro o critico? Tratteresti gli altri con lo stesso giudizio? Questi pensieri sono costruttivi o distruttivi?",
        "Assicurati di uscire ogni giorno poiché la luce del giorno e la luce solare aumentano la serotonina ed è necessaria per la vitamina D",
        "Non vergognarti. Potresti essere sorpreso di sapere quante persone soffrono di depressione in silenzio. Parla con la tua famiglia e i tuoi amici.",
        "Interrompi le relazioni abusive",
        "Trascorri del tempo con il tuo animale domestico",
        "Sei più forte della tua depressione",
        "Ascolta musica tutti i giorni",
        "Fai cose che una volta ti rendevano felice anche se non ne hai voglia",
        "Evita l'isolamento",
        "La risata è un importante antidoto alla depressione.",
        "Fa quello che ami",
        "Evitare alcol e droghe",
        "Trovare un'opportunità di volontariato come un modo per sentirsi meno soli",
        "Sapere quando impegnarsi o disimpegnarsi dal mondo online",
        "Trova qualcosa a cui guardare con impazienza",
        "Fai il contrario di ciò che suggerisce la 'voce della depressione'",
        "Trovare piccoli modi per essere al servizio degli altri",
        "Non soffermarti sui problemi. Concentrati invece sulla soluzione giusta",
        "Avere obiettivi realizzabili per darti un senso di realizzazione",
        "Sii grato e nota 3 cose buone ogni giorno",
        "Chiedi a una persona cara di fare il check-in con te regolarmente.",
        "Sfida i pensieri negativi"
      ]
    }
  ]
}