{
    "all_challenges": [
        {
            "challenge_name": "Herausforderung Angst bewältigen",
            "challenge_description": "Sorgen Sie sich weniger und genießen Sie das Leben mehr mit unserer bewährten Herausforderung. Sagen Sie Ja, um sich selbst herauszufordern, und Sie werden sich in einem Monat besser fühlen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Kümmere dich um deine Schlafroutine.",
                "Es ist in Ordnung, um Hilfe zu bitten.",
                "Erkenne deine Gefühle an.",
                "Bete und bitte um Gottes Führung.",
                "Schreibe deine Gefühle auf.",
                "Visualisieren Sie etwas Inspirierendes.",
                "Stoppt negative Denkmuster.",
                "Finde das Positive im Leben.",
                "Habe Selbstmitgefühl für dich und deine Angst.",
                "Untersuchen Sie die Wurzel aller negativen Gedanken.",
                "Sammle deinen Mut, dich etwas zu stellen, das du vermeidest.",
                "Es ist in Ordnung, Angst zu haben. Erkenne die Symptome und lerne, sie zu kontrollieren.",
                "Liste Dinge auf, die du wegen deiner Angst vermeidest. Teile es",
                "Stärken Sie eine Ihrer Bewältigungsfähigkeiten, indem Sie etwas recherchieren",
                "Mach auf Youtube eine Yoga-Routine speziell gegen Angstzustände",
                "Lesen Sie etwas, das Ihrer psychischen Gesundheit gut tut",
                "Repariere etwas, das durch deine Angst beschädigt wurde",
                "Geh irgendwohin, wo du dich entspannst und Ängste abbaust",
                "Essen Sie heute so, wie es Körper, Geist und Seele gut tut",
                "Tue etwas, das dir hilft, neue Energie zu tanken, wo du dich ausgelaugt fühlst",
                "Verbringen Sie 20 Minuten damit, den Geräuschen der Natur zu lauschen",
                "Stellen Sie sicher, dass Ihre Social-Media-Feeds angstfrei sind",
                "Arbeite an deiner Selbstsprache, keine gemeinen Worte an dich selbst",
                "Machen Sie einen Ganzkörperscan. Wo halten Sie Ihre Angst",
                "Konzentrieren Sie sich auf Schlaf und Ruhe und eine gesunde Schlafenszeit",
                "Ändere eine Sache an deinem Tag, die deine Angst lindern wird",
                "Achtsamkeit üben",
                "Scrollen Sie durch die Kamerarolle Ihres Telefons. Wenn Sie ein Bild finden, das Sie zum Lächeln bringt, teilen Sie es mit allen anderen darauf.",
                "Wenden Sie sich an jemanden, von dem Sie glauben, dass er auch mit Angst zu kämpfen hat. Nur darüber zu reden, kann Ihnen beiden helfen",
                "Überprüfen Sie Ihr Ziel von Tag 1. Wie sind Ihre Fortschritte?"
            ]
        },
        {
            "challenge_name": "Fühle mich wunderbar",
            "challenge_description": "Verbringen Sie Ihre Zeit, in der Sie sich ein bisschen großartiger und wunderbarer fühlen, indem Sie diese affektive Herausforderung annehmen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Denken Sie an die erstaunlichen Dinge, die Sie dieses Jahr bereits getan haben.",
                "Konzentrieren Sie sich darauf, positiv zu sein",
                "Erstellen Sie eine Liste mit Dingen, die Sie glücklich machen.",
                "Iss deine Lieblingssnacks aus der Kindheit.",
                "Tanz um dein Haus herum.",
                "Versuchen Sie 8 Gläser Wasser zu trinken.",
                "Schau dir deinen Lieblingsfilm an.",
                "Geben Sie Ihrem Schlafzimmer/Arbeitsplatz ein neues Gesicht",
                "Beobachten Sie den Sonnenuntergang/Sonnenaufgang, während Sie Ihre Lieblingslieder hören",
                "Machen Sie eine gesunde Mahlzeit",
                "Kaufen Sie etwas, das Sie wirklich wollen (Schokolade, Blume…)",
                "Tu jemandem etwas Gutes",
                "Erstellen Sie Ihre eigene Playlist mit Songs, die Ihnen Freude bereiten",
                "Sternenhimmel wann immer du kannst",
                "Bestellen Sie Ihr Lieblingsessen und lassen Sie sich verwöhnen",
                "Spazieren gehen",
                "Machen Sie Ihr Lieblingsgetränk zu Hause",
                "Hören Sie sich einen Podcast über etwas an, das Sie interessiert",
                "Setze ein Puzzle zusammen",
                "Schauen Sie sich einen Film aus Ihrer Kindheit an",
                "Pizza/Lieblingsgericht selber machen",
                "Senden Sie jemandem eine 'Danke'-Nachricht über Messenger/WhatsApp",
                "Tragen Sie heute Ihre Lieblingssachen.",
                "Lerne ein neues Wort",
                "Menüplan für die Woche erstellen",
                "Häng mit deinen Kindern/Geschwistern ab",
                "Machen Sie heute 3 Personen Komplimente",
                "Endlich das unvollendete Projekt beenden",
                "Keine Süßigkeiten, Limonade oder Fast Food heute",
                "Planen Sie einen unterhaltsamen Tag mit Ihrer Familie"
            ]
        },
        {
            "challenge_name": "Intentional Living",
            "challenge_description": "Wenn Sie sich dieser täglichen kleinen Herausforderung stellen, wird Ihr Leben zur besten Version Ihrer selbst werden",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Bete, wenn du heute aufwachst. Danke Gott für einen brandneuen Tag voller Möglichkeiten.",
                "Setze dir eine Absicht oder nur 3 Ziele für den Tag",
                "Sei absichtlich mit den Worten, die du über dich selbst und andere sprichst",
                "Schreibe eine Dankbarkeitsliste, versuche diese jeden Morgen/Abend einzubauen",
                "Halten Sie sich mindestens 1 Stunde vor dem Schlafengehen von Bildschirmen fern",
                "Kochen Sie etwas, das Sie lieben, und essen Sie Ihre Mahlzeit achtsam ohne Ablenkung",
                "Machen Sie eine Selbstpflegesitzung, nehmen Sie ein Bad, tragen Sie eine Gesichtsmaske auf und genießen Sie jede Sekunde des Prozesses",
                "Führen Sie ein 20-minütiges Tagebuch über Ihre Erfahrungen in diesem Monat",
                "Lassen Sie Ihr Telefon weg, während Sie essen",
                "Belohnen Sie sich, wenn Sie Ihre Aufgaben erledigt haben. Es kann so einfach sein, sich einfach Zeit zu nehmen, etwas zu tun, das Ihnen wirklich Spaß macht",
                "Schau in den Spiegel und sag dir, dass du schön bist und zu allem fähig bist",
                "Machen Sie eine 15-minütige Yoga-/Meditationssitzung",
                "Hören Sie aufmunternde Musik. Entscheiden Sie sich für Songs in Ihrer Playlist, die Ihre Emotionen gut halten",
                "Drücken Sie heute Ihre Kreativität aus. Zeichnen, malen, schreiben, tanzen, einfach etwas tun",
                "Gehen Sie in der Natur spazieren",
                "Treffen Sie eine bewusste Entscheidung, Social Media klug und achtsam zu nutzen. Setzen Sie Grenzen und wählen Sie die Inhalte aus, die sich positiv auf Ihr Wohlbefinden auswirken",
                "Nehmen Sie sich 10 Minuten Zeit, um all die Dinge aufzuschreiben, die Sie gerne tun würden, und planen Sie, mindestens eine davon nächsten Monat zu erledigen",
                "Entfolgen Sie Instagram-Konten, die Ihnen nicht mehr gefallen",
                "Gönnen Sie sich ein paar Minuten Zeit, um einfach nur zu sitzen und zu atmen. Seien Sie einfach im Moment",
                "Gönnen Sie sich ein Stück Himmel. Gehen Sie in Ihre Lieblingskonditorei, kaufen Sie Ihre Lieblingskonditorei, setzen Sie sich an einen ruhigen Ort und genießen Sie jeden Bissen",
                "Achten Sie auf Ihre geistige Gesundheit. Seien Sie zielgerichtet und achten Sie auf Ihre Emotionen und Ihren Geisteszustand. Scheuen Sie sich nicht, um Hilfe zu bitten, wenn Sie sie brauchen",
                "Essen und genießen Sie Ihre Mahlzeiten heute ohne Telefon oder Bildschirm",
                "Verbinden Sie sich wieder mit jemandem. Machen Sie einen Plan mit einem Freund über Messenger, Facetime, WhatApp oder treffen Sie sich, um sich zu treffen",
                "Hören Sie sich eine Motivationsrede auf Youtube an",
                "Schauen Sie sich den Habitualize-Blog an",
                "Verzehre heute 3 verschiedene Obstsorten",
                "Schreibe 3 Dinge auf, die du morgen erledigen musst",
                "Mach ein intuitives Gehen",
                "Schreibe ein Tagebuch für 10 Minuten oder länger",
                "Träume groß. Setze dir Absichten. Erstelle ein Vision Board"
            ]
        },
        {
            "challenge_name": "Neue Sprache lernen",
            "challenge_description": "Das Lernen einer neuen Sprache ist eine Herausforderung, aber es kann auch Spaß machen, einfach und mühelos sein. Wenn Sie der 30-tägigen Sprachlern-Challenge folgen, können Sie Ihr Sprachenlernen jeden Tag aufs Neue steigern.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Lerne 5 neue Wörter",
                "Probieren Sie eine neue Sprach-App aus",
                "Sehen Sie sich einen Film in der Sprache an, die Sie lernen, mit Untertiteln",
                "Einkaufs-/Aufgabenlisten in Ihrer Zielsprache schreiben",
                "Bring jemandem ein paar Wörter und Sätze bei",
                "Frag 'Wie geht es dir?' zu einem Freund",
                "Sehen Sie sich ein Tutorial für etwas in der Sprache an",
                "Schreiben Sie heute über Ihre Erfahrungen",
                "Erzähle etwas, was du tust",
                "Sehen Sie sich ein Youtube-Video-Tutorial über die Sprache an",
                "Bring jemandem 5 neue Wörter bei",
                "Grundlegende Grammatik lernen",
                "Zeitschrift in Ihrer Zielsprache",
                "Lesen Sie einen Nachrichtenartikel",
                "Sprechen Sie mit einer Person oder Ihrem Haustier",
                "Ändern Sie Ihre Telefoneinstellung für einen Tag",
                "Rezension für ein Buch/einen Film schreiben",
                "Lesen Sie etwas",
                "Nehmen Sie sich beim Üben der Sprache auf",
                "Schreiben Sie 40 Wörter, die Sie gelernt haben",
                "Schreiben Sie, wie Ihnen diese Herausforderung geholfen hat",
                "Können Sie sich noch an die Wörter erinnern, die Sie an Tag 1 gelernt haben?",
                "Beantworten Sie ein Online-Quiz zur Zielsprache",
                "Bring einem Familienmitglied 7-10 neue Wörter bei",
                "Schreiben Sie 50 Wörter, die Sie gelernt haben",
                "Schreib etwas über deinen Tag",
                "Hören Sie sich ein Lied in der Sprache an",
                "Schreibe eine Geschichte",
                "Podcast hören",
                "Erstellen Sie Karteikarten, um sich Wörter leicht zu merken"
            ]
        },
        {
            "challenge_name": "Achtsamkeitsherausforderung",
            "challenge_description": "Achtsamkeitsübungen helfen, Ihren Geist zurückzusetzen und eine klare Perspektive zu haben, wenn Sie unkonzentriert sind oder sich vom Leben überwältigt fühlen",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Bevor Sie heute eine Aufgabe erledigen, fragen Sie sich, warum Sie die Aufgabe erledigen, und denken Sie einen Moment darüber nach",
                "Achtsame Dusche. Visualisiere, wie du deine negativen Gedanken wegspülst und konzentriere dich auf das Gefühl des Wassers auf deiner Haut",
                "Schreiben Sie vor dem Schlafengehen 3 Dinge auf, die Sie an diesem Tag wirklich geschätzt haben",
                "Übe Dankbarkeit. Fange an, dich auf positive Gedanken zu konzentrieren und lasse deine ängstlichen, ängstlichen Gehirnmuster los",
                "Stellen Sie Ihre Haltung jedes Mal neu ein, wenn Sie sich hinsetzen, und strecken Sie sanft Ihren Rücken",
                "Bewege dich heute ein bisschen und konzentriere dich auf die körperlichen Empfindungen",
                "Üben Sie sich heute aktiv zuzuhören. Das bedeutet, sich auf das zu konzentrieren, was Ihr Gegenüber sagt, und darauf angemessen zu reagieren",
                "Machen Sie einen Bodyscan. Richten Sie Ihre Aufmerksamkeit auf Ihren Körper und schicken Sie den Atem zu allen Spannungsfeldern",
                "Finde einen friedlichen Ort, an dem du dich hinsetzen und schreiben kannst, was du gerade fühlst",
                "Seien Sie heute neugierig. Üben Sie sich darin, interessiert zu sein, was passiert, und lenken Sie Ihre Aufmerksamkeit darauf, mehr darüber zu erfahren",
                "Achten Sie auf Ihren Sinn, wenn Sie etwas schmecken, berühren, riechen und hören",
                "Achtsames Atmen. Einatmen, 3 Sekunden halten und dann ausatmen",
                "Geh achtsam. Nimm eine Haltung ein, um dich mit der Erde verbunden und fest im Boden verwurzelt zu fühlen",
                "Trinken Sie eine achtsame Tasse Tee. Konzentrieren Sie sich auf Geschmack, Geruch und Wärme",
                "Üben Sie wertfreies Zuhören, während Sie ein Gespräch führen",
                "Tue eine Sache nach der anderen und konzentriere dich nur darauf",
                "Sitzen Sie bequem, fühlen Sie Ihre Füße fest auf dem Boden, gerader Rücken und Hände auf Ihrem Schoß. Konzentrieren Sie sich eine Weile auf die Atmung",
                "Hören Sie sich selbst zu, wie Sie ans Telefon gehen oder während Sie ein Gespräch führen, wie Sie sprechen, welche Worte Sie wählen",
                "Schätze heute alles. Nimm alles wahr, was passiert, und finde einen Weg, es zu schätzen",
                "Beobachten Sie aufmerksam. Beschreiben Sie im Geiste ein Objekt im Detail, die Farbe, Textur, Form …",
                "Setz dich für eine Weile an einen gemütlichen und ruhigen Ort",
                "Erledige eine Aufgabe nach der anderen und konzentriere dich auf das, was du tust",
                "Übe Empathie gegenüber jemandem, der dich normalerweise aufregt",
                "Finde einen Artikel oder ein Video darüber, warum Fehler und Misserfolge gut für dich sind. Nimm es dir zu Herzen, damit du weniger Zeit damit verbringst, dich auf die Vergangenheit zu konzentrieren",
                "Essen Sie bewusst. Probieren Sie das Gericht und versuchen Sie zu erraten, wie viele Zutaten darin enthalten sind",
                "Schauen Sie sich um. Schauen Sie sich ein bestimmtes Blatt/einen Baum/eine Blume an und konzentrieren Sie Ihre Aufmerksamkeit",
                "Finde lustige Filme, erzähle lustige Witze, höre lustigen Leuten zu. Lache heute so viel wie möglich",
                "Nutzen Sie die Zeiten, in denen Sie warten müssen, und seien Sie achtsam, indem Sie sich auf Ihre Sinne und Ihren Atem konzentrieren",
                "Reinigen Sie heute Ihre Zähne mit Ihrer nicht dominanten Hand, um die Aufmerksamkeit zu fördern",
                "Schauen Sie immer in der Habitualizer App nach und seien Sie daran erinnert, jederzeit aufmerksam zu sein"
            ]
        },
        {
            "challenge_name": "Familienzeit",
            "challenge_description": "Familienzeit bietet viele Vorteile, darunter Vertrauensbildung, Schaffung einer stärkeren emotionalen Bindung zwischen Familienmitgliedern, Verbesserung der Kommunikationsfähigkeiten, bessere Leistungen in der Schule und weniger Verhaltensprobleme sowie die Möglichkeit, Erinnerungen zu schaffen, die auf Spaß aufbauen, Lachen und Zusammensein",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Bitten Sie Ihre Kinder, etwas zu erzählen, was sie heute getan haben oder vorhaben zu tun. Bieten Sie zuerst Ihre Pläne an",
                "Bringen Sie Ihren Kindern einen Kartentrick oder ein Kartenspiel bei oder spielen Sie eines, das Ihnen beiden Spaß macht",
                "Wählen Sie ein Wahrzeichen, eine Stadt oder ein Land, das Ihr Kind interessiert, und verbringen Sie Zeit damit, es über Youtube oder Facebook zu erkunden",
                "Machen Sie ein besonderes Abendessen. Stellen Sie frische Blumen auf den Tisch, zünden Sie Kerzen an und nehmen Sie sich einen Moment Zeit, um Ihre Dankbarkeit dafür auszudrücken, dass Sie eine Familie sind",
                "Machen Sie ein Familienfoto",
                "Geht in die Kirche und betet zusammen",
                "Familienfilm- und Pizzaabend",
                "Porträts voneinander zeichnen",
                "Gemeinsam Abendessen kochen",
                "Spielt zusammen 'Würdest du lieber'",
                "Gemeinsam puzzeln",
                "Backen Sie einen Kuchen oder Kekse für Ihre Familie",
                "Planen Sie ein Familienpicknick",
                "Spielen Sie zusammen Videospiele",
                "Gemeinsam Karaoke-Songs singen",
                "Gemeinsam nach dem Essen spazieren gehen",
                "Gemeinsam ein Brettspiel spielen",
                "Planen Sie eine Reise oder einen Urlaub",
                "Nehmen Sie sich eine besondere Zeit, um Ihrem Kind Witze zu erzählen. Lachen Sie auch über sein Kind",
                "Kochen Sie ein besonderes Abendessen für Ihre Familie",
                "Erstellen Sie eine Familien-Bucket-Liste",
                "Schauen Sie sich alte Familienfotos an oder schauen Sie sich alte Videos an",
                "Gemeinsam spazieren/wandern",
                "Gemeinsam einen Sonnenaufgang (oder Sonnenuntergang) beobachten",
                "Verbringen Sie 15 Minuten mit jedem Familienmitglied",
                "Besuchen Sie ein Naturzentrum und genießen Sie seine Schönheit",
                "Nehmen Sie an den außerschulischen Aktivitäten Ihres Kindes teil",
                "Ermutigen Sie Ihre Kinder zu ihren Hobbys",
                "Überraschen Sie Ihre Kinder mit einem Ausflug oder einer lustigen Aktivität",
                "Sag ihnen immer, wie sehr du sie liebst"
            ]
        },
        {
            "challenge_name": "Verlassen Sie Ihre Komfortzone",
            "challenge_description": "Die Umsetzung dieser Herausforderung führt Sie zu einer stärkeren Person, Sie gewinnen durch Erfahrungen an Selbstvertrauen, helfen Ihnen, Ihre persönliche Entwicklung fortzusetzen, und erhalten die Chance, neue Leute kennenzulernen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Steh 1 Stunde früher auf als sonst",
                "Sag Hallo!' zu einem zufälligen Fremden",
                "Gehen Sie 24 Stunden lang nicht in die sozialen Medien oder schauen Sie fern",
                "Geh auf jemanden bei der Arbeit zu und mache ihm ein ehrliches Kompliment",
                "Wenden Sie sich an jemanden, mit dem Sie lange nicht gesprochen haben",
                "Nehmen Sie einen anderen Weg, wenn Sie zur Arbeit/Schule gehen",
                "Führe ein schwieriges Gespräch mit jemandem über ein Thema, das du bisher gemieden hast",
                "Kaufen Sie etwas, das Sie nie im Supermarkt kaufen würden",
                "Fang an, eine neue Sprache zu lernen",
                "Geh auf Fremde zu, lächle und mache ihnen ein Kompliment",
                "Bitte um Hilfe, wenn du sie brauchst, oder hilf jemandem, ohne dass er dich fragt",
                "Machen Sie Pläne für das Wochenende oder für den freien Tag",
                "Probieren Sie ein neues Hobby/eine neue Sportart aus, die Sie schon immer wollten",
                "Ein Gespräch mit einem Fremden beginnen",
                "Versuchen Sie noch heute eine digitale Entgiftung",
                "Erstelle ein Vision Board (lass dich auf Pinterest inspirieren)",
                "Führen Sie sich zu einem Date aus",
                "Fragen Sie jemanden nach einem Date/machen Sie jemandem Komplimente, der Sie einschüchtert",
                "Starte einen Blog/YouTube-Kanal/Instagram-Seite/ein Buch, was immer dein Herz begehrt",
                "Gehen Sie woanders hin, um zu essen oder mitzunehmen",
                "Starte eine neue Herausforderung mit einem Freund (du kannst eine aus dieser App verwenden oder deine eigene erstellen)",
                "Probieren Sie ein neues Training aus (Zumba, Yoga, Pilates, Kickboxen usw.)",
                "Machen Sie jemandem ein spontanes Geschenk",
                "Melden Sie sich für etwas Neues an",
                "Nehmen Sie eine neue Route nach Hause/Arbeit/Schule",
                "Früher schlafen gehen als erwartet",
                "Einen neuen Ort bereisen",
                "Entwicklung einer neuen Fähigkeit",
                "Sende 5 Dankesbotschaften an 5 Personen",
                "Probieren Sie einen neuen Look aus"
            ]
        },
        {
            "challenge_name": "Inneren Frieden finden",
            "challenge_description": "Innerer Frieden beruhigt unseren Geist und lässt uns unseren Weg viel klarer sehen, was uns hilft, uns zu konzentrieren und unsere Ziele im Auge zu behalten.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Probieren Sie Aromatherapie aus. Düfte können lebendige und realistische Erinnerungen hervorrufen. Wenn wir etwas Gutes riechen, fühlen wir uns entspannt",
                "Planen Sie für morgen. Das verschafft Ihnen nicht nur mehr Zeit am Morgen, sondern macht Ihr Leben auch ruhiger und einfacher, sodass Sie Zeit haben, vorauszuplanen",
                "Bei unserem geschäftigen und abgelenkten Leben kann es leicht vergessen werden, Wertschätzung gegenüber den Menschen zu zeigen, mit denen wir jeden Tag zu tun haben. Nehmen Sie sich etwas Zeit, um Dankbarkeit für die Menschen um Sie herum zu zeigen",
                "Versuchen Sie etwas zu essen und konzentrieren Sie sich auf Ihre fünf Sinne. Konzentrieren Sie sich wirklich auf jeden Sinn, Geschmack, Geruch, Berührung und Anblick.",
                "Räumen Sie einen Raum in Ihrem Zuhause auf. Dies ist ein Weg, um emotionale Blockaden und innere Verwirrung zu heilen. Schaffen Sie eine ruhige, friedliche Umgebung",
                "Lächle in den Spiegel. Das mag lächerlich erscheinen, aber es hat viele Vorteile für dein Wohlbefinden. Es verlangsamt das Herz, entspannt den Körper und setzt Hormone frei, um Stress entgegenzuwirken",
                "Atme tief durch und schließe deine Augen. Liste im Geiste 5 Dinge auf, für die du dankbar warst. Das kann deine Gedanken von negativ zu positiv verschieben",
                "Stellen Sie einen Timer auf 60 Sekunden und konzentrieren Sie sich ausschließlich auf Ihre Atmung. Nehmen Sie wahr, wie es klingt und wie sich Ihr Körper anfühlt",
                "Nehmen Sie ein achtsames Bad. Nehmen Sie sich eine Auszeit, schalten Sie das Licht aus. Lassen Sie das Wasser über Ihren Körper fließen und konzentrieren Sie sich auf die Empfindungen und die Wärme, die Sie spüren",
                "Schaffen Sie ein Tee- oder Kaffeeritual. Alles, was Sie wirklich tun müssen, ist langsamer zu werden. Achten Sie darauf, was Sie tun, und genießen Sie den Geschmack",
                "Wenn Ihr Körper den ganzen Tag angespannt ist, nehmen Sie sich einen Moment Zeit, um sich zu entspannen. Atmen Sie tief ein, entspannen Sie Ihre Schultern und lockern Sie Ihren Kiefer",
                "Setze dir 3 tägliche Ziele. Das ist eine überschaubare Zahl und gibt dir die nötige Zeit und mentale Energie, um dich achtsam und gründlich darauf zu konzentrieren",
                "Probiere eine 4-Minuten-Meditation aus. Stelle einen 4-Minuten-Wecker auf deinem Handy ein, setze dich bequem hin, schließe deine Augen und atme natürlich. Wenn deine Gedanken zu wandern beginnen, bringe sie zurück zu deiner Atmung",
                "Umarme jemanden fest und atme dreimal tief durch. Das Atmen wird dich erden",
                "Machen Sie eine digitale Pause. Verlassen Sie sich nicht auf Ihre digitalen Geräte als Trostquelle. Diese erzeugen ein falsches Gefühl der Dringlichkeit und lassen uns auf den Beinen sein, als würde uns etwas fehlen",
                "Anstatt zu beurteilen, was jemand sagt, höre ihm aufmerksam zu und achte darauf, was gesagt wird",
                "Gehen ist sehr beruhigend für Körper, Geist und Seele. Beginnen Sie damit, einen geeigneten Ort zu finden. Beobachten Sie die Umgebung um Sie herum, halten Sie inne und konzentrieren Sie sich auf die Bäume, das Laub und den Boden, auf dem Sie gehen",
                "Konzentrieren Sie sich auf den Moment. Ein grundlegender Tipp ist, die Gegenwart nicht mehr mit der Vergangenheit zu vergleichen und sich auf das zu konzentrieren, was im Moment passiert. Es könnte so einfach sein, wie Ihre Aufmerksamkeit auf eine Aufgabe zu richten, die Sie gerade erledigen",
                "Steh auf und atme. Spüre deine Verbindung zur Erde",
                "Scannen Sie Ihren Körper und nehmen Sie physische Empfindungen oder Emotionen wahr. Entladen Sie alle unangenehmen Empfindungen, Emotionen oder Gefühle beim Ausatmen. Nehmen Sie alle angenehmen Gefühle wahr und füllen Sie sie mit dem Atem auf",
                "Richten Sie Ihre Aufmerksamkeit auf das, worüber Sie in der Gegenwart nachdenken. Sich Ihrer geistigen Aktivität bewusst zu sein, kann Ihnen helfen, eine Perspektive für Ihre Gedanken zu gewinnen",
                "Erkenne dich selbst und liebe dich selbst",
                "Halte dich aus negativen Dingen heraus",
                "Identifiziere und lass die Faktoren los, die deinen Frieden aufhalten",
                "Schließe deine Augen, wenn du wütend bist",
                "Hör auf, dich um andere zu kümmern, die an dich denken",
                "Frieden kommt durch ein sinnvolles Leben",
                "Beten Sie immer morgens nach dem Aufwachen und vor dem Schlafengehen",
                "Löse die Konflikte deines Lebens",
                "Einschränkungen akzeptieren, um Resilienz zu fördern"
            ]
        },
        {
            "challenge_name": "Nachtroutine",
            "challenge_description": "Die nächtlichen Routinen resultieren daraus, dass Sie genügend Stunden Schlaf bekommen, Sie werden einen schärferen Fokus und ein höheres Energieniveau für einen produktiven Tag am Morgen haben",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Denken Sie über den Tag nach. Schreiben Sie mindestens eine Sache auf, die ziemlich gut gelaufen ist",
                "Nehmen Sie sich einen Moment Zeit, um durch Gebet mit Gott zu kommunizieren. Öffnen Sie ihm Ihr Herz, lassen Sie alles los, was Ihnen in den Sinn kommt, und danken Sie ihm für alles, was während des Tages passiert ist. Dies ist eine großartige Möglichkeit, nicht nur Dankbarkeit zu üben, sondern auch zu bleiben mit Gott verbunden.",
                "Nehmen Sie sich einen Moment Zeit, um darüber nachzudenken, was Sie am nächsten Tag tun müssen, und planen Sie entsprechend.",
                "Nehmen Sie ein Papier und schreiben Sie auf, was Ihnen durch den Kopf geht. Das bedeutet nur, dass Sie schlafen gehen können, ohne sich Gedanken darüber machen zu müssen, was Sie morgen tun werden, weil es bereits aufgeschrieben ist",
                "Haben Sie eine gute Schlafumgebung. Halten Sie das Schlafzimmer auf einer guten Temperatur, verwenden Sie Verdunkelungsvorhänge oder eine Schlafmaske, um das Licht zu blockieren",
                "Tagebuch schreiben. Nehmen Sie sich Zeit zum Innehalten und Nachdenken",
                "Zünde ein paar Duftkerzen an und spiele eine entspannende Playlist",
                "Mach Dehnübungen/Yoga vor dem Schlafengehen",
                "Schreibe eine Dankbarkeitsliste",
                "Lesen Sie vor dem Schlafengehen ein gutes Buch. Hilft Ihnen, sich zu entspannen und besser zu schlafen.",
                "Plane deine Aufgaben für den nächsten Tag, Essen, Outfit, …",
                "Senden Sie jemandem, den Sie lieben, eine besondere Gute-Nacht-Nachricht",
                "Nehmen Sie eine schöne heiße Dusche oder ein Bad",
                "Verzichte mindestens 3 Stunden vor dem Schlafengehen auf Koffein, Alkohol oder Zucker",
                "Meditiere/bete. Sei einfach allein mit deinen Gedanken",
                "Räumen Sie Ihren Platz auf. Sie werden sich ruhiger und entspannter fühlen können",
                "Essen Sie vor dem Schlafengehen ein leichtes Abendessen",
                "Setze dir Vorsätze für morgen",
                "Vernebeln Sie einige ätherische Öle, um Ihre Schlafqualität zu verbessern",
                "Vermeide es, vor dem Schlafengehen E-Mails zu checken, Nachrichten zu lesen, zu lernen oder zu arbeiten",
                "Geh nicht hungrig ins Bett. Iss ein paar Mandeln, eine Banane oder Porridge, damit du besser schläfst",
                "Vermeiden Sie Ihr Telefon mindestens 1 Stunde vor dem Schlafengehen",
                "Trink etwas Kamillentee oder anderen Kräutertee (entkoffeiniert) vor dem Schlafengehen",
                "Nehmen Sie ein oder zwei Stunden vor dem Zubettgehen ein warmes Bad oder eine warme Dusche. Das kann Wunder bewirken, damit Sie sich rechtzeitig fürs Schlafen entspannen können",
                "Trinken Sie unbedingt Wasser, bevor Sie zu Bett gehen. Wir verlieren Feuchtigkeit, wenn wir schlafen. Es ist wichtig, gut zu hydrieren ",
                "Zähne putzen in 2 Minuten",
                "Denken Sie an Ihre letzten 24 Stunden und schreiben Sie mindestens eine Sache auf, die ziemlich gut gelaufen ist",
                "Schreiben Sie die obersten Prioritäten für morgen in einen Planer oder ein Notizbuch.",
                "Angst reduzieren mit einer To-Do-Liste",
                "Bete immer vor dem Schlafengehen und vergib dir selbst"
            ]
        },
        {
            "challenge_name": "Positive Bestätigung",
            "challenge_description": "Diese Herausforderung kann helfen, Ihr Selbstwertgefühl zu stärken, indem sie sowohl Ihre positive Meinung von sich selbst als auch Ihr Vertrauen in Ihre Fähigkeit, Ihre Ziele zu erreichen, stärkt. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Ich nehme die Möglichkeiten und Potenziale dieses Tages an",
                "Ich entscheide mich heute dafür, glücklich zu sein und mich selbst zu lieben",
                "Ich bin bereit, mich zu verändern und zu wachsen",
                "Ich nehme Erfahrungen außerhalb meiner Komfortzone an",
                "Ich bin talentiert und intelligent",
                "challenges bringen mir Möglichkeiten zu wachsen",
                "Ich vertraue meiner Intuition, mich zu leiten",
                "Ich bin verliebt in mich und meinen Körper",
                "Ich bin mit meiner Vergangenheit im Reinen",
                "Ich werde heute nett zu mir und anderen sein",
                "Ich wähle Glauben statt Angst",
                "Heute wird ein positiver Tag",
                "Ich bin dankbar für alles, was ich habe",
                "Ich bin mehr als meine negativen Gedanken",
                "Ich akzeptiere mich bedingungslos",
                "Ich bin gesund und glücklich",
                "Alles, was jetzt passiert, geschieht zu meinem höchsten Wohl",
                "Ich bin dafür verantwortlich, wie ich mich fühle und heute entscheide ich mich für das Glück",
                "Heute werde ich mich nicht mit den Fremden im Internet vergleichen",
                "Ich habe die Macht, Veränderungen zu schaffen",
                "Meine Gefühle und Gedanken sind gültig",
                "Ich habe Fülle und innere Stärke",
                "Ich bin bereit, die Dinge aus einer neuen Perspektive zu sehen",
                "Ich bin der Liebe und des Respekts würdig",
                "Mein Geist ist klar, stark und konzentriert",
                "Ich gehe mit Energie und Mut in den Tag",
                "Meine Träume inspirieren und motivieren mich",
                "Ich verdiene das Beste und akzeptiere es jetzt",
                "Ich bin einzigartig und selbstbewusst",
                "Ich sehe endlose Möglichkeiten in meinem Leben"
            ]
        },
        {
            "challenge_name": "Tägliches Journal",
            "challenge_description": "Journaling hilft, Ihre Symptome zu kontrollieren und Ihre Stimmung zu verbessern, indem es Ihnen hilft, Probleme, Ängste und Sorgen zu priorisieren. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Schreibe über jemanden, der dich inspiriert",
                "Schreibe ungefähr 5 Segnungen in deinem Leben auf",
                "Poste 30 Fakten über dich",
                "Worauf freust du dich?",
                "Welche 3 Lektionen sollen Ihre Kinder/Freunde/Geschwister von Ihnen lernen?",
                "Schreiben Sie über eine aktuelle Herausforderung",
                "Schreiben Sie Lösungen zu den Problemen",
                "Schreiben Sie auf, was Sie in Zukunft lernen möchten",
                "Liste auf, was du an deinen Eltern/Familie liebst",
                "Wie würde dein perfekter Tag aussehen?",
                "Schreiben Sie all die Dinge auf, die Sie dieses Jahr erreichen wollen",
                "Was brauchst du mehr in deinem Leben?",
                "Erstelle eine Liste mit Dingen, die du tun würdest, wenn du keine Angst hättest, und wie sie sich auf dein Leben auswirken würden",
                "Welchen Rat würdest du einem zehnjährigen geben?",
                "Wie kannst du morgen besser machen?",
                "Schreiben Sie über all die Dinge, die Sie nervös machen, und wie könnten Sie das ändern?",
                "Was hast du gestern gelernt?",
                "Schreiben Sie über einen vergangenen Kampf, den Sie überwunden haben. Wie hat er Sie stärker gemacht?",
                "Worauf freuen Sie sich jetzt gerade?",
                "Was bereitet dir am meisten Freude? Wie kannst du dir mehr Zeit dafür nehmen?",
                "Was fehlt in deinem Leben? Und wie kannst du das ändern?",
                "Schreiben Sie über eine Zeit, in der Sie stolz auf sich waren",
                "Wenn Sie für dieses Jahr 3 Wünsche frei hätten, was würden Sie sich wünschen?",
                "Was beschäftigt dich gerade?",
                "Schreiben Sie über etwas oder jemanden, den Sie vermissen",
                "Was schätzen Sie heute am meisten?",
                "Schreiben Sie über einen Moment in Ihrem Leben, der Sie glücklich macht, wenn Sie daran denken",
                "Wenn das Leben heute aufhören würde, was würden Sie bereuen, es nicht getan zu haben?",
                "Wie soll man sich an dich erinnern und warum?",
                "Welche Aspekte von dir brauchst du, um mehr Liebe zu zeigen?"
            ]
        },
        {
            "challenge_name": "Morgenroutine",
            "challenge_description": "Eine Morgenroutine kann Ihre Energie, Produktivität und Positivität steigern.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Setzen oder stellen Sie sich 20 Minuten lang in die Sonne, während Sie Ihrer Morgenroutine nachgehen, frühstücken, die Nachrichten lesen oder Sport treiben",
                "Wähle 3 Dinge, die du vor Mittag erledigen musst",
                "Priorisieren Sie Ihren Tag. Welche Aufgaben möchten Sie heute erledigen?",
                "Nehmen Sie sich heute Morgen ein paar Minuten Zeit, um Ihren Gedanken und Gefühlen zuzuhören, sie zu identifizieren und bei Bedarf zu verändern",
                "Schreibe eine To-do-Liste für heute",
                "Verbinden Sie sich mit Ihrer Familie und Ihren Freunden oder senden Sie jemandem, den Sie lieben, eine einfache Guten-Morgen-SMS",
                "Atmen Sie tief durch und sagen Sie Danke für diesen Tag",
                "Schreibe 5 Dinge auf die du stolz bist",
                "15 Minuten meditieren",
                "Trinken Sie vor dem Frühstück ein Glas Wasser",
                "Öffnen Sie Ihre Fenster für frische Luft und lassen Sie etwas Sonne herein",
                "Gehen Sie spazieren oder trainieren Sie zu Hause",
                "Lesen Sie einige Kapitel Ihres Lieblingsbuchs",
                "Mach 15 Minuten Yoga",
                "Hören Sie sich einen Podcast oder ein Hörbuch an, während Sie sich fertig machen",
                "Geh raus und atme einfach die frische Morgenluft",
                "Erstellen Sie eine Liste mit 3 Dingen, die Sie für den Tag erledigen möchten",
                "Vermeiden Sie es, Morgennachrichten und soziale Medien zu lesen",
                "Machen Sie Ihr Bett und räumen Sie Ihren Platz auf, um sich produktiver zu fühlen",
                "Wählen Sie eine Affirmation, die Ihren Tag leitet. Zum Beispiel: 'Heute ist ein großartiger Tag.'",
                "Duschen Sie sich und machen Sie sich fertig, auch wenn Sie nirgendwo hingehen",
                "Schauen Sie morgens nicht als Erstes auf irgendeine Form von Social Media",
                "Wenn Sie aufwachen, ziehen Sie eine gute Idee an, um den ganzen Tag gute Stimmung zu haben",
                "Schreibe eine morgendliche Dankbarkeitsliste",
                "Hören Sie Ihre Lieblingsmusik-Playlist, um morgens gute Laune zu bekommen",
                "Dehn dich nach dem Aufwachen ein bisschen",
                "Machen Sie sich ein gesundes und leckeres Frühstück",
                "Benachrichtigungen nicht vor dem Frühstück prüfen",
                "Male, spiele ein Musikinstrument. Tue etwas, das deine Kreativität antreibt",
                "Wach mit einem Lächeln und einer positiven Einstellung für den kommenden Tag auf"
            ]
        },
        {
            "challenge_name": "Positive Denkweise",
            "challenge_description": "Positives Denken ist eine Gewohnheit, die wir uns antrainieren können. Untersuchungen zeigen, dass es sich positiv auf die Gesundheit von Körper und Geist auswirkt.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Lächeln üben. Fremde anlächeln, in den Spiegel schauen, lächeln wann immer es geht. Sie werden sich so viel positiver fühlen",
                "Schätze heute die kleinen Dinge. Jemandes Lächeln, den Sonnenuntergang, deinen Morgenkaffee, die Wärme eines Sonnenstrahls, den Himmel",
                "Statt zu denken 'mein Leben ist schrecklich', die Dinge sind im Moment nicht so toll, aber das wird vorbeigehen. Es kommen bessere Tage",
                "Anstatt an die schrecklichen Dinge zu denken, die passieren könnten, denke an die großartigen Dinge, die aus deiner aktuellen Situation entstehen könnten",
                "Anstatt zu sagen ‚Ich gebe auf‘, sagen Sie ‚Das ist schwer, aber ich werde es weiter versuchen‘",
                "Kümmere dich nicht darum, was andere Leute denken. Die Gedanken anderer Menschen sind nicht darauf ausgelegt, dich glücklich und positiv zu machen",
                "Anstatt zu denken ‚Warum passiert mir das?‘, Denke ‚Was lehrt mich das?‘",
                "Vertraue darauf, dass bessere Dinge kommen, wenn du offen für die Möglichkeiten bist'",
                "Anstatt zu denken 'Ich kann das nicht', denke 'Ich weiß noch nicht, wie ich das machen soll'",
                "Vergleiche dich heute nicht mit anderen. Das ist reine Zeitverschwendung",
                "Denken Sie daran, auch wenn Sie eine bestimmte Situation nicht kontrollieren können, können Sie Ihre Reaktion kontrollieren",
                "Meditieren Sie. Das hilft Ihnen beim Überdenken, senkt Ihren Stress und kann Ihnen helfen, positiver zu sein",
                "Übe positive Selbstgespräche. Du kannst positive Affirmationen mit deiner Meditation verwenden",
                "Beginne oder beende deinen Tag damit, dein Dankbarkeitstagebuch zu schreiben",
                "Umgib dich mit Menschen, die du liebst und die dich zurücklieben",
                "Hören Sie Musik. Musik kann sich positiv auf Ihre Gesundheit und Ihren Tag auswirken",
                "Akzeptanz üben. Schätze alles, was du gerade hast",
                "Hören Sie sich ein inspirierendes YouTube-Video/einen Podcast an. Füllen Sie Ihr Gehirn mit Motivation",
                "Liste 5 Dinge auf, die dich heute zum Lächeln gebracht haben",
                "Statt ‚Ich habe versagt‘ zu sagen, sagen Sie ‚Fehler helfen mir beim Lernen‘",
                "Begrenzen Sie die Zeit für soziale Medien. Verbringen Sie mehr Zeit mit der Erstellung und Arbeit an sich selbst, als mit dem Konsumieren der Inhalte anderer",
                "Schreiben Sie Ihre obersten Prioritäten und Pläne für die Zukunft auf und wissen Sie, dass Sie alles erreichen werden, was Sie wollen",
                "Bleib präsent und genieße die Schönheit des Augenblicks. (Spüre die Sonne in deinem Gesicht, genieße die frische Luft….)",
                "Sei stolz auf dich auf die kleinen Siege heute (und in deinem Alltag)",
                "Wechsle deine Stimmung, indem du etwas tust, was dir wirklich Spaß macht",
                "Schreiben Sie für eine bevorstehende Situation, die Sie beunruhigt, das beste Szenario auf, das passieren kann",
                "Konzentrieren Sie sich auf Lösungen, nicht auf Probleme",
                "Lass die Erwartungen anderer los und konzentriere dich auf das Wesentliche",
                "Umgeben Sie sich mit positiven Menschen",
                "Passen Sie auf sich auf. Wenn wir uns wohlfühlen, können wir die Dinge positiver sehen"
            ]
        },
        {
            "challenge_name": "Selbstliebe",
            "challenge_description": "Es ist klinisch erwiesen, dass die Teilnahme an einer Selbstpflegeroutine Angst und Depression reduziert oder beseitigt, Stress abbaut, die Konzentration verbessert, Frustration und Ärger minimiert, das Glück steigert und die Energie verbessert",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Liste 10 Dinge auf, die du an dir liebst",
                "Sagen Sie heute Ihren fünf Körperteilen im Spiegel 'Danke'",
                "Schreibe jedes Mal eine Notiz, wenn du stolz auf dich bist. Stecke sie in ein 'Ich bin stolz auf mich'-Glas",
                "Vergib dir selbst ein Bedauern, an dem du festgehalten hast, und lass es los",
                "Schreibe eine Liste mit all den Dingen, die du an dir liebst",
                "Verwöhnen Sie Ihren Körper mit gesunder Ernährung und viel Wasser",
                "Räum dein Zimmer/Schreibtisch/Schrank auf und räum alles aus, was dir keine Freude mehr bereitet",
                "Mach ein Foto von dir und schreibe alles auf, was du an deinem Aussehen liebst",
                "Folgen Sie niemandem, der Ihnen das Gefühl gibt, unsicher und schlecht über sich selbst zu sein",
                "Geh irgendwohin, wo du den Sonnenaufgang/Sonnenuntergang beobachten kannst und genieße ihn alleine",
                "Zieh dich immer für dich selbst an. Trage heute dein Lieblingsoutfit",
                "Denken Sie an Ihre Woche und schreiben Sie 5 Dinge auf, für die Sie dankbar sind",
                "Führe ein Tagebuch darüber, wie du dich fühlst und was in deinem Leben vor sich geht",
                "Geh mit dir selbst auf ein Date. Geh in dein Lieblingsrestaurant, geh an den Strand … Irgendwo, wo du dich gut und entspannt fühlst, wo du dich mit dir selbst verbinden kannst",
                "Planen Sie eine Belohnung für sich selbst, wenn Sie diese Herausforderung beenden",
                "Machen Sie einen langen Spaziergang und verbinden Sie sich mit der Natur",
                "Schreiben Sie die größte Herausforderung auf, die Sie gemeistert haben",
                "Trennen Sie den ganzen Tag von jeglicher Technik (es sei denn, Sie haben Arbeit zu erledigen)",
                "Iss dein Lieblingsessen oder -dessert",
                "Schreiben Sie einen Liebesbrief an sich selbst",
                "Schreiben Sie auf, was Sie aus dieser Herausforderung gelernt haben, und vergessen Sie nicht Ihre Belohnung, die Sie an Tag 15 geplant haben",
                "Was haben Sie als Kind gerne gemacht? Tun Sie es heute",
                "Machen Sie eine nahrhafte Mahlzeit",
                "Triff einen alten Freund oder Verwandten",
                "Machen Sie am Nachmittag einen Powernap",
                "Sehen Sie sich einen Film an, den Sie schon immer sehen wollten",
                "Machen Sie eine Videocollage Ihrer Lieblings-Selfies",
                "Liste 5 Dinge auf, in denen du wirklich gut bist",
                "Schreiben Sie über eine Leistung, auf die Sie stolz sind",
                "Wähle 3 positive Affirmationen aus, die du jeden Tag sagen kannst. Bsp. Ich kann das."
            ]
        },
        {
            "challenge_name": "Improve Confidence",
            "challenge_description": "Confidence can also give you a positive outlook on life, increasing your mental and emotional wellbeing.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Unfollow all social media accounts that makes you feel insecure about yourself",
                "Work on accepting compliments rather than denying them today",
                "Be conscious about your posture. Good posture develop more confidence",
                "Do something you loved to do as a child",
                "Do something challenging today, rememver that we don't grow when we're in our comfort zone",
                "Write down 10 things you love about yourself",
                "Say yes to something you normally wouldn't",
                "Implement a new healthy habit",
                "Speak up when you'vd got something to say",
                "Focus on what you want rather than what you don't want",
                "Work on improving your skills on something you love to do or that you would like to start doing",
                "Write down all of your accomplishments including the ones in the future",
                "Do a quick workout, take a shower, get ready and put on an outfit that makes you feel great",
                "Go out by yourself to watch the sunset",
                "Reach out to an old friend",
                "Come up with positive thoughts for every negative one",
                "Give someone a good piece of advice",
                "Do a workout you enjoy",
                "Work on small things. Little achievements make you feel good",
                "Pause and reflect on something before you act, instead of reacting impulsively",
                "Be aunthentic and embrace your uniqueness. Life is not a competition",
                "Don’t talk negatively about other people for the entire day",
                "Write out one thing you've done for your family",
                "Write a love letter to yourself",
                "Write out 3 fears and how can you overcome each",
                "Identify a change you want to make and the steps to do it",
                "Do something that make you feel special",
                "Ask three friends to tell yo their favorite thing about you",
                "Write down 3 of your mistakes and lessons learned",
                "Set an attainable goal for yourself"
            ]
        },
        {
            "challenge_name": "Act of Kindness",
            "challenge_description": "An act of kindness can boost feelings of confidence, being in control, happiness and optimism. They may also encourage others to repeat the good deeds they've experienced themselves – contributing to a more positive community.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Show support to someone today",
                "Donate blood. Save lives",
                "Leave a positive review of your favorite restaurant/coffee shop",
                "Make a family member/loved one breakfast in bed",
                "Ask someone how you can help them - and then do it.",
                "Smile at someone who needs it",
                "Leave a positive review of your favorite app",
                "Give a tip for the trash collector",
                "Ask your parents/siblings/children if there is anything you can do to help them",
                "Write a list of reasons why you love someone and give it to them",
                "Give someone a tip",
                "Spend the day saying only positive things aout people",
                "Tell someone you love how much you appreciate them",
                "Do a chore that you typically wouldn't do",
                "Say 'Have a nice day' at least 3 person you encountered",
                "Buy a meal for a homeless person",
                "Help someone before they ask",
                "Bake cookies and gift it to someone",
                "Try to donate clothes/toys/books to a local charity",
                "Call someone you haven't talked to in a while",
                "Most important of all, always be kind to yourself",
                "Write a thank you note to someone who made an impact in your life",
                "Let someone go ahead in front of you while falling in line",
                "Surprise someone with a gift",
                "Put positive sticky notes on mirrors",
                "Check in with an elderly relative",
                "Give 3 honest compliments to someone you love",
                "Say thank you as much as you can",
                "Compliment someone",
                "Avoid negative thoughts for a day. Show yourself some kindness, too!"
            ]
        },
        {
            "challenge_name": "Mentales Wohlbefinden",
            "challenge_description": "Wenn es um Ihre psychische Gesundheit geht, kann Selbstfürsorge Ihnen helfen, mit Stress umzugehen, Ihr Krankheitsrisiko zu senken und Ihre Energie zu steigern. Selbst kleine Maßnahmen zur Selbstfürsorge in Ihrem täglichen Leben können eine große Wirkung haben. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Angst bewältigen",
                "Schreiben Sie vor dem Schlafengehen 3 Dinge auf, die Sie an diesem Tag geschätzt haben",
                "Selbstmitgefühl üben",
                "Übe Achtsamkeit. Zieh dich zurück in die Gegenwart",
                "Verbringen Sie Zeit mit einem Hobby. Steigern Sie Ihre Stimmung und beschäftigen Sie sich mit einer Aufgabe, die Ihnen Spaß macht",
                "Machen Sie für den Tag eine Social-Media-Pause und konzentrieren Sie sich auf das Leben um Sie herum",
                "Pflanze etwas. Sich um etwas anderes als sich selbst zu kümmern, hat viele mentale Vorteile.",
                "Denken Sie an die besten Momente Ihres Lebens, während Sie auf etwas warten",
                "Lernen Sie, wie Sie mit Ihren Eltern, Erziehern, Freunden, Familienmitgliedern und anderen Ihnen nahe stehenden Personen über mentales Wohlbefinden sprechen können.",
                "Öffnen Sie sich für etwas, das Ihnen auf dem Herzen liegt",
                "Konzentrieren Sie sich heute auf Ruhe und Entspannung und gehen Sie früh ins Bett",
                "Gehe spazieren, ohne auf dein Handy zu schauen, konzentriere dich auf deine Umgebung",
                "Stellen Sie sich einen glücklichen Ort vor, wann immer Sie sich ängstlich fühlen",
                "Lesen oder sehen Sie sich etwas an, das gut für Ihre geistige Gesundheit ist",
                "Stellen Sie sich Ihr Traumleben vor und schreiben Sie auf, welche Schritte Sie besprechen müssen, um dorthin zu gelangen",
                "Positive Selbstgespräche üben",
                "Erneuern Sie Ihre Motivation",
                "Beginne damit, die Wurzel aller negativen Gedanken zu erforschen",
                "Schreibe 5 Dinge auf, für die du dankbar bist",
                "Selbstpflege üben und sich verwöhnen lassen",
                "Schreiben Sie positive Affirmationen auf und lesen Sie sie vor dem Schlafengehen",
                "Atmen Sie 3 Mal tief durch, wann immer Sie können",
                "Planen Sie eine gesunde Mahlzeit",
                "Rufen Sie jemanden auf, den Sie schätzen.",
                "Ruf jemanden an, den du liebst, mit dem du lange nicht gesprochen hast",
                "Probiere eine geführte Meditation aus",
                "Lernen Sie eine neue Fähigkeit, Ihre Gedanken von Problemen und Ängsten wegzulenken",
                "Schreib Tagebuch über alles, was dir durch den Kopf geht",
                "Essen Sie eine nahrhafte Mahlzeit.",
                "Singen Sie Ihr Lieblingslied. Singen hilft, die Atmung zu regulieren und Angstzustände abzubauen."
            ]
        },
        {
            "challenge_name": "Reparieren Sie Ihren Schlafplan",
            "challenge_description": "Diese täglichen challenges sollen Ihnen dabei helfen, eine gesunde Zubettgeh-Routine anzunehmen, ausreichend Schlaf zu bekommen und jeden Morgen erfrischt aufzuwachen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Leg dein Handy weg, damit du am nächsten Morgen aufstehen musst, um den Wecker auszuschalten",
                "Schalten Sie alle Ihre Bildschirme 1 Stunde vor dem Schlafengehen aus, um Ihr Gehirn auf den Schlaf vorzubereiten",
                "Belohnen Sie sich mit einem leckeren Frühstück, damit Sie mehr Motivation haben, früh aufzustehen",
                "Nachts duschen, eine heiße Dusche oder ein Bad helfen Ihnen, sich vor dem Schlafengehen zu entspannen",
                "Versuche jeden Tag zur gleichen Zeit aufzustehen, Konsistenz ist der Schlüssel",
                "Ziehen Sie nach dem Abendessen Ihren kuscheligen Pyjama an, schreiben Sie Tagebuch, lesen Sie eine Ecke und bereiten Sie sich darauf vor, sich zu entspannen und Ihre Seele baumeln zu lassen",
                "Trink viel Wasser nach dem Aufwachen, du wirst dich den ganzen Tag nicht zu müde fühlen",
                "Versuchen Sie, früh zu Abend zu essen, da Sie Ihr Essen früher verdauen und Ihr Körper sich darauf konzentrieren kann, den erholsamen Schlaf zu bekommen, den er braucht",
                "Machen Sie ein schnelles morgendliches Training/Laufen, das wird Ihnen helfen, sich während des Tages energiegeladen und schläfrig zu fühlen, wenn Sie ins Bett gehen sollten",
                "Meditieren Sie vor dem Schlafengehen, es entspannt und baut Stress ab",
                "Öffne die Fenster, wenn du aufwachst und lass die Sonnenstrahlen deine Haut berühren",
                "Planen Sie Ihre Aktivitäten heute Abend und auch Ihre To-Do-Liste für den nächsten Morgen",
                "Hören Sie nach dem Aufwachen Ihre Lieblings-Playlist, um gute Laune zu bekommen",
                "Stellen Sie eine Erinnerung ein, die Sie 30 Minuten vor dem Schlafengehen benachrichtigt",
                "Verbrauchen Sie tagsüber Energie, damit Sie nachts müde werden",
                "Hören Sie 1 Stunde vor dem Schlafengehen auf, Wasser zu trinken, damit Sie nachts nicht aufwachen oder aufstehen müssen, wenn Sie versuchen einzuschlafen",
                "Mach dein Bett nach dem Aufwachen, damit du nicht in Versuchung gerätst, wieder einzuschlafen",
                "Hören Sie vor dem Schlafengehen leichte Musik, das wird Ihnen helfen, bald einzuschlafen",
                "Nach dem Aufwachen gehen Sie direkt ins Badezimmer, um Ihr Gesicht zu waschen oder eine schöne Dusche zu nehmen",
                "Essen Sie Lebensmittel mit Magnesium (wie Mandeln, Erdnüsse und Kürbiskerne) und Zink, um Ihre Schlafqualität zu verbessern",
                "Atmen Sie frische Luft, wenn Sie aufwachen. Erfrischen Sie Ihre Gedanken, die Ihrem Gehirn helfen, morgens klar zu werden",
                "Benutze dein Bett nur zum Schlafen und Sex. Kein Fernsehen.",
                "Kein Koffein 6 Stunden vor der gewählten Schlafzeit",
                "Vermeiden Sie große Mahlzeiten vor dem Schlafengehen",
                "Machen Sie Ihr Zimmer so dunkel und ruhig wie möglich",
                "Vermeiden Sie Nickerchen. Es kann Ihren Schlafzyklus stören",
                "Stellen Sie eine kühle und konstante Temperatur her",
                "Geh nur ins Bett, wenn du müde bist",
                "Schwieriges Gespräch vor dem Schlafengehen vermeiden",
                "Waschen oder wechseln Sie Ihre Bettwäsche und Kissenbezüge"
            ]
        },
        {
            "challenge_name": "Selbstversorgung",
            "challenge_description": "Selbstfürsorge bedeutet, sich die Zeit zu nehmen, Dinge zu tun, die Ihnen helfen, ein gutes Leben zu führen und sowohl Ihre körperliche als auch Ihre geistige Gesundheit zu verbessern.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Plane deinen Tag und halte dich daran",
                "Schreiben Sie ein Tagebuch, protokollieren Sie Ihre Emotionen und Erfahrungen",
                "Betreibe ein Hobby, das dir wirklich Spaß macht",
                "Lesen Sie ein Lieblingsbuch aus Ihrer Kindheit",
                "Trainieren Sie zu Hause. Suchen Sie Trainingsvideos auf Youtube",
                "Versuchen Sie, etwas Neues zu kochen",
                "Teile deinen Eltern oder Freunden etwas, woran du denkst",
                "Morgenroutine schaffen",
                "Rufen Sie Ihre Familie und Freunde an",
                "Löse ein Rätselspiel",
                "Mach ein paar Kunstwerke. Du kannst Ideen im Internet finden",
                "Hören Sie Ihre Lieblingslieder",
                "Brettspiele spielen",
                "Schreiben Sie einem besonderen Menschen einen Brief",
                "Nehmen Sie an einem Online-Kurs teil, um etwas Neues zu lernen",
                "Schauen Sie sich einen neuen Film an",
                "Machen Sie ein kräftiges Nickerchen, um Ihren Geist und Körper auszuruhen",
                "Hören Sie sich einen Teil des Podcasts an",
                "Meditiere, um deinen Geist zu beruhigen und frei von Angst zu sein",
                "Nehmen Sie ein entspannendes Bad",
                "Setzen Sie sich Ihre Ziele für die Zukunft",
                "Singen Sie Ihr Lieblingslied mit",
                "Video-Chat mit jemandem, der Ihnen wichtig ist",
                "Schaffen Sie eine Schlafroutine",
                "Keine Klage",
                "Finde immer Zeit zum Beten.",
                "Sag 'Nein' zur Negativität",
                "Räumen und organisieren Sie Ihren Platz",
                "Setz dir ein Ziel für nächste Woche",
                "Bitte um Hilfe, wenn du sie brauchst"
            ]
        },
        {
            "challenge_name": "Effektive Studie",
            "challenge_description": "Lernen, wie Sie mit Ihrem Studium erfolgreicher werden. Setzen Sie sich effektive und klare Ziele, um bessere Noten zu erreichen, lernen Sie, Ihre Zeit zu verwalten und verbessern Sie Ihre Lernfähigkeiten.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Ordnen und räumen Sie Ihren Schreibtisch zum Lernen auf",
                "Planen Sie eine Lerneinheit und bereiten Sie Lernmaterialien vor",
                "Überwinde deine Schwächen und finde dein Studienziel und deine Motivation",
                "Studieren Sie Ihren Lehrplan und beginnen Sie, in Ihrem Kurs aktiv zu werden",
                "Organisieren Sie immer Ihren Zeitplan und machen Sie sich Notizen",
                "Schreiben Sie Ihre Notizen von Hand und heben Sie Schlüsselwörter hervor",
                "50-10-Regel. Lerne jede Stunde 50 Minuten. Verbringe 10 Minuten damit, deinen Geist zu reinigen",
                "Überprüfen Sie Ihre Notizen, bevor Sie schlafen",
                "Setze dir einen Timer und konzentriere dich nur auf eine einzige Aufgabe",
                "Lernen Sie, als würden Sie jemanden unterrichten",
                "Versprich dir eine Belohnung, wenn du alle Aufgaben erledigst",
                "Verwenden Sie Farben und Textmarker in Ihren Notizen",
                "Verwenden Sie nur Google und Youtube, um Konzepte zu verstehen",
                "Ernähren Sie sich gesund. Ihr Körper wird sich besser fühlen und Sie werden wacher sein",
                "Konzepte zusammenfassen",
                "Lernen Sie mit Ihrem Freund. Bitten Sie Ihren Freund, Sie zu schwierigen Themen zu befragen",
                "Überprüfen Sie, was Sie heute oder diese Woche gelernt haben",
                "Benutze Apps oder Karteikarten für besseres Lernen",
                "Priorisieren Sie Ihre Aufgaben. Erledigen Sie zuerst die Hauptaufgaben",
                "Verwenden Sie die Mind Map, um Informationen zu organisieren",
                "Wähle einen ruhigen Lernort ohne Ablenkungen",
                "Vergiss nicht, Stress abzubauen. Halte deinen Stresslevel niedrig und sorge dich weniger",
                "Überprüfen Sie Ihre Notizen, bevor Sie mit den Hausaufgaben beginnen",
                "Hausaufgabenaufgaben nacharbeiten, Antworten abdecken und sich selbst abfragen",
                "Erstellen Sie eine Liste mit wichtigen Konzepten oder Formeln",
                "Machen Sie Ihre eigene Scheinprüfung",
                "Lerne, als wäre die Überraschungsprüfung morgen.",
                "Schlafen Sie genug, da dies die Gedächtniserhaltung stark unterstützt",
                "Suche nach Gedächtnistechniken, die effektiv zu deinem Studium passen",
                "Hab keine Angst, um Hilfe zu bitten"
            ]
        },
        {
            "challenge_name": "Paarbeziehung",
            "challenge_description": "Diese Beziehungsherausforderung ist so konzipiert, dass sie sich leicht in Ihren Alltag integrieren lässt. Viele der challenges sollten nur wenige Minuten in Anspruch nehmen und können zu jeder Tageszeit durchgeführt werden. Einige erfordern etwas mehr Energie und planen, aber es wird sich lohnen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Erstellen Sie eine Liste der Dinge, die Sie an Ihrem Partner lieben",
                "Planen Sie eine überraschende Verabredungsnacht",
                "Sag deinem Partner, dass du ihn bedingungslos liebst",
                "Teilen Sie die Angst, die Sie vor Ihrer Beziehung haben",
                "Teilen Sie eine gute Erinnerung, die Sie an Ihren Partner haben",
                "Senden Sie Ihrem Partner eine romantische Morgennachricht",
                "Bedanken Sie sich heute bei Ihrem Partner für etwas",
                "Überraschen Sie Ihren Partner mit etwas Gutem",
                "Teilen Sie ein Ziel, das Sie für Ihre Beziehung haben",
                "Machen Sie Ihrem Partner ein Kompliment",
                "Planen Sie einen Wochenendausflug",
                "Gemeinsam alte Bilder anschauen",
                "Erinnere dich an deine erste Begegnung",
                "Gemeinsam eine Bucket List erstellen",
                "Wählen Sie ein zufälliges Wort und beginnen Sie ein tiefes Gespräch mit Ihrem Partner",
                "Gemeinsam puzzeln",
                "Schreiben Sie Ihrem Partner einen Liebesbrief und verstecken Sie ihn, damit er ihn später wiederfindet",
                "Machen Sie gemeinsam etwas, was Ihr Partner gerne macht",
                "Machen Sie einen Lieblingsgenuss",
                "Erzählen Sie Ihrem Partner etwas, an das Sie sich erinnern, dass es ihm gefällt",
                "Gib deinem Partner einen Überraschungskuss und eine Umarmung",
                "Geben Sie Ihrem Partner eine entspannende Massage",
                "Machen Sie Ihrem Partner Frühstück im Bett",
                "Gemeinsam ein Brettspiel spielen",
                "Fragen Sie ihn/sie, wie Sie ein besserer Partner sein können",
                "Hinterlasse ihm/ihr eine süße kleine Notiz",
                "Gemeinsam spazieren gehen",
                "Machen Sie Ihrem Partner heute ein Kompliment",
                "Machen Sie ein Beziehungsquiz",
                "Langsamer Tanz zu einem romantischen Lied"
            ]
        },
        {
            "challenge_name": "Entrümpeln",
            "challenge_description": "Die Reduzierung der Unordnung in unserem Leben – sei es physisch, digital oder anderweitig – ermöglicht es uns, Stressoren direkt anzugehen, und das kommt unserer psychischen Gesundheit zugute.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Räum deinen Kleiderschrank auf",
                "Ordnen Sie Ihre Bücher",
                "Ordnen Sie Ihr Schlafzimmer",
                "Räum deinen Nachttisch auf",
                "Sortieren Sie Ihre Post",
                "Ordnen Sie Ihre Speisekammer",
                "Ungebrauchte Kleidung spenden",
                "Freier Speicherplatz auf Ihrem Computer oder Laptop",
                "Reinigen Sie Ihren Kühlschrank und entsorgen Sie abgelaufene Artikel",
                "Reinigen Sie Ihr Auto",
                "Alte Papiere und Post durchgehen",
                "Leeren Sie Ihren Gefrierschrank",
                "Reinigen Sie Ihre Brieftasche",
                "Organisieren Sie Ihre Küche",
                "Räumen Sie Ihren Schreibtisch oder Arbeitsplatz auf",
                "Alte Klamotten loswerden",
                "Ordnen Sie Ihre Putzutensilien",
                "Ordnen Sie Ihre Kommode",
                "Apps entfernen, die Sie nicht mehr verwenden",
                "Medizinschränke ausräumen",
                "Organisieren Sie alles in Ordnern auf Ihrem Computer",
                "Ordnen Sie Ihr Wohnzimmer",
                "Funktionsfähige Lagerartikel kaufen",
                "Persönliches Zubehör löschen",
                "Verbringen Sie Zeit mit der Reinigung Ihres Autos/Motorrads/Fahrrads",
                "Aktualisieren und organisieren Sie Ihren Kalender",
                "Abgestorbene Pflanzen beseitigen und Töpfe organisieren",
                "Trockenwaren (Gewürze) organisieren und abgelaufene Waren ausräumen",
                "Lagerbehälter und Regale organisieren und beschriften",
                "Meditiere, um deinen Geist zu reinigen"
            ]
        },
        {
            "challenge_name": "Produktivität",
            "challenge_description": "Eine gute Produktivität kann Ihnen helfen, bessere Ziele zu setzen, effektiver zu sein, den Fokus zu erhöhen und die Motivation zu steigern.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Morgens dein Bett machen, damit du nicht in Versuchung kommst, wieder ins Bett zu gehen",
                "Schreibe jeden Tag 3 Dinge auf, für die du dankbar bist",
                "Organisieren Sie einen überfüllten Raum, um den Arbeitsplatz zu verbessern",
                "Verbringen Sie weniger Zeit am Telefon und seien Sie produktiver",
                "Verwenden Sie einen Tagesplaner, um alles zu erreichen, was Sie sich vorgenommen haben",
                "Schalten Sie unnötige Benachrichtigungen auf dem Telefon aus, um Ablenkungen zu vermeiden",
                "Erstellen Sie einen Speiseplan für die ganze Woche",
                "Erstellen Sie eine To-Do-Liste und versuchen Sie, alle Aufgaben zu erledigen",
                "Machen Sie einen 30-minütigen Spaziergang, um frische Luft zu schnappen und sich motiviert zu fühlen, die Welt zu erobern",
                "Räumen Sie das E-Mail-Postfach auf. Manchmal kann es ein wenig überwältigend sein",
                "Trainieren Sie 30 Minuten lang, auch wenn Sie tagsüber nichts tun, Sie werden sich nach dem Training super produktiv fühlen",
                "Lesen Sie vor dem Schlafengehen ein Kapitel eines Buches, um die sozialen Medien zu vergessen",
                "Vermeide es, fernzusehen, damit du mehr Zeit für dich hast",
                "Ordnen Sie Ihren Kleiderschrank und spenden Sie die Dinge, die Sie nicht mehr brauchen",
                "Erstellen Sie eine Musik-Playlist mit Ihren Lieblingssongs und Tanzzeilen, die Ihnen niemand zusieht",
                "Überprüfen Sie Ihr Telefon nicht direkt nach dem Aufwachen und haben Sie einen langsamen und friedlichen Morgen",
                "Meditieren Sie 10 Minuten lang und Sie werden sich verjüngt fühlen",
                "Ordnen Sie Ihre Speisekammer und Ihren Kühlschrank.",
                "Reinigen Sie Ihr Zimmer gründlich. Räumen Sie Platz auf, klarer Geist",
                "Kündigen Sie Leute ab, die Ihnen keine Freude mehr bereiten. Sie werden sich viel erleichterter fühlen",
                "Planen Sie eine Ruhezeit in Ihren Tag ein, um etwas Zeit zum Entspannen zu haben",
                "Wach früher als sonst auf. Erfolgreiche Menschen beginnen ihren Tag früh.",
                "Lesen Sie motivierende und inspirierende Bücher, die Ihnen helfen, Ihren Glauben an sich selbst wiederzugewinnen",
                "Hör auf, Multitasking zu versuchen",
                "Erstellen Sie eine Liste der Dinge, die Sie nicht mehr tun möchten",
                "Bewegen. Gehen. Strecken. Gerade hinsetzen",
                "Schreiben Sie Ideen auf, die Ihnen in den Sinn kommen, aber fangen Sie nicht an, daran zu arbeiten. Planen Sie sie",
                "Genießen Sie ein gesundes Frühstück, um den ganzen Tag über Energie zu haben, um produktiver zu sein",
                "Wenn du etwas beendet hast, egal wie klein, schreib es auf",
                "Delegieren. Sie müssen nicht alles machen"
            ]
        },
        {
            "challenge_name": "Glück",
            "challenge_description": "Wissenschaftliche Studien zeigen, dass Glück mit einer Vielzahl von Vorteilen verbunden ist, darunter höhere Produktivität, größere Kreativität und stärkere Widerstandsfähigkeit gegenüber Stress.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Schreibe Dinge auf, die du an dir liebst",
                "Lächle jeden an, an dem du vorbeikommst",
                "Mach ein bisschen Sport",
                "Koche das Abendessen",
                "Umarme jemanden, den du liebst",
                "Sehen Sie sich einen Comedy-Film an",
                "Rufe einen Freund an",
                "Tanzen als ob keiner zuguckt",
                "Geh raus in die Natur und sei einen Tag lang Entdecker",
                "Kaufen Sie ein Geschenk für jemanden, den Sie lieben",
                "Versuchen Sie es mit Yoga",
                "Früh schlafen gehen und auch früh aufstehen",
                "Lesen Sie etwas Inspirierendes",
                "10 Minuten meditieren",
                "Planen Sie einen zukünftigen Urlaub",
                "Probieren Sie ein neues Rezept aus oder kochen Sie Ihr Lieblingsessen",
                "Sehen Sie sich den wunderschönen Sonnenuntergang an",
                "Verbinde dich mit deinem alten Freund",
                "Vergib jemandem",
                "Versuche etwas Neues",
                "Geh draußen spazieren",
                "Hör dein Lieblingslied",
                "Tue eine kleine Gefälligkeit oder hilf einem Freund oder Nachbarn",
                "Teilen Sie ein Lachen mit jemandem",
                "Gib deinen Kindern/Eltern/Freunden/Geschwistern eine Umarmung",
                "Spielen Sie mit Ihrem Hund oder anderen Haustieren",
                "Verbringen Sie weniger Zeit mit Ihrem Telefon",
                "Sag den Leuten, wie viel sie dir bedeuten",
                "Lass toxische Menschen und Gewohnheiten los",
                "Denken Sie über Ihre Reise von Tag 1 nach"
            ]
        },
        {
            "challenge_name": "Finanzielle Freiheits-Herausforderung",
            "challenge_description": "Einer der wichtigsten Vorteile der finanziellen Unabhängigkeit ist, dass Sie dadurch mehr Kontrolle über Ihr eigenes Leben haben.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Definiere deine finanziellen Ziele",
                "Budget für nächsten Monat erstellen",
                "Aufbau eines Notfonds",
                "Entdecken Sie Finanz-Websites und -Blogs",
                "Sparen für den Ruhestand",
                "Finde Vlogs zur Finanzkompetenz auf Youtube",
                "Nimm Minimalismus an",
                "Kauf dir ein Geldbuch und fang an zu lesen",
                "Denken Sie an Ihre Karriere",
                "Automatisieren Sie Ihr Geld",
                "Überwachen Sie Ihre Kreditwürdigkeit",
                "Planen Sie Ihr Geld",
                "Finden Sie Möglichkeiten, Ihre Lebensmittelrechnung zu senken",
                "Prozent berechnen lernen",
                "Erkunden Sie Möglichkeiten, um zusätzliches Einkommen zu erzielen",
                "Verkaufe, was du nicht brauchst/nutzt",
                "Lesen Sie mehr über Investitionen",
                "Finden Sie eine Strategie, um emotionale Ausgaben zu verhindern",
                "Tag mit weniger Ausgaben",
                "Schreiben Sie einen Sparplan für zukünftige Einkäufe",
                "Suchen Sie nach Möglichkeiten, Rechnungen zu senken",
                "Lesen Sie mehr über Geldmanagement",
                "Grundlegende Finanzbegriffe lernen",
                "Erfahren Sie, wie Kreditkarten funktionieren",
                "Schreiben Sie einen Plan zur Schuldentilgung",
                "Finden Sie Wege, um Ihre nicht wesentlichen Ausgaben zu minimieren",
                "Automatisieren Sie Ihre Rechnungen",
                "Feiern Sie Ihren Fortschritt",
                "Melden Sie sich für den Finanzbildungskurs an",
                "Auf dem Weg zur finanziellen Freiheit bleiben"
            ]
        },
        {
            "challenge_name": "Positive Erziehung",
            "challenge_description": "Das Praktizieren positiver Elternschaft ist ein wesentlicher Leitfaden zwischen Eltern und Kindern, um positive Entwicklungsergebnisse wie Selbstwertgefühl, Vertrauen, Selbstkompetenz, stärkere Bindung zwischen Eltern und Kindern und einen besseren und effektiveren Kommunikationsfluss zu erzielen.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Machen Sie etwas mit Ihrem Kind, von dem Sie wissen, dass es es liebt",
                "Fragen Sie Ihr Kind nach seinen Favoriten",
                "Basteln Sie mit den Kindern wie unseren Pappteller-Schmetterling",
                "Verbringen Sie mindestens 30 Minuten Einzelunterricht mit Ihrem Kind",
                "Lesen Sie Gute-Nacht-Geschichten",
                "Gemeinsam spazieren gehen",
                "Umarme dein Kind heute viermal",
                "Kochen Sie etwas für Ihr Kind, das es mag",
                "Machen Sie zusammen ein paar Fotos oder machen Sie sogar eine DIY-Fotokabine",
                "Fragen Sie Ihr Kind, was es gerne machen würde",
                "Bring sie zu ihrem Lieblingsplatz",
                "Machen Sie gemeinsam eine 'Happy Box'",
                "Gemeinsam eine Geschichte schreiben. Lassen Sie Ihr Kind Bilder malen",
                "Gemeinsam Handabdrücke machen",
                "Bringen Sie Ihrem Kind heute bei, wie man etwas Neues macht",
                "Bringen Sie Ihrem Kind etwas über Geld bei",
                "Macht Musik auf und tanzt zusammen",
                "Machen Sie ein Familienbrettspiel",
                "Hol ihnen ein kleines Geschenk und verstecke es zu Hause, damit sie es finden können",
                "Muffins backen oder Pfannkuchen kochen und zum Nachbarn bringen",
                "Machen Sie gemeinsam eine Karte für den anderen Elternteil",
                "Sprechen Sie heute positiv über Ihr Kind",
                "Frag sie, was sie denken",
                "Fragen Sie ihr Lieblingstier und führen Sie gemeinsam ein lustiges Projekt durch",
                "Bringen Sie Ihrem Kind eine Lebenskompetenz bei",
                "Gehen Sie auf einen Naturspaziergang. Sammeln Sie Gegenstände von einer Liste",
                "Hab einen bunten Tag. Kleide dich in der Farbe, iss Lebensmittel, die färben.",
                "Ein lustiges Basteln für die Großeltern machen",
                "Spielen Sie zusammen mit Knete. Machen Sie einen Formwettbewerb",
                "Fragen Sie Ihr Kind nach seiner Lieblingserinnerung. Planen Sie eine Wiederholung."
            ]
        },
        {
            "challenge_name": "Depression überwinden",
            "challenge_description": "Diese Herausforderung führt Sie zur Überwindung von Depressionen und erinnert Sie daran, dass es große Hoffnung auf Heilung gibt. Depressionen sind sehr gut behandelbar. Viele Menschen, die an Depressionen leiden, erholen sich vollständig. Andere finden eine gewisse Linderung ihrer Symptome. Der Kampf ist es lohnt sich – die Fähigkeit, nach einer Depression im Leben aufzublühen, ist vorhanden.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Berührung ist sehr wichtig bei der Heilung von Depressionen. Streicheln Sie Haustiere, umarmen Sie Freunde und Familie, nehmen Sie den Sex mit Ihrem Partner wieder auf oder lassen Sie sich massieren.",
                "Gehen Sie für 15 Minuten körperlich aktiv nach draußen. Versuchen Sie zu laufen. Reinigen Sie den Garten. Machen Sie einen Spaziergang mit Ihrem Haustier.",
                "Die Ernährung kann einen großen Beitrag zur Linderung von Depressionen leisten. Achten Sie darauf, dass Sie gut und regelmäßig essen, auch wenn Sie keinen Appetit haben",
                "Genug Schlaf bekommen",
                "Lächle und ändere deine Körperhaltung, um zu ändern, wie du dich fühlst.",
                "Lesen Sie positive Beispiele dafür, wie Menschen psychische Probleme überwunden haben, und wissen Sie, dass es auch für Sie möglich ist.",
                "Vergiss die Zukunft und die Vergangenheit. Frage dich: 'Jetzt, genau hier in diesem Moment, was ist falsch?'",
                "Ergänzen Sie Ihre Vitamine, um die Glückshormone zu erhöhen. Ein Mangel an Vitamin B3 und Vitamin D, das durch Sonnenlicht in der Haut gebildet wird, wurde auch mit Depressionen in Verbindung gebracht",
                "Hören Sie auf Ihre innere Stimme. Ist sie hart oder kritisch? Würden Sie andere mit dem gleichen Urteil behandeln? Sind diese Gedanken konstruktiv oder destruktiv?",
                "Stellen Sie sicher, dass Sie jeden Tag nach draußen gehen, da Tageslicht und Sonnenlicht den Serotoninspiegel erhöhen und für Vitamin D benötigt werden",
                "Schämen Sie sich nicht. Sie werden vielleicht überrascht sein zu erfahren, wie viele Menschen stillschweigend an Depressionen leiden. Sprechen Sie mit Ihrer Familie und Ihren Freunden.",
                "Beende missbräuchliche Beziehungen",
                "Verbringen Sie Zeit mit Ihrem Haustier",
                "Du bist stärker als deine Depression",
                "Höre jeden Tag Musik",
                "Tue Dinge, die dich früher glücklich gemacht haben, auch wenn dir nicht danach ist",
                "Isolation vermeiden",
                "Lachen ist ein wichtiges Mittel gegen Depressionen.",
                "Tu was du liebst",
                "Alkohol und Drogen meiden",
                "Finden Sie eine Gelegenheit für Freiwillige, um sich weniger einsam zu fühlen",
                "Wissen Sie, wann Sie sich in der Online-Welt engagieren oder von ihr lösen müssen",
                "Finden Sie etwas, worauf Sie sich freuen können",
                "Tu das Gegenteil von dem, was die ‚Depressionsstimme‘ vorschlägt",
                "Finde kleine Wege, anderen zu dienen",
                "Halte dich nicht mit Problemen auf. Konzentriere dich stattdessen auf die richtige Lösung",
                "Haben Sie praktikable Ziele, die Ihnen das Gefühl geben, etwas erreicht zu haben",
                "Sei dankbar und bemerke jeden Tag 3 gute Dinge",
                "Bitten Sie einen geliebten Menschen, sich regelmäßig bei Ihnen zu melden.",
                "Fordere negative Gedanken heraus."
            ]
        }
    ]
}