{
    "all_challenges": [
        {
            "challenge_name": "إدارة تحدي القلق",
            "challenge_description": "لا تقلق كثيرًا واستمتع بالحياة أكثر مع التحدي الذي أثبت نجاحه. قل نعم لتحدي نفسك وستشعر بتحسن في غضون شهر واحد.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "اعتني بروتين نومك",
                "لا بأس في طلب المساعدة.",
                "اعترف بمشاعرك",
                "صلوا واطلبوا الهداية من الله",
                "اكتب مشاعرك.",
                "تخيل شيئًا ملهمًا",
                "توقف عن أنماط التفكير السلبي",
                "اعثر على الإيجابيات في الحياة.",
                "تعاطف مع نفسك وقلقك.",
                "افحص جذور أي أفكار سلبية.",
                "قم ببناء شجاعتك لمواجهة شيء تتجنبه.",
                "لا بأس أن تشعر بالقلق. تعرف على الأعراض وتعلم كيفية السيطرة عليها.",
                "ضع قائمة بالأشياء التي تتجنبها بسبب قلقك. شاركها",
                "عزز إحدى مهارات التأقلم لديك من خلال إجراء بعض الأبحاث",
                "قم بتمارين اليوجا على Youtube خصيصًا للقلق",
                "اقرأ شيئًا مفيدًا لصحتك العقلية",
                "إصلاح شيء تضرر بسبب قلقك",
                "اذهب إلى مكان يريحك ويخفف من القلق",
                "تناول الطعام اليوم بطريقة ترضي الجسد والعقل والروح",
                "افعل شيئًا يساعدك على إعادة الشحن حيث تشعر بالتعب",
                "اقض 20 دقيقة في الاستماع إلى أصوات الطبيعة",
                "تأكد من أن خلاصات الوسائط الاجتماعية الخاصة بك خالية من القلق",
                "اعمل على حديثك الذاتي , ولا توجد كلمات لئيمة موجهة إلى نفسك",
                "قم بفحص الجسم بالكامل. أين أنت قلقك",
                "التركيز على النوم والراحة ووقت نوم صحي",
                "غيّر شيئًا واحدًا في يومك من شأنه تحسين قلقك",
                "ممارسة اليقظة",
                "قم بالتمرير خلال لفة الكاميرا بهاتفك. عندما تجد صورة تجعلك تبتسم , شاركها مع أي شخص آخر فيها",
                "تواصل مع شخص تعتقد أنه يعاني من القلق أيضًا. مجرد التحدث عنه يمكن أن يساعد كلاكما",
                "تحقق من هدفك من اليوم الأول. ما هو تقدمك؟"
            ]
        },
        {
            "challenge_name": "اشعر بالروعة",
            "challenge_description": "اقض وقتك الذي سيجعلك تشعر بمزيد من الروعة والروعة من خلال خوض هذا التحدي العاطفي.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "فكر في الأشياء الرائعة التي فعلتها بالفعل هذا العام.",
                "ركز على أن تكون إيجابيًا",
                "ضع قائمة بالأشياء التي تجعلك سعيدًا.",
                "تناول الوجبات الخفيفة المفضلة في طفولتك.",
                "ارقص حول منزلك",
                "حاول أن تشرب 8 أكواب من الماء.",
                "شاهد فيلمك المفضل",
                "امنح غرفة نومك / مكان عملك مظهرًا جديدًا",
                "شاهد غروب الشمس / شروق الشمس أثناء الاستماع إلى أغانيك المفضلة",
                "اصنع وجبة صحية",
                "اشترِ شيئًا تريده حقًا (شوكولاتة , زهرة ...)",
                "افعل شيئًا لطيفًا لشخص ما",
                "اصنع قائمة التشغيل الخاصة بك مع الأغاني التي تجلب لك السعادة",
                "Stargaze كلما استطعت",
                "اطلب طعامك المفضل ودلل نفسك",
                "يذهب للمشي",
                "اجعل مشروبك المفضل في المنزل",
                "استمع إلى بودكاست حول شيء يثير اهتمامك",
                "اجمع اللغز",
                "شاهد فيلمًا من طفولتك",
                "اصنع البيتزا الخاصة بك / وجبتك المفضلة",
                "أرسل إلى شخص ما رسالة شكرًا لك على Messenger / WhatsApp",
                "ارتدي الأشياء المفضلة لديك اليوم.",
                "تعلم كلمة جديدة",
                "ضع خطة قائمة للأسبوع",
                "تسكع مع أطفالك / أشقائك",
                "مجاملة 3 أشخاص اليوم",
                "أخيرًا , أكمل المشروع غير المكتمل",
                "لا حلويات ولا صودا ولا وجبات سريعة اليوم",
                "خطط ليوم ممتع مع عائلتك"
            ]
        },
        {
            "challenge_name": "العيش المتعمد",
            "challenge_description": "الالتزام بهذا التحدي اليومي الصغير سيحول حياتك لتكون أفضل نسخة من نفسك",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "صل عندما تستيقظ اليوم. نشكر الله على يوم جديد مليء بالفرص",
                "حدد نية أو 3 أهداف فقط لليوم",
                "كن متعمدًا مع الكلمات التي تتحدث بها عن نفسك والآخرين",
                "اكتب قائمة الامتنان , حاول تضمينها كل صباح / ليل",
                "الابتعاد عن الشاشات قبل النوم بساعة على الأقل",
                "اطبخ شيئًا تحبه وتناول وجبتك بانتباهبدون أي إلهاء ",
                "الحصول على جلسة رعاية ذاتية , والاستحمام , وقناع الوجه والاستمتاع بكل ثانية من العملية",
                "خذ يوميات مدتها 20 دقيقة عن تجاربك هذا الشهر",
                "احتفظ بهاتفك بعيدًا أثناء تناول وجبة",
                "كافئ نفسك عندما تنجز مهامك. يمكن أن يكون الأمر بسيطًا مثل منح نفسك الوقت لفعل شيء تستمتع به حقًا",
                "انظر في المرآة وأخبر نفسك أنك جميلة وقادرة على كل شيء",
                "قم بجلسة يوجا / تأمل لمدة 15 دقيقة",
                "استمع إلى الموسيقى الصاخبة. اختر أن يكون لديك أغانٍ في قائمة التشغيل الخاصة بك ستحافظ على مشاعرك جيدة",
                "عبر عن إبداعك اليوم. ارسم , ارسم , اكتب , ارقص , افعل شيئًا",
                "الذهاب في نزهة في الطبيعة",
                "اتخذ خيارًا واعيًا لاستخدام وسائل التواصل الاجتماعي بحكمة وعقل. ضع حدودًا واختر المحتوى الذي يؤثر على رفاهيتك بطريقة إيجابية",
                "خصص 10 دقائق لكتابة كل الأشياء التي تحب القيام بها ووضع خطة للقيام بواحد منها على الأقل الشهر المقبل",
                "إلغاء متابعة حسابات Instagram التي لم تعد تستمتع بها",
                "اسمح لنفسك بأخذ بضع دقائق للجلوس والتنفس. فقط عش اللحظة",
                "دلل نفسك بقطعة من الجنة. اذهب إلى متجر المعجنات المفضل لديك , واشتر واحدًا المفضل لديك , واجلس في مكان هادئ وتذوق كل قضمة",
                "انتبه إلى صحتك العقلية. كن متعمدًا ومدركًا لمشاعرك وحالتك الذهنية. لا تخف من طلب المساعدة عندما تحتاجها",
                "تناول وجبات الطعام واستمتع بها اليوم بدون استخدام الهاتف أو الشاشة",
                "أعد الاتصال بشخص ما. ضع خطة مع صديق على Messenger , أو Facetime , أو WhatApp , أو اجتمع لمتابعة",
                "استمع إلى خطاب تحفيزي على Youtube",
                "تحقق من مدونة Habitualize",
                "استهلك 3 أنواع مختلفة من الفاكهة اليوم",
                "اكتب 3 أشياء لإنجازها غدًا",
                "قم بمشي حدسي",
                "اكتب دفتر يوميات لمدة 10 دقائق أو أكثر",
                "حلم كبير. وضع النوايا. إنشاء لوحة رؤية"
            ]
        },
        {
            "challenge_name": "تعلم لغة جديدة",
            "challenge_description": "يعد تعلم لغة جديدة أمرًا صعبًا ولكنه يمكن أن يكون أيضًا ممتعًا وبسيطًا وبدون مجهود. بعد تحدي تعلم اللغة لمدة 30 يومًا , سيسمح لك بتعزيز تعلمك للغة كل يوم.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "تعلم 5 كلمات جديدة",
                "جرب تطبيق لغة جديد",
                "شاهد فيلمًا باللغة التي تتعلمها مع الترجمة",
                "كتابة قوائم التسوق / المهام بلغتك المستهدفة",
                "علم شخصًا بعض الكلمات والعبارات",
                "اسأل كيف حالك؟ إلى صديق",
                "شاهد برنامجًا تعليميًا عن شيء ما في اللغة",
                "اكتب عن تجربتك اليوم",
                "سرد شيء ما تفعله",
                "شاهد فيديو تعليمي على Youtube حول اللغة",
                "علم شخصًا ما 5 كلمات جديدة",
                "تعلم القواعد الأساسية",
                "دفتر يومية بلغتك المستهدفة",
                "قراءة مقال إخباري",
                "تحدث إلى شخص أو إلى حيوانك الأليف",
                "تغيير إعدادات هاتفك ليوم واحد",
                "كتابة مراجعة لكتاب / فيلم",
                "اقرأ شيئًا",
                "سجل نفسك وأنت تتدرب على اللغة",
                "اكتب 40 كلمة تعلمتها",
                "اكتب كيف ساعدك هذا التحدي",
                "هل ما زلت تتذكر الكلمات التي تعلمتها في اليوم الأول؟",
                "أجب عن اختبار عبر الإنترنت حول اللغة الهدف",
                "علم أحد أفراد الأسرة بـ 7-10 كلمات جديدة",
                "اكتب 50 كلمة تعلمتها",
                "اكتب شيئًا عن يومك",
                "استمع إلى أغنية باللغة",
                "اكتب قصة",
                "الاستماع إلى بودكاست",
                "إنشاء بطاقات فلاش لحفظ الكلمات بسهولة"
            ]
        },
        {
            "challenge_name": "تحدي اليقظة",
            "challenge_description": "تساعد ممارسة اليقظة على إعادة ضبط عقلك والحصول على منظور واضح عندما تصبح غير مركّز أو تشعر بالارتباك في الحياة",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "قبل القيام بأي مهمة اليوم , اسأل نفسك عن سبب قيامك بهذه المهمة وفكر فيها للحظة",
                "الاستحمام اليقظ. تخيل التخلص من أفكارك السلبية والتركيز على إحساس الماء على بشرتك",
                "قبل الذهاب إلى النوم , اكتب 3 أشياء كنت تقدرها حقًا منذ اليوم",
                "مارس الامتنان. ابدأ في التركيز على الأفكار الإيجابية واترك نمط دماغك المخيف والقلق",
                "أعد ضبط وضعك في كل مرة تجلس فيهاونفرد ظهرك برفق ",
                "مارس بعض التمارين اليوم وركز على الأحاسيس الجسدية",
                "مارس الاستماع الفعال اليوم. هذا يعني التركيز على ما يقوله الشخص الآخر والاستجابة بطريقة مناسبة",
                "قم بفحص الجسم. اجذب انتباهك إلى جسمك وأرسل النفس إلى أي مناطق توتر",
                "ابحث عن مكان هادئ حيث يمكنك الجلوس وكتابة ما تشعر به في الوقت الحالي",
                "كن فضوليًا اليوم. تدرب على الاهتمام بما يحدث ولفت انتباهك نحو معرفة المزيد عنه",
                "لاحظ إحساسك عندما تتذوق , تلمس , تشم وتسمع شيئًا ما",
                "التنفس اليقظ. تنفس , واستمر لمدة 3 ثوان ثم الزفير",
                "امشوا بتمعن. اتخذوا موقفًا لتشعروا بالارتباط بالأرض وترسخوا بقوة على الأرض",
                "اشرب كوبًا من الشاي واعيًا. ركز على الطعم والرائحة والدفء",
                "تدرب على الاستماع بدون إصدار أحكام أثناء إجراء محادثة",
                "افعل شيئًا واحدًا في كل مرة وركز فقط على ذلك",
                "اجلس بشكل مريح , وشعر بقدميك ثابتة على الأرض , وظهر مستقيما ويديك في حضنك. ركز على التنفس لفترة من الوقت",
                "استمع إلى نفسك وأنت ترد على الهاتف أو أثناء إجراء محادثة , والطريقة التي تتحدث بها , والكلمات التي تختارها",
                "نقدر كل شيء اليوم. لاحظ كل ما يحدث وابحث عن طريقة لتقديره",
                "لاحظ بانتباه. صِف عقليًا كائنًا بالتفاصيل , واللون , والملمس , والشكل ...",
                "اجلس في مكان مريح وهادئ لبعض الوقت",
                "قم بمهمة واحدة في كل مرة وحافظ على تركيزك على كل ما تفعله",
                "مارس التعاطف مع شخص يجعلك تشعر بالضيق عادة",
                "ابحث عن مقالة أو مقطع فيديو حول سبب كون الأخطاء والإخفاقات مفيدة لك. خذها على محمل الجد حتى تقضي وقتًا أقل في التركيز على الماضي",
                "تناول الطعام بانتباه. تذوق الطبق وحاول تخمين عدد المكونات التي تم إدخالها فيه",
                "انظر حولك. انظر إلى ورقة / شجرة / زهرة معينة وركز انتباهك",
                "ابحث عن أفلام مضحكة , وأخبر نكاتًا مضحكة , واستمع إلى أشخاص مضحكين. اضحك قدر الإمكان اليوم",
                "استفد من الأوقات التي تحتاج فيها إلى الانتظار وكن يقظًا من خلال التركيز على حواسك وأنفاسك",
                "نظف أسنانك بيدك غير المسيطرة اليوم لتشجيع الانتباه",
                "تحقق دائمًا من تطبيق Habitualizer وتذكيرك بالحذر في جميع الأوقات"
            ]
        },
        {
            "challenge_name": "وقت العائلة",
            "challenge_description": "يوفر وقت العائلة العديد من الفوائد , بما في ذلك بناء الثقة , وخلق رابطة عاطفية أقوى بين أفراد الأسرة , وتحسين مهارات الاتصال , وتحسين الأداء في المدرسة , وتقليل المشكلات السلوكية , فضلاً عن توفير فرصة لبناء الذكريات على أساس المتعة , الضحك والتكاتف ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "اطلب من أطفالك مشاركة نوع واحد من الأشياء التي فعلوها اليوم أو يخططون للقيام بها. اعرض خططك أولاً",
                "علم أطفالك خدعة ورق أو لعبة ورق , أو العب لعبة يستمتع بها كلاكما",
                "اختر معلمًا أو مدينة أو بلدًا يثير اهتمام طفلك واقضِ الوقت في استكشافه عبر Youtube أو Facebook",
                "حضّر عشاءًا خاصًا. ضع زهرة نضرة على الطاولة , وأشعل الشموع , وخذ لحظة للتعبير عن امتنانك لأنك عائلة",
                "التقاط صورة عائلية",
                "اذهبوا إلى الكنيسة وصلوا معًا",
                "فيلم عائلي وليلة بيتزا",
                "ارسم صورًا لبعضكما البعض",
                "طبخ العشاء معًا",
                "تشغيل هل تفضل معًا",
                "حل اللغز معًا",
                "اخبز كعكة أو بسكويت لعائلتك",
                "التخطيط لنزهة عائلية",
                "العبوا ألعاب الفيديو معًا",
                "غنوا أغاني الكاريوكي معًا",
                "تمشوا معًا بعد العشاء",
                "العبوا لعبة لوحية معًا",
                "التخطيط لرحلة أو إجازة",
                "خصص وقتًا خاصًا لإلقاء نكات لطفلك. اضحك عليه أو عليها أيضًا",
                "طهي عشاء خاص لعائلتك",
                "إنشاء قائمة دلو للعائلة",
                "انظر إلى صور العائلة القديمة أو شاهد مقاطع فيديو قديمة",
                "الذهاب في نزهة على الأقدام / التنزه معًا",
                "شاهد شروق الشمس (أو غروبها) معًا",
                "اقض 15 دقيقة مع كل فرد من أفراد الأسرة",
                "قم بزيارة مركز الطبيعة واستمتع بجماله",
                "حضور الأنشطة الإضافية لطفلك",
                "شجع أطفالك على ممارسة هواياتهم",
                "فاجئ أطفالك برحلة أو نشاط ممتع",
                "أخبرهم دائمًا كم أنت لوهاء لهم "
            ]
        },
        {
            "challenge_name": "اخرج من منطقة الراحة الخاصة بك",
            "challenge_description": "تنفيذ هذا التحدي سيقودك إلى أن تصبح شخصًا أقوى , واكتساب الثقة بالنفس من خلال التجارب , ومساعدتك على مواصلة تطويرك الشخصي , والحصول على فرصة لمقابلة أشخاص جدد.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "استيقظ قبل ساعة من الموعد المعتاد",
                "قل مرحبا!' لشخص غريب بشكل عشوائي ",
                "لا تدخل على وسائل التواصل الاجتماعي أو تشاهد التلفاز لمدة 24 ساعة",
                "اصعد إلى شخص ما في العمل وامتدحه",
                "تواصل مع شخص لم تتحدث معه منذ فترة",
                "خذ طريقًا مختلفًا أثناء الذهاب إلى العمل / المدرسة",
                "إجراء محادثة صعبة مع شخص ما حول موضوع كنت تتجنبه",
                "اشترِ شيئًا لن تشتريه أبدًا من متجر البقالة",
                "ابدأ في تعلم لغة جديدة",
                "اصعد إلى الغرباء وابتسم وامدحهم",
                "اطلب المساعدة إذا احتجت إليها أو ساعد شخصًا ما دون أن يطلب منك ذلك",
                "ضع خططًا لعطلة نهاية الأسبوع أو ليوم العطلة",
                "جرب هواية / رياضة جديدة لطالما أردتها أيضًا",
                "ابدأ محادثة مع شخص غريب",
                "جرب التخلص من السموم الرقمية اليوم",
                "أنشئ لوحة رؤية (احصل على الإلهام على Pinterest)",
                "اصطحب نفسك للخارج في موعد",
                "اسأل شخصًا ما في موعد غرامي / امدح شخصًا يخيفك",
                "ابدأ مدونة / قناة يوتيوب / صفحة إنستغرام / كتاب , ما تشتهيه نفسك",
                "اذهب إلى مكان جديد لتناول الطعام أو الخروج منه",
                "ابدأ تحديًا جديدًا مع صديق (يمكنك استخدام واحد من هذا التطبيق أو إنشاء تحدٍ خاص بك)",
                "جرب تمرينًا جديدًا (الزومبا , واليوجا , والبيلاتس , والكيك بوكسينغ , وما إلى ذلك)",
                "امنح شخصًا ما هدية عفوية",
                "اشترك في شيء جديد",
                "اسلك طريقًا جديدًا للذهاب إلى المنزل / العمل / المدرسة",
                "اذهب إلى النوم أبكر مما هو متوقع",
                "السفر إلى مكان جديد",
                "تطوير مهارة جديدة",
                "إرسال 5 رسائل امتنان إلى 5 أشخاص",
                "جرب مظهرًا جديدًا"
            ]
        },
        {
            "challenge_name": "البحث عن السلام الداخلي",
            "challenge_description": "السلام الداخلي يهدئ أذهاننا ويسمح لنا برؤية طريقنا بشكل أوضح , مما يساعدنا على التركيز ومتابعة أهدافنا.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "جرب العلاج بالروائح. يمكن أن تثير الرائحة مظاهر حيوية وواقعية. عندما نشم رائحة طيبة , نشعر بالراحة",
                "خطط للغد. هذا لا يمنحك المزيد من الوقت في الصباح فحسب , بل يجعل حياتك أيضًا أكثر هدوءًا وبساطة , مما يتيح لك الوقت للتخطيط للمستقبل",
                "من خلال حياتنا المزدحمة والمشتتة , قد يكون من السهل نسيان إبداء التقدير للأشخاص الذين نتفاعل معهم كل يوم. خذ بعض الوقت لإظهار الامتنان للأشخاص من حولك",
                "جرب أن تأكل شيئًا وركز على حواسك الخمس. ركز حقًا على كل حاسة , طعم , شم , لمس وبصر.",
                "تخلص من مساحة في منزلك. هذا طريق لشفاء الكتل العاطفية والارتباك الداخلي. وخلق بيئة هادئة وسلمية",
                "ابتسم في المرآة. قد يبدو هذا سخيفًا , لكن له العديد من الفوائد لرفاهيتك. فهو يبطئ القلب , ويرخي الجسم ويطلق الهرمونات لحساب الإجهاد",
                "خذ نفسًا عميقًا وأغلق عينيك. ضع قائمة ذهنية بخمسة أشياء كنت ممتنًا لها. هذا يمكن أن يحول أفكارك من السلبية إلى الإيجابية",
                "اضبط عداد الوقت لمدة 60 ثانية وركز فقط على تنفسك. لاحظ كيف يبدو الصوت وكيف يشعر جسمك",
                "خذ حمامًا يقظًا. خذ وقتًا مستقطعًا , أطفئ الأنوار. دع الماء يتدفق على جسمك وركز على الأحاسيس والدفء الذي تشعر به",
                "قم بإعداد طقوس الشاي أو القهوة. كل ما عليك فعله حقًا هو الإبطاء. انتبه لما تفعله وتذوق المذاق",
                "إذا كان جسمك متوترًا طوال اليوم , خذ لحظة للاسترخاء. خذ نفسًا عميقًا , واسترخ كتفيك , وافتح فكك",
                "حدد 3 أهداف يومية. هذا رقم يمكن التحكم فيه ويسمح لك بالوقت والطاقة الذهنية اللازمة للتركيز عليها بعناية وبشكل شامل",
                "جرب التأمل لمدة 4 دقائق. اضبط منبهًا لمدة 4 دقائق على هاتفك , واجلس بشكل مريح , وأغمض عينيك , وتنفس بشكل طبيعي. إذا بدأ عقلك في الشرود , أعده إلى تنفسك",
                "احتضن أحدًا بقوة وخذ 3 أنفاس كبيرة معًا. التنفس سيؤثر عليك",
                "خذ استراحة رقمية. لا تعتمد على أجهزتك الرقمية كمصدر للراحة. فهي تخلق إحساسًا زائفًا بالإلحاح وتتركنا كما لو أننا نفتقد شيئًا ما",
                "بدلاً من الحكم على ما يقوله شخص ما ,استمع إليهم بعناية , وانتبه لما يقال ",
                "المشي مهدئ جدًا للجسم والعقل والروح. ابدأ بإيجاد مكان مناسب. راقب البيئة من حولك , توقف وركز على الأشجار وأوراق الشجر والأرض التي تمشي عليها",
                "ركز على اللحظة. نصيحة أساسية هي التوقف عن مقارنة الحاضر بالماضي والتركيز على ما يحدث في الوقت الحالي. يمكن أن يكون الأمر بسيطًا مثل تركيز انتباهك على مهمة تقوم بها",
                "قف وتنفس. اشعر بارتباطك بالأرض",
                "افحص جسدك ولاحظ الأحاسيس أو العواطف المخادعة. أفرغ أي أحاسيس أو عواطف أو مشاعر غير سارة في الزفير. لاحظ أي مشاعر ممتعة وتملأها بأنفاسك",
                "وجه انتباهك إلى ما تفكر فيه في الوقت الحاضر. إن إدراك نشاطك العقلي يمكن أن يساعدك على اكتساب منظور حول أفكارك",
                "اعرف نفسك وأحب نفسك",
                "ابتعد عن الأشياء السلبية",
                "حددوا وتخلصوا من العوامل التي تعيق سلامكم",
                "أغمض عينيك عندما تكون غاضبًا",
                "توقف عن الاهتمام بالآخرين الذين يفكرون فيك",
                "السلام يأتي من عيش حياة ذات معنى",
                "صلي دائما عند الاستيقاظ في الصباح وقبل النوم",
                "حل النزاعات في حياتك",
                "قبول القيود لتعزيز المرونة"
            ]
        },
        {
            "challenge_name": "روتين ليلي",
            "challenge_description": "نتائج الروتين الليلي للحصول على ساعات نوم كافية , سيكون لديك تركيز أكثر حدة ومستوى طاقة أعلى ليوم مثمر يأتي الصباح",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "فكر في اليوم. اكتب شيئًا واحدًا على الأقل سار بشكل جيد",
                "خذ لحظة للتواصل مع الله من خلال الصلاة. افتح قلبك له , وأطلق كل ما يدور في ذهنك , واشكره على كل ما حدث خلال اليوم. هذه طريقة رائعة ليس فقط لممارسة الامتنان , ولكن أيضًا للبقاء مرتبط بالله ",
                "خذ لحظة للتفكير في ما عليك القيام به في اليوم التالي والتخطيط وفقًا لذلك.",
                "احصل على ورقة واكتب كل ما يدور في ذهنك. هذا يعني فقط أنه يمكنك الذهاب للنوم دون الحاجة إلى القلق بشأن ما ستفعله غدًا لأنه مكتوب بالفعل",
                "تمتع ببيئة نوم جيدة. حافظ على درجة حرارة غرفة النوم جيدة , واستخدم ستائر معتمة أو قناع سليو لحجب الضوء",
                "اكتب يومياتك. خذ الوقت الكافي للتوقف والتفكير",
                "أشعل بعض الشموع المعطرة وشغل قائمة تشغيل تبعث على الاسترخاء",
                "قم ببعض تمارين الإطالة / اليوجا قبل النوم",
                "اكتب قائمة الامتنان",
                "اقرأ كتابًا جيدًا قبل النوم. يساعدك على الاسترخاء والنوم بشكل أفضل.",
                "خطط لمهامك في اليوم التالي , الطعام , الزي , ...",
                "أرسل ليلة سعيدة خاصة إلى شخص تحبه",
                "خذ حمامًا ساخنًا أو حمامًا لطيفًا",
                "توقف عن تناول الكافيين أو الكحول أو السكر قبل النوم بثلاث ساعات على الأقل",
                "تأمل / صل. فقط كن وحيدًا مع أفكارك",
                "رتب مكانك , وستكون قادرًا على الشعور بالهدوء والاسترخاء",
                "تناول عشاء خفيف قبل النوم",
                "تحديد النوايا للغد",
                "انثري بعض زيوت عطرية لتهدئة جودة نومك",
                "تجنب التحقق من رسائل البريد الإلكتروني والأخبار ودراسة العمل قبل النوم",
                "لا تذهب إلى الفراش جائعًا. تناول بعض اللوز أو الموز أو العصيدة لمساعدتك على النوم بشكل أفضل",
                "تجنب استخدام الهاتف قبل النوم بساعة على الأقل",
                "اشرب بعض شاي البابونج أو شاي عشبي آخر (منزوع الكافيين) قبل النوم",
                "خذ حمامًا دافئًا أو دشًا قبل ساعة أو ساعتين من موعد النوم يمكن أن يفعل المعجزات لمساعدتك على الاسترخاء في الوقت المناسب للنوم",
                "تأكد من شرب الماء قبل الذهاب إلى الفراش. نفقد الرطوبة عندما ننام. من المهم أن ترطيب جيدًا",
                "اغسل أسنانك بالفرشاة في دقيقتين",
                "فكر في آخر 24 ساعة لديك واكتب شيئًا واحدًا على الأقل سار بشكل جيد",
                "اكتب أهم الأولويات للغد في مخطط أو دفتر ملاحظات.",
                "تقليل القلق في قائمة المهام",
                "صلي دائما قبل النوم واغفر لنفسك"
            ]
        },
        {
            "challenge_name": "تأكيد إيجابي",
            "challenge_description": "يمكن أن يساعد هذا التحدي في تقوية تقدير الذات من خلال تعزيز كل من رأيك الإيجابي عن نفسك وثقتك في قدرتك على تحقيق أهدافك.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "أنا أحتضن إمكانيات وإمكانيات هذا اليوم",
                "اخترت أن أكون سعيدًا وأن أحب نفسي اليوم",
                "I لم على استعداد للتغيير والنمو ",
                "أحتضن التجارب خارج منطقة الراحة الخاصة بي",
                "أنا موهوب وذكي",
                "التحديات تتيح لي فرص النمو",
                "أثق في حدسي ليوجهني",
                "أنا في حالة حب مع نفسي وجسدي",
                "أنا في سلام مع ماضي",
                "سأكون لطيفًا مع نفسي والآخرين اليوم",
                "أختار الإيمان على الخوف",
                "سيكون اليوم يومًا إيجابيًا",
                "أنا ممتن لكل ما لدي",
                "أنا أكثر من مجرد أفكاري السلبية",
                "أقبل نفسي دون قيد أو شرط",
                "أنا بصحة جيدة وسعيد",
                "كل ما يحدث الآن يحدث من أجل مصلحتي النهائية",
                "أنا مسؤول عما أشعر به واليوم أختار السعادة",
                "اليوم لن أقارن نفسي بالغرباء على الإنترنت",
                "لدي القدرة على إحداث التغيير",
                "مشاعري وأفكاري صحيحة",
                "لدي الوفرة والقوة الداخلية",
                "أنا مستعد لرؤية الأشياء من منظور جديد",
                "أنا أستحق الحب والاحترام",
                "ذهني واضح وقوي ومركّز",
                "أواجه اليوم بطاقة وشجاعة",
                "أحلامي تحفزني",
                "أستحق الأفضل وأقبله الآن",
                "أنا فريد وواثق",
                "أرى فرصًا لا نهاية لها في حياتي"
            ]
        },
        {
            "challenge_name": "اليومية اليومية",
            "challenge_description": "يساعد التدوين في التحكم في الأعراض وتحسين حالتك المزاجية من خلال: مساعدتك في تحديد أولويات المشاكل والمخاوف والمخاوف.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "اكتب عن شخص يلهمك",
                "اكتب عن 5 بركات في حياتك",
                "انشر 30 حقيقة عن نفسك",
                "ما الشئ الذي يحمسك؟",
                "ما هي الدروس الثلاثة التي تريد أن يتعلمها منك أطفالك / أصدقاؤك / أشقاؤك",
                "اكتب عن التحدي الحالي",
                "كتابة حلول للمشاكل",
                "اكتب ما تريد تعلمه في المستقبل",
                "ضع قائمة بما تحب في والديك / عائلتك",
                "كيف سيبدو يومك المثالي؟",
                "اكتب كل الأشياء التي تريد تحقيقها هذا العام",
                "ما الذي تحتاجه أكثر في حياتك؟",
                "ضع قائمة بالأشياء التي كنت ستفعلها إذا لم تكن خائفًا , وكيف ستؤثر على حياتك",
                "ما النصيحة التي ستعطيها لعمر عشر سنوات؟",
                "كيف يمكنك جعل الغد أفضل؟",
                "اكتب عن كل الأشياء التي تجعلك متوترة وكيف يمكنك تغيير ذلك؟",
                "ما هو الشيء الذي تعلمته أمس؟",
                "اكتب عن صراع الماضي الذي تغلبت عليه. كيف جعلك أقوى؟",
                "ما هو الشيء الذي تتطلع إليه الآن؟",
                "ما الذي يجلب لك أكبر قدر من السعادة؟ كيف يمكنك توفير المزيد من الوقت لذلك؟",
                "ما هو الشيء المفقود في حياتك؟ وكيف يمكنك تغيير ذلك؟",
                "اكتب عن وقت شعرت فيه بالفخر بنفسك",
                "إذا كان لديك 3 أمنيات لهذا العام , فماذا تتمنى؟",
                "ما الذي يدور في ذهنك الآن؟",
                "اكتب عن شيء ما أو شخص ما تفتقده",
                "ما هو أكثر شيء تقدره في اليوم؟",
                "اكتب عن لحظة في حياتك تجعلك سعيدًا عندما تفكر فيها",
                "إذا توقفت الحياة اليوم , فماذا تندم على عدم القيام بذلك؟",
                "كيف تريد أن يتذكرك الناس ولماذا؟",
                "ما هي جوانب نفسك التي تحتاجها لإظهار المزيد من الحب؟"
            ]
        },
        {
            "challenge_name": "الروتين الصباحي",
            "challenge_description": "يمكن أن يؤدي اتباع روتين الصباح إلى زيادة طاقتك وإنتاجيتك وإيجابية.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "اجلس أو قف في الشمس لمدة 20 دقيقة أثناء قيامك بروتينك الصباحي , أو تناول الإفطار , أو الاطلاع على الأخبار , أو ممارسة الرياضة",
                "اختر 3 أشياء لإنجازها قبل منتصف النهار",
                "حدد أولويات يومك. ما المهام التي تأمل في إنجازها اليوم؟",
                "هذا الصباح , خصص بضع دقائق للاستماع إلى أفكارك ومشاعرك , والتعرف عليها , وتحويلها إذا احتجت إلى ذلك",
                "اكتب قائمة مهام اليوم",
                "تواصل مع عائلتك وأصدقائك أو أرسل رسالة صباح الخير إلى شخص تحبه",
                "خذ نفسًا عميقًا وقل شكرًا لك على هذا اليوم",
                "اكتب 5 أشياء تفتخر بها بنفسك",
                "تأمل لمدة 15 دقيقة",
                "اشرب كوبًا منالماء قبل الإفطار ",
                "افتح نوافذك للحصول على هواء نقي ودع بعض أشعة الشمس تدخل",
                "تمشى أو قم بجلسة تدريب بالمنزل",
                "اقرأ بعض فصول كتابك المفضل",
                "مارس اليوجا لمدة 15 دقيقة",
                "استمع إلى بودكاست أو كتاب صوتي أثناء الاستعداد",
                "اخرج واستنشق هواء الصباح المنعش",
                "قم بعمل قائمة بثلاثة أشياء يجب القيام بها لهذا اليوم",
                "تجنب الاطلاع على الأخبار الصباحية ووسائل التواصل الاجتماعي",
                "رتب سريرك ورتب مساحتك لتشعر بمزيد من الإنتاجية",
                "اختر تأكيدًا لتوجيه يومك. على سبيل المثال: اليوم يوم عظيم. ",
                "خذ حمامًا واستعد حتى لو لم تكن ذاهبًا إلى أي مكان",
                "لا تتحقق من أي شكل من أشكال وسائل التواصل الاجتماعي أول شيء في الصباح",
                "عندما تستيقظ , اجذب فكرة جيدة للحصول على ردود فعل إيجابية طوال اليوم",
                "اكتب قائمة صباح الامتنان",
                "استمع إلى قائمة تشغيل الموسيقى المفضلة لديك لتجعلك في مزاج جيد في الصباح",
                "قم ببعض تمارين الإطالة بعد الاستيقاظ",
                "اصنع لنفسك فطورًا صحيًا ولذيذًا",
                "لا تتحقق من الإخطارات قبل الإفطار",
                "ارسم , اعزف مقطوعة موسيقية. افعل شيئًا يغذي إبداعك",
                "استيقظ بابتسامة وسلوك إيجابي لليوم القادم"
            ]
        },
        {
            "challenge_name": "عقلية إيجابية",
            "challenge_description": "التفكير الإيجابي هو عادة يمكننا تدريب أنفسنا على القيام بها. تظهر الأبحاث أن لها تأثيرًا إيجابيًا على صحة الجسم والعقل.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "تدرب على الابتسام. ابتسم للغرباء , في المرآة , ابتسم كلما استطعت. ستشعر بمزيد من الإيجابية",
                "نقدر الأشياء الصغيرة اليوم. ابتسامة شخص ما , غروب الشمس , قهوتك الصباحية , دفء شعاع الشمس , السماء",
                "بدلاً من التفكير بأن حياتي مروعة , الأمور ليست رائعة في الوقت الحالي , لكن هذا سيمضي. أيام أفضل قادمة",
                "بدلاً من التفكير في الأشياء الفظيعة التي قد تحدث , فكر في الأشياء العظيمة التي يمكن أن تأتي من وضعك الحالي",
                "بدلاً من قول أنا أستسلم , قل هذا صعب لكنني سأستمر في المحاولة ",
                "توقف عن الاهتمام بما يعتقده الآخرون. أفكار الآخرين ليست مصممة لتجعلك سعيدًا وإيجابيًا",
                "بدلاً من التفكير في لماذا يحدث هذا لي؟ , فكر في ما الذي يعلمني هذا؟ ",
                "ثق أن الأشياء الأفضل ستأتي إذا كنت منفتحًا على الاحتمالات",
                "بدلاً من التفكير لا يمكنني فعل هذا , فكر في لا أعرف كيفية القيام بذلك بعد ",
                "لا تقارن نفسك بأي شخص آخر اليوم. إنها مضيعة للوقت",
                "تذكر , حتى إذا كنت لا تستطيع التحكم في موقف معين , يمكنك التحكم في راحتك",
                "التأمل. سيساعدك هذا في الإفراط في التفكير , ويقلل من التوتر ويمكن أن يساعدك على أن تكون أكثر إيجابية",
                "مارس الحديث الذاتي الإيجابي. يمكنك استخدام التأكيدات الإيجابية مع التأمل",
                "ابدأ أو أنهي يومك بكتابة دفتر يوميات الامتنان",
                "أحط نفسك بالأشخاص الذين تحبهم والذين يحبونك مرة أخرى",
                "استمع إلى الموسيقى. يمكن أن يكون للموسيقى تأثير إيجابي على صحتك ويومك",
                "قبول الممارسة. قدر كل ما لديك الآن",
                "استمع إلى مقطع فيديو / بودكاست ملهم على youtube. املا عقلك بالحافز",
                "اذكر 5 أشياء جعلتك تبتسم اليوم",
                "بدلاً من قول لقد فشلت , قل تساعدني الأخطاء في التعلم",
                "قلل من وقت الوسائط الاجتماعية. اقض المزيد من الوقت في إنشاء والعمل على نفسك بحيث تستهلك محتوى الآخرين",
                "اكتب أولوياتك وخططك للمستقبل مع العلم أنك ستحقق كل ما تريد",
                "ابق حاضرًا وقدر جمال اللحظة. (اشعر بالشمس في وجهك , استمتع بالهواء النقي ...)",
                "كن فخوراً بنفسك في المكاسب الصغيرة اليوم (وفي يومك ليومك)",
                "غيّر حالتك المزاجية بفعل شيء تستمتع به حقًا",
                "بالنسبة إلى الموقف القادم الذي تشعر بالقلق حياله , اكتب أفضل سيناريو يمكن أن يحدث",
                "ركز على الحلول وليس المشاكل",
                "تخلَّ عن توقعات الآخرين وركز على ما يهم",
                "أحط نفسك بنوع إيجابي من الناس",
                "اعتني بنفسك. عندما نشعر بأفضل ما لدينا , يمكننا رؤية الأشياء بطريقة أكثر إيجابية"
            ]
        },
        {
            "challenge_name": "حب الذات",
            "challenge_description": "لقد ثبت سريريًا أن الانخراط في روتين الرعاية الذاتية يقلل من القلق أو يزيلهوالاكتئاب وتقليل التوتر وتحسين التركيز وتقليل الإحباط والغضب وزيادة السعادة وتحسين الطاقة ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "ضع قائمة بـ 10 أشياء تحبها في نفسك",
                "قل شكرًا لأجزاء جسمك الخمسة في المرآة اليوم",
                "اكتب ملاحظة منشورة في كل مرة تشعر فيها بالفخر بنفسك. ضعها في جرة أنا فخور بنفسي ",
                "سامح نفسك على الأسف الذي كنت متمسكًا به واتركه يمضي",
                "اكتب قائمة بكل الأشياء التي تحبها في نفسك",
                "عالج جسمك بالطعام الصحي والكثير من الماء",
                "نظف غرفتك / مكتبك / خزانة ملابسك ونظف كل التفاصيل التي لم تعد تجلب لك السعادة",
                "التقط صورة لنفسك واكتب كل ما تحبه في مظهرك",
                "إلغاء متابعة أي شخص يجعلك تشعر بعدم الأمان والسوء تجاه نفسك",
                "اذهب إلى مكان يمكنك من خلاله مشاهدة شروق / غروب الشمس والاستمتاع بها بنفسك",
                "ارتدِ ملابسك دائمًا. ارتدي ملابسك المفضلة اليوم",
                "فكر في أسبوعك واكتب 5 أشياء تشعر بالامتنان لها",
                "اكتب يوميات حول ما تشعر به وما يحدث في حياتك",
                "اذهب في موعد مع نفسك. اذهب إلى مطعمك المفضل , واذهب إلى الشاطئ ... في مكان تشعر فيه بالراحة والاسترخاء حيث يمكنك التواصل مع نفسك",
                "خطط لمكافأة لنفسك عند الانتهاء من هذا التحدي",
                "المشي لمسافات طويلة والتواصل مع الطبيعة",
                "اكتب التحدي الأكبر الذي تغلبت عليه",
                "افصل أي تقنية عن أي تقنية طوال اليوم (ما لم يكن لديك عمل لتقوم به)",
                "تناول وجبتك المفضلة أو الحلوى",
                "اكتب رسالة حب لنفسك",
                "اكتب ما تعلمته من هذا التحدي ولا تنسَ المكافأة التي خططت لها في اليوم الخامس عشر",
                "ما الشيء الذي كنت تحب فعله عندما كنت طفلاً؟ افعله اليوم",
                "اصنع وجبة مغذية",
                "تواصل مع صديق أو قريب قديم",
                "خذ قيلولة بعد الظهر",
                "شاهد فيلمًا كنت تريده",
                "اصنع صورة مجمعة بالفيديو لصورك الشخصية المفضلة",
                "اذكر 5 أشياء تجيدها حقًا",
                "اكتب عن إنجاز تفتخر به",
                "اختر 3 تأكيدات إيجابية لتقولها كل يوم. على سبيل المثال , يمكنني فعل ذلك."
            ]
        },
        {
            "challenge_name": "تحسين الثقة",
            "challenge_description": "الثقة يمكن أن تمنحك أيضًا نظرة إيجابية للحياة , مما يزيد من صحتك العقلية والعاطفية.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "إلغاء متابعة جميع حسابات وسائل التواصل الاجتماعي التي تجعلك تشعر بعدم الأمان تجاه نفسك",
                "اعمل على قبول الإطراءات بدلاً من إنكارها اليوم",
                "كن مدركًا لوقفتك. فالوضع الجيد ينمي المزيد من الثقة",
                "افعل شيئًا كنت تحب أن تفعله كطفل",
                "افعل شيئًا صعبًا اليوم , وتذكر أننا لا ننمو عندما نكون في منطقة الراحة الخاصة بنا",
                "اكتب 10 أشياء تحبها في نفسك",
                "قل نعم لشيء لا تريده عادة",
                "تنفيذ عادة صحية جديدة",
                "تحدث عندما يكون لديك ما تقوله",
                "ركز على ما تريد بدلاً مما لا تريده",
                "اعمل على تحسين مهاراتك في شيء تحب القيام به أو ترغب في البدء في القيام به",
                "اكتب كل إنجازاتك بما في ذلك الإنجازات في المستقبل",
                "قم بتمرين سريع , واستحم , واستعد وارتدي زيًا يشعرك بالارتياح",
                "اخرج بنفسك لمشاهدة غروب الشمس",
                "تواصل مع صديق قديم",
                "ابتكر أفكارًا إيجابية لكل شخص سلبي",
                "تقديم نصيحة جيدة لشخص ما",
                "قم بتمرين تستمتع به",
                "العمل على الأشياء الصغيرة. الإنجازات الصغيرة تجعلك تشعر بالرضا",
                "توقف وفكر في شيء ما قبل أن تتصرف , بدلاً من رد الفعل باندفاع",
                "كن متفرداً واحتضن تفردك. الحياة ليست منافسة",
                "لا تتحدث بشكل سلبي عن الآخرين طوال اليوم",
                "اكتب شيئًا واحدًا قمت به لعائلتك",
                "اكتب رسالة حب لنفسك",
                "اكتب 3 مخاوف وكيف يمكنك التغلب على كل منها",
                "تحديد التغيير الذي تريد القيام به والخطوات اللازمة للقيام بذلك",
                "افعل شيئًا يجعلك تشعر بأنك مميز",
                "اطلب من ثلاثة أصدقاء أن يخبروك بما يفضلونه عنك",
                "اكتب 3 من أخطائك والدروس المستفادة",
                "حدد لنفسك هدفًا يمكن تحقيقه"
            ]
        },
        {
            "challenge_name": "فعل صدقة",
            "challenge_description": "العمل اللطيف يمكن أن يعزز مشاعر الثقة والتحكم والسعادة والتفاؤل. وقد يشجعون أيضًا الآخرين على تكرار الأعمال الصالحة التي جربوها بأنفسهم - مما يساهم في مجتمع أكثر إيجابية.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "أظهر الدعم لشخص ما اليوم",
                "تبرع بالدم , أنقذ الأرواح",
                "اترك تقييمًا إيجابيًا للمطعم / المقهى المفضل لديك",
                "اجعل أحد أفراد الأسرة / أحد أفراد أسرتك وجبة الإفطار في السرير",
                "اسأل شخصًا كيف يمكنك مساعدته - ثم افعل ذلك.",
                "ابتسم لمن يحتاجها",
                "اترك تعليقًا إيجابيًا عن تطبيقك المفضل",
                "إعطاء إكرامية لجامع القمامة",
                "اسأل والديك / أشقائك / أطفالك عما إذا كان هناك أي شيء يمكنك القيام به لمساعدتهم",
                "اكتب قائمة بالأسباب التي تجعلك تحب شخصًا ما وامنحه إياه",
                "إعطاء نصيحة لشخص ما",
                "اقضِ اليوم في قول الأشياء الإيجابية فقط للناس",
                "أخبر أي شخص تحبه بمدى تقديرك له",
                "قم بعمل روتيني لن تفعله عادة",
                "قل أتمنى لك يومًا سعيدًا على الأقل 3 أشخاص واجهتهم",
                "شراء وجبة لشخص بلا مأوى",
                "ساعد شخصًا ما قبل أن يسأل",
                "اخبز ملفات تعريف الارتباط وقدمها إلى شخص ما",
                "حاول التبرع بالملابس / الألعاب / الكتب لجمعية خيرية محلية",
                "اتصل بشخص لم تتحدث معه منذ فترة",
                "الأهم من ذلك كله , كن دائمًا لطيفًا مع نفسك",
                "اكتب رسالة شكر إلى شخص كان له تأثير في حياتك",
                "دع أحدًا يمضي قدمًا أمامك وهو يسقط في الطابور",
                "مفاجأة شخص ما بهدية",
                "ضع ملاحظات لاصقة إيجابية على المرايا",
                "تحقق مع قريب مسن",
                "امنح 3 مجاملات صادقة لشخص تحبه",
                "قل شكرا بقدر ما تستطيع",
                "مجاملة شخص ما",
                "تجنب الأفكار السلبية ليوم واحد. أظهر لنفسك بعض اللطف أيضًا!"
            ]
        },
        {
            "challenge_name": "الصحة العقلية",
            "challenge_description": "عندما يتعلق الأمر بصحتك العقلية , يمكن أن تساعدك الرعاية الذاتية في إدارة التوتر , وتقليل خطر الإصابة بالمرض , وزيادة طاقتك. حتى الأعمال الصغيرة للرعاية الذاتية في حياتك اليومية يمكن أن يكون لها تأثير كبير. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "إدارة القلق",
                "قبل الذهاب للنوم , اكتب 3 أشياء كنت تقدرها منذ اليوم",
                "ممارسة التعاطف مع الذات",
                "مارس اليقظة. اسحب نفسك إلى الحاضر",
                "اقضِ بعض الوقت في هواية. عزز حالتك المزاجية وانخرط في مهمة تستمتع بها",
                "خذ استراحة من وسائل التواصل الاجتماعي لهذا اليوم وركز على الحياة من حولك",
                "ازرع شيئًا. الاعتناء بشيء آخر غير نفسك له العديد من الفوائد العقلية.",
                "فكر في أفضل جوانب حياتك وأنت تنتظر شيئًا ما",
                "تعرف على كيفية التحدث عن الصحة العقلية لوالديك , والمعلمين , والأصدقاء , وأفراد الأسرة , وغيرهم من المقربين منك.",
                "الانفتاح على شيء يدور في ذهنك",
                "ركز على الراحة والاسترخاء اليوم والذهاب إلى الفراش مبكرًا",
                "اذهب في نزهة دون النظر إلى هاتفك , مع التركيز على ما يحيط بك",
                "تخيل مكانًا سعيدًا كلما شعرت بالقلق",
                "اقرأ أو شاهد شيئًا مفيدًا لصحتك العقلية",
                "تخيل حياتك التي تحلم بها واكتب الخطوات التي تحتاجها للتحدث للوصول إلى هناك",
                "ممارسة الحديث الذاتي الإيجابي",
                "جدد حافزك",
                "ابدأ في استكشاف جذور أي أفكار سلبية",
                "اكتب 5 أشياء أنت ممتن لها",
                "مارس الرعاية الذاتية ودلل نفسك",
                "اكتب التأكيدات الإيجابية واقرأها قبل النوم",
                "خذ 3 أنفاس عميقة كاملة كلما استطعت",
                "التخطيط لوجبة صحية",
                "أعطِ صيحة لشخص تقدره",
                "اتصل بشخص تحبه ولم تتحدث عنه منذ فترة",
                "جرب التأمل الإرشادي",
                "تعلم مهارة جديدة لتحويل أفكارك بعيدًا عن المشاكل والقلق",
                "اكتب يوميات عن كل ما يدور في ذهنك",
                "تناول وجبة مغذية",
                "قم بغناء أغنيتك المفضلة. الغناء يساعد على تنظيم التنفس وتقليل القلق"
            ]
        },
        {
            "challenge_name": "أصلح جدول نومك",
            "challenge_description": "تهدف هذه التحديات اليومية إلى مساعدتك على اتباع روتين صحي لوقت النوم , والحصول على قسط كافٍ من النوم, واستيقظ وأنت تشعر بالانتعاش كل صباح. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "ضع هاتفك بعيدًا حتى تضطر في صباح اليوم التالي إلى النهوض من السرير لإيقاف المنبه",
                "أوقف تشغيل جميع شاشاتك قبل النوم بساعة واحدة لتجهيز عقلك للنوم",
                "كافئ نفسك بوجبة فطور لذيذة حتى يكون لديك دافع أكبر للاستيقاظ مبكرًا",
                "سيساعدك الاستحمام ليلاً أو الاستحمام بماء ساخن على الاسترخاء قبل النوم",
                "حاول الاستيقاظ في نفس الوقت كل يوم , الاتساق هو المفتاح",
                "بعد العشاء , ارتدي بيجاماتك المريحة , ودوِّن يوميات , واقرأ ركنًا واستعد للاسترخاء ودع عقلك يسترخي",
                "اشرب الكثير من الماء بعد الاستيقاظ , فلن تشعر بالتعب الشديد طوال اليوم",
                "حاول تناول العشاء مبكرًا , نظرًا لأنك ستهضم طعامك مبكرًا , يمكن لجسمك التركيز على الحصول على قسط من النوم المريح الذي يحتاجه",
                "احصل على تمرين / ركض سريع في الصباح , سيساعدك هذا على الشعور بالنشاط أثناء النهار والنعاس عندما يجب أن تنام",
                "التأمل قبل النوم , إنه الاسترخاء ويقلل التوتر",
                "افتح النوافذ عندما تستيقظ وتلمس أشعة الشمس بشرتك",
                "خطط مسبقًا لأنشطتك الليلة وقائمة مهامك في صباح اليوم التالي",
                "استمع إلى قائمة التشغيل المفضلة لديك بعد الاستيقاظ لتنعم بمزاج جيد",
                "اضبط تذكيرًا لتنبيهك قبل 30 دقيقة من وقت النوم",
                "استهلك الطاقة أثناء النهار حتى تشعر بالتعب في الليل",
                "توقف عن شرب الماء قبل النوم بساعة واحدة حتى لا تضطر إلى الاستيقاظ أثناء الليل أو الاستيقاظ وأنت تحاول النوم",
                "رتب سريرك بعد الاستيقاظ حتى لا تغري بالعودة للنوم مرة أخرى",
                "استمع إلى الموسيقى الخفيفة قبل النوم , فهذا سيساعدك على النوم قريبًا",
                "بعد الاستيقاظ من النوم , توجه مباشرة إلى الحمام لغسل وجهك أو الحصول على دش لطيف",
                "تناول الطعام الذي يحتوي على المغنيسيوم (مثل اللوز والفول السوداني وبذور القرع) والزنك لتحسين نوعية نومك",
                "تنفس الهواء النقي عند الاستيقاظ. جدد أفكارك التي تساعد عقلك على التنقية في الصباح",
                "استخدم سريرك فقط للنوم والجنس فقط. ممنوع مشاهدة التلفاز.",
                "عدم تناول الكافيين قبل 6 ساعات من وقت النوم المختار",
                "تجنب تناول وجبات كبيرة قبل النوم",
                "اجعل غرفتك مظلمة وهادئة قدر الإمكان",
                "تجنب القيلولة. يمكن أن تعطل دورة نومك",
                "تحديد درجة حرارة باردة ومتسقة",
                "اذهب إلى الفراش فقط عندما تشعر بالنعاس",
                "تجنب الحديث الصعب قبل النوم",
                "اغسل أو غيّر ملاءات السرير وأكياس الوسائد"
            ]
        },
        {
            "challenge_name": "العناية الذاتية",
            "challenge_description": "الرعاية الذاتية تعني قضاء الوقت في القيام بأشياء تساعدك على العيش بشكل جيد وتحسين صحتك الجسدية والعقلية.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "خطط ليومك والتزم به",
                "اكتب يوميات , سجل عواطفك وخبراتك",
                "مارس هواية تستمتع بها حقًا",
                "اقرأ كتابًا مفضلًا عندما كنت طفلاً",
                "تمرن في المنزل. ابحث عن مقاطع فيديو للتمارين الرياضية على Youtube",
                "حاول طهي شيء جديد",
                "شارك شيئًا تفكر فيه مع والديك أو أصدقائك",
                "إنشاء روتين الصباح",
                "اتصل بأسرتك وأصدقائك",
                "حل لعبة ألغاز",
                "قم ببعض الأعمال الفنية. يمكنك العثور على أفكار على الإنترنت",
                "استمع إلى أغانيك المفضلة",
                "لعب ألعاب اللوح",
                "اكتب رسالة إلى شخص مميز",
                "خذ دورة عبر الإنترنت لتعلم مهارات جديدة",
                "مشاهدة فيلم جديد",
                "خذ قيلولة قوية لإراحة عقلك وجسمك",
                "استمع إلى بعض البودكاست",
                "التأمل لتهدئة عقلك وخالية من القلق",
                "خذ حمامًا مريحًا",
                "حدد أهدافك للمستقبل",
                "الغناء مع أغنيتك المفضلة",
                "دردشة فيديو مع شخص تهتم لأمره",
                "إنشاء روتين للنوم",
                "لا تشكو",
                "ابحث دائمًا عن وقت للصلاة",
                "قل لا للسلبية",
                "نظّف مكانك ونظّمه",
                "حدد هدفًا للأسبوع القادم",
                "طلب المساعدة إذا كنت في حاجة إليها"
            ]
        },
        {
            "challenge_name": "دراسة فعالة",
            "challenge_description": "تعلم كيف تصبح ناجحًا في دراستك. ضع أهدافًا فعالة وواضحة من أجل تحقيق درجات أعلى , وتعلم كيفية الإدارةه وقتك وحسّن مهاراتك الدراسية. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "تنظيم وتنظيف مكتبك للدراسة",
                "التخطيط لجلسة دراسية وإعداد المواد الدراسية",
                "تغلب على نقاط ضعفك وابحث عن هدف دراستك ودوافعك",
                "ادرس منهجك الدراسي وابدأ في أن تكون نشطًا في دورتك التدريبية",
                "قم دائمًا بتنظيم جدولك الزمني وتدوين الملاحظات",
                "اكتب ملاحظاتك يدويًا وتمييز الكلمات الرئيسية",
                "قاعدة 50-10. ادرس 50 دقيقة كل ساعة. اقض 10 دقائق في تنظيف عقلك",
                "راجع ملاحظاتك قبل النوم",
                "اضبط مؤقتًا وركز فقط على مهمة واحدة",
                "ادرس وكأنك تعلم شخصًا ما",
                "وعد نفسك بمكافأة إذا أكملت جميع المهام",
                "استخدم الألوان وأقلام التظليل في ملاحظاتك",
                "استخدم Google و Youtube فقط لفهم المفاهيم",
                "تناول طعامًا صحيًا. سيشعر جسمك بالتحسن وستكون أكثر يقظة",
                "تلخيص المفاهيم",
                "ادرس مع صديقك. اطلب من صديقك أن يختبرك في مواضيع صعبة",
                "راجع ما تعلمته اليوم أو هذا الأسبوع",
                "استخدام التطبيقات أو البطاقات التعليمية لتحسين التعلم",
                "حدد أولويات مهامك. أكمل المهام الرئيسية أولاً",
                "استخدم الخريطة الذهنية لتنظيم المعلومات",
                "اختر مكانًا هادئًا للدراسة دون تشتيت الانتباه",
                "لا تنس التخلص من التوتر. حافظ على مستوى توترك منخفضًا وقلق أقل",
                "راجع ملاحظاتك قبل أن تبدأ واجبك المنزلي",
                "أعد دراسة مشاكل الواجبات المنزلية , وقم بتغطية الإجابات واختبار نفسك",
                "ضع قائمة بالمفاهيم أو الصيغ المهمة",
                "إجراء الامتحان الوهمي الخاص بك",
                "ادرس مثل الامتحان المفاجئ غدًا.",
                "احصل على قسط كافٍ من النوم لأنه يساعد بشكل كبير في الاحتفاظ بالذاكرة",
                "ابحث عن تقنيات الذاكرة التي تناسب دراستك بشكل فعال",
                "لا تخف أبدًا من طلب المساعدة"
            ]
        },
        {
            "challenge_name": "علاقة الأزواج",
            "challenge_description": "تم تصميم تحدي العلاقة هذا ليكون من السهل دمجه في حياتك اليومية. يجب أن تستغرق العديد من التحديات بضع دقائق فقط للقيام بها ويمكن تنفيذها في أي وقت على مدار اليوم. يتطلب بعضها المزيد من الطاقة و التخطيط , لكن الأمر يستحق ذلك ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "ضع قائمة بالأشياء التي تحبها في شريكك",
                "التخطيط ليلة موعد مفاجأة",
                "أخبر شريكك أنك تحبه دون قيد أو شرط",
                "شارك مخاوفك بشأن علاقتك",
                "شارك بذاكرة جيدة لديك عن شريكك",
                "ابعث لشريكك رسالة صباحية رومانسية",
                "شكرا لشريكك على شيء اليوم",
                "فاجئ شريكك بشيء جيد",
                "شارك هدفًا لديك لعلاقتك",
                "امدح شريكك",
                "التخطيط لقضاء عطلة نهاية الأسبوع",
                "انظروا إلى الصور القديمة معًا",
                "استرجع ذكرياتك عندما التقيت للمرة الأولى",
                "أنشئ قائمة دلو معًا",
                "اختر كلمة عشوائية وابدأ محادثة عميقة مع شريكك",
                "حل اللغز معًا",
                "اكتب رسالة حب لشريكك وأخفها ليجدها لاحقًا",
                "افعلوا شيئًا يستمتع شريكك بفعله معًا",
                "اصنع متعة مفضلة",
                "أخبر شريكك بشيء تتذكره يحبه",
                "امنح شريكك قبلة وعناق مفاجأة",
                "امنح شريكك تدليكًا مريحًا",
                "اجعل شريكك الإفطار في السرير",
                "العبوا لعبة لوحية معًا",
                "اسأله كيف يمكنك أن تكون شريكًا أفضل",
                "اترك له / لها ملاحظة صغيرة لطيفة",
                "تمشوا معًا",
                "امدح شريكك اليوم",
                "خذ اختبار علاقة",
                "الرقص البطيء على أغنية رومانسية"
            ]
        },
        {
            "challenge_name": "تنظيم",
            "challenge_description": "الحد من الفوضى في حياتنا - سواء كانت مادية أو رقمية أو غير ذلك - يسمح لنا بمعالجة الضغوطات بشكل مباشر والتي تفيد صحتنا العقلية.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "تنظيف خزانتك",
                "تنظيم كتبك",
                "تنظيم غرفة نومك",
                "امسح منضدتك",
                "فرز من خلال البريد الخاص بك",
                "تنظيم مخزنك",
                "تبرع بالملابس غير المستخدمة",
                "إفراغ مساحة جهاز الكمبيوتر أو الكمبيوتر المحمول",
                "نظف ثلاجتك وتخلص من العناصر منتهية الصلاحية",
                "Clشغِّل سيارتك ",
                "تصفح الأوراق القديمة والبريد",
                "إفراغ الفريزر الخاص بك",
                "تنظيف محفظتك",
                "تنظيم مطبخك",
                "امسح مكتبك أو مساحة عملك",
                "تخلص من الملابس القديمة",
                "تنظيم أدوات التنظيف الخاصة بك",
                "تنظيم خزانة الملابس الخاصة بك",
                "إزالة التطبيقات التي لم تعد تستخدمها",
                "تنظيف خزانات الأدوية",
                "تنظيم كل شيء في مجلدات على جهاز الكمبيوتر الخاص بك",
                "تنظيم غرفة معيشتك",
                "شراء عناصر تخزين وظيفية",
                "تطهير الملحقات الشخصية",
                "قضاء الوقت في تنظيف سيارتك / دراجتك النارية / دراجتك",
                "تحديث وتنظيم التقويم الخاص بك",
                "إزالة النباتات الميتة وتنظيم الأواني",
                "تنظيم البضائع الجافة (البهارات) وتنظيف البضائع منتهية الصلاحية",
                "تنظيم وتسمية حاويات وأرفف التخزين",
                "تأمل لتنقية عقلك"
            ]
        },
        {
            "challenge_name": "الإنتاجية",
            "challenge_description": "الإنتاجية الجيدة يمكن أن تساعدك على تحديد أهداف أفضل , وتكون أكثر فاعلية , وتزيد من التركيز وتعزز الدافع.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "رتب سريرك في الصباح حتى لا تتأثر بالعودة إلى السرير",
                "اكتب 3 أشياء تشعر بالامتنان لها كل يوم",
                "تنظيم مساحة مزدحمة لتحسين مكان العمل",
                "قضاء وقت أقل على الهاتف وزيادة الإنتاجية",
                "استخدم مخططًا يوميًا لتحقيق كل ما خططت له",
                "قم بإيقاف تشغيل الإشعارات غير الضرورية على الهاتف لتجنب التشتيت",
                "إنشاء خطة وجبات للأسبوع بأكمله",
                "قم بإعداد قائمة مهام وحاول إكمال جميع المهام",
                "يمكنك المشي لمدة 30 دقيقة للحصول على بعض الهواء النقي والشعور بالحماس لغزو العالم",
                "صندوق البريد الإلكتروني Declutter. في بعض الأحيان قد يكون مربكًا بعض الشيء",
                "تمرن لمدة 30 دقيقة حتى لو لم تفعل أي شيء خلال اليوم , ستشعر بإنتاجية فائقة بعد التمرين",
                "اقرأ فصلًا من كتاب قبل النوم لتتذكر وسائل التواصل الاجتماعي",
                "تجنب مشاهدة التلفزيون حتى يكون لديك المزيد من الوقت لنفسك",
                "نظِّم خزانة ملابسك وتبرَّع بالأشياء التي لا تريدها بعد الآن",
                "أنشئ قائمة تشغيل موسيقى بأغانيك المفضلة وخط رقص لا يراقبك أحد",
                "لا تتحقق من هاتفك مباشرة بعد الاستيقاظ والاستمتاع بصباح بطيء وهادئ",
                "تأمل لمدة 10 دقائق وسوف تشعر بالانتعاش",
                "تنظيم مخزنك والثلاجة.",
                "نظف غرفتك بعمق. أفسح المجال , صافية الذهن",
                "قم بإلغاء اشتراك الأشخاص الذين لا يجلبون لك السعادة بعد الآن. ستشعر براحة أكبر",
                "حدد فترة راحة خلال اليوم لقضاء بعض الوقت للاسترخاء",
                "استيقظ في وقت أبكر من المعتاد. يبدأ الأشخاص الناجحون يومهم مبكرًا.",
                "قراءة الكتب التحفيزية والملهمة تساعدك على استعادة إيمانك بنفسك",
                "توقف عن محاولة تعدد المهام",
                "ضع قائمة بالأشياء التي تريد التوقف عن فعلها",
                "تحرك. امش. تمدد. اجلس مستقيما",
                "اكتب الأفكار التي تظهر في ذهنك , ولكن لا تبدأ في العمل عليها. حددها",
                "استمتع بوجبة فطور صحية لتحصل على الطاقة لتكون أكثر إنتاجية طوال اليوم",
                "عندما تنتهي من شيء ما , مهما كان صغيرا , اكتبه",
                "مندوب. ليس عليك أن تفعل كل شيء"
            ]
        },
        {
            "challenge_name": "السعادة",
            "challenge_description": "تُظهر الدراسات العلمية أن السعادة مرتبطة بمجموعة من الفوائد , بما في ذلك زيادة الإنتاجية وإبداع أكبر ومرونة أقوى في مواجهة الإجهاد.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "اكتب الأشياء التي تحبها في نفسك",
                "ابتسم لكل من مررت به",
                "قم ببعض التمارين",
                "اطبخ العشاء",
                "عانق شخصًا تحبه",
                "شاهد فيلم كوميدي",
                "تحدث مع صديق",
                "أرقص و كأن لا أحد يشاهد",
                "اخرج إلى الطبيعة وكن مستكشفًا ليوم واحد",
                "شراء هدية لشخص تحبه",
                "جرب ممارسة اليوجا",
                "اخلد إلى النوم مبكرًا واستيقظ مبكرًا أيضًا",
                "اقرأ شيئًا ملهمًا",
                "تأمل لمدة 10 دقائق",
                "التخطيط لعطلة مستقبلية",
                "جرب وصفة جديدة أو اطبخ وجبتك المفضلة",
                "مشاهدة غروب الشمس الجميل",
                "تواصل مع صديقك القديم",
                "اغفر لشخص ما",
                "جرب شيئًا جديدًا",
                "يذهبللتنزه في الخارج ",
                "استمع إلى أغنيتك المفضلة",
                "قم بعمل واحد صغير من اللطف أو ساعد صديقًا أو جارًا",
                "شارك الضحك مع شخص ما",
                "امنح أطفالك / والديك / أصدقائك / أشقائك عناقًا",
                "العب مع كلبك أو الحيوانات الأليفة الأخرى",
                "قضاء وقت أقل على هاتفك",
                "أخبر الناس كم يعنون لك",
                "تخلص من الأشخاص السامين والعادات",
                "فكر في رحلتك من اليوم الأول"
            ]
        },
        {
            "challenge_name": "تحدي الحرية المالية",
            "challenge_description": "أحد أهم فوائد الاستقلال المالي هو أنه يمنحك تحكمًا أكبر في حياتك.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "تحديد أهدافك المالية",
                "إنشاء ميزانية الشهر المقبل",
                "تطوير صندوق الطوارئ",
                "اكتشف المواقع والمدونات المالية",
                "الادخار للتقاعد",
                "ابحث عن مدونات فيديو للتثقيف المالي على Youtube",
                "اعتماد بساطتها",
                "اشتر كتابًا ماليًا وابدأ في قراءته",
                "فكر في حياتك المهنية",
                "أتمتة أموالك",
                "مراقبة درجة الائتمان الخاصة بك",
                "ضع ميزانية لأموالك",
                "ابحث عن طرق لخفض فاتورة مشترياتك",
                "تعلم كيفية حساب النسبة المئوية",
                "استكشف طرقًا لتحقيق دخل إضافي",
                "بيع ما لا تحتاجه / استخدمه",
                "اقرأ المزيد عن الاستثمار",
                "ابحث عن استراتيجية لمنع الإنفاق العاطفي",
                "يوم أقل إنفاقًا",
                "اكتب خطة توفير للمشتريات المستقبلية",
                "ابحث عن طرق لخفض الفواتير",
                "اقرأ عن إدارة الأموال",
                "تعلم شروط التمويل الأساسية",
                "تعرف على كيفية عمل بطاقات الائتمان",
                "اكتب خطة لسداد الديون",
                "ابحث عن طرق لتقليل إنفاقك غير الضروري",
                "أتمتة فواتيرك",
                "احتفل بتقدمك",
                "اشترك في دورة محو الأمية المالية",
                "ابق على طريق الحرية المالية"
            ]
        },
        {
            "challenge_name": "تربية أبوية إيجابية" ,
            "challenge_description": "ممارسة الأبوة والأمومة الإيجابية هي دليل أساسي بين الآباء والأطفال للحصول على نتائج تنموية إيجابية مثل احترام الذات , والثقة , والكفاءة الذاتية , وتعزيز الترابط بين الآباء والأطفال , وتدفق أفضل وفعال للتواصل." ,
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "افعل شيئًا مع طفلك تعرف أنه يحبه" ,
                "اسأل طفلك عن مفضلاته" ,
                "اصنع حرفة يدوية مع الأطفال مثل لوحة الفراشة الورقية لدينا" ,
                "اقضِ 30 دقيقة على الأقل من الوقت مع طفلك" ,
                "قراءة قصة وقت النوم" ,
                "تمشوا معًا" ,
                "احضن طفلك أربع مرات اليوم" ,
                "اطبخ شيئًا لطفلك يحبه" ,
                "التقط بعض الصور معًا أو حتى اصنع كشك تصوير DIY" ,
                "اسأل طفلك عن الشيء المميز الذي يرغب في القيام به" ,
                "اصطحبهم إلى مكانهم المفضل" ,
                "اصنعوا صندوقًا سعيدًا معًا" ,
                "اكتبوا قصة معًا. اجعلي طفلك يرسم صورًا" ,
                "اصنعوا بصمات اليد معًا" ,
                "علم طفلك كيفية القيام بشيء جديد اليوم" ,
                "علم طفلك عن المال" ,
                "شغّلوا بعض الموسيقى وارقصوا معًا" ,
                "اصنع لعبة لوحة عائلية" ,
                "احصل على هدية صغيرة لهم وأخفيها في المنزل ليجدوها" ,
                "اخبز المافن أو اطبخ الفطائر واصطحبها إلى أحد الجيران" ,
                "اصنعوا بطاقة للوالد الآخر معًا" ,
                "تحدث بأشياء إيجابية على طفلك اليوم" ,
                "اسألهم عن رأيهم" ,
                "اسأل حيوانهم المفضل وقم بمشروع ممتع معًا" ,
                "علم طفلك مهارة حياتية" ,
                "انطلق في نزهة في الطبيعة. اجمع العناصر من قائمة" ,
                "لديك يوم ملون. البس اللون , وتناول الأطعمة الملونة." ,
                "قم بعمل حرفة ممتعة للأجداد" ,
                "العب بعجين اللعب معًا. شاركوا في مسابقات القولبة" ,
                "اسأل طفلك عن ذاكرته المفضلة. خطط للقيام بذلك مرة أخرى"
            ]
        } ,
        {
            "challenge_name": "التغلب على الاكتئاب",
            "challenge_description": "يرشدك هذا التحدي للتغلب على الاكتئاب ويذكرك أن هناك أملًا كبيرًا في الشفاء. الاكتئاب قابل للعلاج بشكل كبير. سيتعافى الكثير من الأشخاص الذين يعانون من الاكتئاب تمامًا. يجد البعض الآخر قدرًا من الراحة من أعراضهم. المعركة هي يستحق كل هذا العناء - القدرة على الازدهار في الحياةه بعد الاكتئاب هناك. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "اللمس مهم جدًا في علاج الاكتئاب. قم بضرب الحيوانات الأليفة , وعانق الأصدقاء والعائلة , واستأنف الجنس مع شريكك أو احصل على تدليك.",
                "اخرج لمدة 15 دقيقة من النشاط البدني. حاول الجري. نظف الفناء. تمش مع حيوانك الأليف.",
                "النظام الغذائي يمكن أن يلعب دورًا كبيرًا في المساعدة في تخفيف الاكتئاب. تأكد من تناول الطعام بشكل جيد ومنتظم , حتى لو لم تكن لديك شهية",
                "الحصول على قسط كاف من النوم",
                "ابتسم وغير وضعيتك لتغيير شعورك",
                "اقرأ الأمثلة الإيجابية لكيفية تغلب الناس على مشاكل الصحة العقلية واعلم أن ذلك ممكن بالنسبة لك أيضًا.",
                "انسى المستقبل والماضي. اسأل نفسك الآن , هنا في هذه اللحظة بالذات ما هو الخطأ؟ ",
                "أكمل الفيتامينات الخاصة بك لزيادة هرمونات السعادة. كما أن نقص فيتامين ب 3 وفيتامين د , المصنوع في الجلد عن طريق أشعة الشمس , مرتبط أيضًا بالاكتئاب",
                "استمع إلى صوتك الداخلي. هل هو قاس أم حرج؟ هل تعامل الآخرين بنفس الحكم؟ هل هذه الأفكار مدمرة أم مدمرة؟",
                "تأكد من الخروج كل يوم لأن ضوء النهار وأشعة الشمس تزيد من السيروتونين وهذا ضروري لفيتامين د",
                "لا تخجل. قد تتفاجأ بمعرفة عدد الأشخاص الذين يعانون من الاكتئاب بصمت. تحدث مع عائلتك وأصدقائك.",
                "قطع العلاقات المؤذية",
                "اقضِ وقتًا مع حيوانك الأليف",
                "أنت أقوى من اكتئابك",
                "استمع إلى الموسيقى كل يوم",
                "افعل أشياء كانت تجعلك سعيدًا في يوم من الأيام على الرغم من أنك لا تشعر بذلك",
                "تجنب العزلة",
                "الضحك هو ترياق مهم للاكتئاب",
                "افعل ما تحب",
                "تجنب الكحول والمخدرات",
                "ابحث عن فرصة تطوع كوسيلة لتشعر بوحدة أقل",
                "اعرف متى تنخرط أو تنفصل عن عالم الإنترنت",
                "ابحث عن شيء تتطلع إليه",
                "افعل عكس ما يوحي به صوت الاكتئاب ",
                "ابحث عن طرق صغيرة لتكون في خدمة الآخرين",
                "لا تفكر مليًا في المشكلات , بل ركز على الحل الصحيح بدلاً من ذلك",
                "لديك أهداف عملية لتمنحك قدرًا كبيرًا من الإنجاز",
                "كن ممتنًا ولاحظ 3 أشياء جيدة كل يوم",
                "اطلب من أحد أفراد أسرتك أن يراجعك بانتظام.",
                "تحدى الأفكار السلبية"
            ]
        }
    ]
}