{
    "all_challenges": [
        {
            "challenge_name": "Pamahalaan ang hamon ng pagkabalisa",
            "challenge_description": "Bawasan ang pag-aalala at mas i-enjoy ang buhay sa aming napatunayang hamon. Sabihin ang oo para hamunin ang iyong sarili at gaganda ang pakiramdam mo sa loob ng isang buwan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Alagaan mo ang iyong sleeping routine.",
                "Okay lang na humingi ng tulong.",
                "Aminin mo ang iyong nararamdaman.",
                "Manalangin at humingi ng patnubay sa Diyos.",
                "Isulat mo ang iyong damdamin.",
                "I-visualize ang isang bagay na nagbibigay inspirasyon.",
                "Itigil ang mga pattern ng negatibong pag-iisip.",
                "Hanapin ang mga positibo sa buhay.",
                "Magkaroon ng self compassion para sa iyong sarili at sa iyong pagkabalisa.",
                "Suriin ang ugat ng anumang negatibong kaisipan.",
                "Lakasan mo ang loob mo para harapin ang isang bagay na iniiwasan mo.",
                "Okay lang magkaroon ng pagkabalisa. Kilalanin ang mga sintomas at alamin kung paano ito kontrolin.",
                "Ilista ang mga bagay na iniiwasan mo dahil sa iyong pagkabalisa. Ibahagi mo",
                "Palakasin ang isa sa iyong mga kakayahan sa pagkaya sa pamamagitan ng paggawa ng ilang pananaliksik",
                "Gumawa ng yoga routine sa Youtube partikular para sa pagkabalisa",
                "Magbasa ng isang bagay na mabuti para sa iyong kalusugang pangkaisipan",
                "Ayusin ang isang bagay na nasira ng iyong pagkabalisa",
                "Pumunta sa isang lugar na nakakapagpapahinga sa iyo at nagpapagaan ng pagkabalisa",
                "Kumain ngayon sa paraang masarap sa pakiramdam sa katawan, isip, at kaluluwa",
                "Gumawa ng isang bagay na makakatulong sa iyong mag-recharge kung saan sa tingin mo ay naubusan ka",
                "Gumugol ng 20 minuto sa pakikinig sa mga tunog ng kalikasan",
                "Siguraduhin na ang iyong mga social media feed ay walang pagkabalisa",
                "Magtrabaho ka sa iyong sarili, walang masamang salita na nakadirekta sa iyong sarili",
                "Gumawa ka ng full body scan. Saan mo ba hawak ang iyong pagkabalisa",
                "Tumuon sa pagtulog at pahinga at isang malusog na oras ng pagtulog",
                "Baguhin ang isang bagay sa iyong araw na magpapahusay sa iyong pagkabalisa",
                "Magsanay ng pag-iisip",
                "Mag-scroll sa camera roll ng iyong telepono. Kapag nakakita ka ng larawang nagpapangiti sa iyo, ibahagi ito sa kung sino pa ang nasa loob nito",
                "Abutin ang isang tao na sa tingin mo ay maaaring nahihirapan din sa pagkabalisa. Ang pag-uusap lamang tungkol dito ay makakatulong sa inyong dalawa",
                "Mag-check in gamit ang iyong layunin mula sa Araw 1. Ano ang iyong pag-unlad?"
            ]
        },
        {
            "challenge_name": "Maganda ang pakiramdam",
            "challenge_description": "Gumugol ng iyong oras na magpaparamdam sa iyo ng kaunti pang kahanga-hanga at kahanga-hanga sa pamamagitan ng pagsagot sa madamdaming hamon na ito.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Pag-isipan ang mga kamangha-manghang bagay na nagawa mo na ngayong taon.",
                "Tumuon sa pagiging positibo",
                "Gumawa ng listahan ng mga bagay na nagpapasaya sa iyo.",
                "Kumain ka ng paborito mong meryenda noong bata pa.",
                "Sumayaw sa paligid ng iyong bahay.",
                "Subukan mong uminom ng 8 basong tubig.",
                "Manood ng paborito mong pelikula.",
                "Bigyan ng pagbabago ang iyong silid-tulugan/lugar ng trabaho",
                "Panoorin ang paglubog ng araw/pagsikat ng araw habang nakikinig sa iyong mga paboritong kanta",
                "Gumawa ng masustansyang pagkain",
                "Bumili ng isang bagay na talagang gusto mo (tsokolate, bulaklak...)",
                "Gumawa ng mabuti para sa isang tao",
                "Gumawa ng sarili mong playlist na may mga kantang nagdudulot sa iyo ng kagalakan",
                "Mag-stargaze hangga't maaari",
                "Mag-order ka ng iyong paboritong pagkain at ituring ang iyong sarili",
                "Maglakad-lakad",
                "Gumawa ka ng paboritong inumin sa bahay",
                "Makinig sa isang podcast tungkol sa isang bagay na interesado ka",
                "Magsama-sama ng isang palaisipan",
                "Manood ng pelikula mula sa iyong pagkabata",
                "Gumawa ng sarili mong pizza/paboritong pagkain",
                "Magpadala sa isang tao ng mensaheng 'Salamat' sa Messenger/WhatsApp",
                "Isuot mo ang iyong mga paboritong bagay ngayon.",
                "Matuto ng bagong salita",
                "Gumawa ng menu plan para sa linggo",
                "Tambay kasama ang iyong mga anak/kapatid",
                "Purihin ang 3 tao ngayon",
                "Sa wakas tapusin ang hindi natapos na proyekto",
                "Walang matamis, soda, o fast food ngayon",
                "Magplano ng isang masayang araw kasama ang iyong pamilya"
            ]
        },
        {
            "challenge_name": "Intensyonal na Pamumuhay",
            "challenge_description": "Magtiwala sa pang-araw-araw na maliit na hamon na ito ay magbabago sa iyong buhay upang maging pinakamahusay na bersyon ng iyong sarili",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Magdasal ka sa iyong paggising ngayon. Salamat sa Diyos sa bagong araw na puno ng mga pagkakataon.",
                "Magtakda ng intensyon o 3 layunin lang para sa araw",
                "Maging intensyonal sa mga salitang binibigkas mo sa iyong sarili at sa iba",
                "Sumulat ng listahan ng pasasalamat, subukang isama ito tuwing umaga/gabi",
                "Lumayo sa mga screen nang hindi bababa sa 1 oras bago matulog",
                "Magluto ng isang bagay na gusto mo at kumain ng iyong pagkain nang may pag-iisip nang walang abala",
                "Magkaroon ng sesyon ng pangangalaga sa sarili, maligo, doa facial mask at tamasahin ang bawat segundo ng proseso",
                "Kumuha ng 20 minutong journal tungkol sa iyong mga karanasan ngayong buwan",
                "Itago ang iyong telepono habang kumakain ka",
                "Ginagantihan ang iyong sarili kapag natapos mo na ang iyong mga gawain. Ito ay maaaring kasing simple ng pagbibigay ng oras sa iyong sarili upang gawin ang isang bagay na talagang kinagigiliwan mo",
                "Tumingin ka sa salamin at sabihin sa iyong sarili na maganda ka at kaya mo ang lahat",
                "Gumawa ng 15 minutong yoga/medtation session",
                "Makinig sa nakapagpapalakas na musika. Piliin na magkaroon ng mga kanta sa iyong playlist na magpapanatiling maganda sa iyong emosyon",
                "Ipahayag ang iyong pagkamalikhain ngayon. Gumuhit, magpinta, magsulat, sumayaw, gumawa ka lang ng isang bagay",
                "Maglakad sa kalikasan",
                "Gumawa ng malay-tao na pagpipilian upang gamitin ang social media nang matalino at may pag-iisip. Magtakda ng mga hangganan at piliin ang nilalaman na nakakaapekto sa iyong kagalingan sa positibong paraan",
                "Maglaan ng 10 minuto para isulat ang lahat ng bagay na gusto mong gawin at gumawa ng planong gawin kahit isa man lang sa mga ito sa susunod na buwan",
                "I-unfollow ang mga Instagram account na hindi mo na kinagigiliwan",
                "Hayaan ang iyong sarili na maglaan ng ilang minuto upang umupo at huminga. Maging sa sandaling ito",
                "Treat yourself with a slice of heaven. Pumunta sa paborito mong pastry shop, bumili ng paborito mo, umupo sa tahimik na lugar at tikman ang bawat kagat",
                "Bigyang-pansin ang iyong kalusugan sa pag-iisip. Maging intensyonal at magkaroon ng kamalayan sa iyong mga emosyon at estado ng pag-iisip. Huwag matakot na humingi ng tulong kapag kailangan mo ito",
                "Kumain at mag-enjoy sa pagkain ngayon nang walang anumang telepono o screen na naka-on",
                "Muling kumonekta sa isang tao. Gumawa ng plano kasama ang isang kaibigan sa Messenger, Facetime, WhatApp, o makipagkita para makahabol",
                "Makinig sa isang motivational speech sa Youtube",
                "Tingnan ang Habitualize blog",
                "Kumain ng 3 iba't ibang uri ng prutas ngayon",
                "Isulat ang 3 bagay na dapat gawin bukas",
                "Gumawa ng intuitive na paglalakad",
                "Magsulat ng isang journal sa loob ng 10 minuto o higit pa",
                "Malaki ang pangarap. Magtakda ng mga intensyon. Gumawa ng vision board"
            ]
        },
        {
            "challenge_name": "Matuto ng Bagong Wika",
            "challenge_description": "Ang pag-aaral ng bagong wika ay mapaghamong ngunit maaari rin itong maging masaya, simple at walang hirap. Ang pagsunod sa 30 araw na hamon sa pag-aaral ng wika ay magbibigay-daan sa iyo na palakasin ang iyong pag-aaral ng wika araw-araw.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Matuto ng 5 bagong salita",
                "Sumubok ng bagong app ng wika",
                "Manood ng pelikula sa wikang iyong natututuhan na may mga subtitle",
                "Magsulat ng mga listahan ng pamimili/gawin sa iyong target na wika",
                "Turuan ang isang tao ng ilang mga salita at parirala",
                "Itanong mo 'Kamusta ka?' sa kaibigan",
                "Manood ng tutorial para sa isang bagay sa wika",
                "Isulat ang tungkol sa iyong karanasan ngayon",
                "Magsalaysay ng isang bagay na iyong ginagawa",
                "Manood ng Youtube video tutorial tungkol sa wika",
                "Turuan ang isang tao ng 5 bagong salita",
                "Alamin ang pangunahing gramatika",
                "Journal sa iyong target na wika",
                "Magbasa ng isang artikulo ng balita",
                "Makipag-usap sa isang tao o sa iyong alagang hayop",
                "Palitan ang setting ng iyong telepono para sa isang araw",
                "Sumulat ng pagsusuri para sa isang aklat/pelikula",
                "Magbasa ka",
                "I-record ang iyong sarili sa pagsasanay ng wika",
                "Sumulat ng 40 salita na iyong natutunan",
                "Isulat kung paano nakatulong sa iyo ang hamon na ito",
                "Naaalala mo pa ba ang mga salitang natutunan mo noong Day 1?",
                "Sagutin ang isang online na pagsusulit sa target na wika",
                "Turuan ang isang miyembro ng pamilya ng 7-10 bagong salita",
                "Sumulat ng 50 salita na iyong natutunan",
                "Sumulat ng isang bagay tungkol sa iyong araw",
                "Makinig sa isang kanta sa wika",
                "Magsulat ng kwento",
                "Makinig sa podcast",
                "Gumawa ng mga flash card upang madaling maisaulo ang mga salita"
            ]
        },
        {
            "challenge_name": "Mindfulness Challenge",
            "challenge_description": "Nakakatulong ang pagsasanay sa mindfulness na i-reset ang iyong isipan at magkaroon ng malinaw na pananaw kapag hindi nakapokus o nakakaramdam ng labis sa buhay",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Bago gawin ang anumang gawain ngayon, tanungin ang iyong sarili kung ano ang iyong dahilan sa paggawa ng gawain at pag-isipan ito ng ilang sandali",
                "Mindful shower. I-visualize ang paghuhugas ng iyong mga negatibong kaisipan at tumutok sa pakiramdam ng tubig sa iyong balat",
                "Bago matulog, isulat ang 3 bagay na talagang pinahahalagahan mo mula sa araw",
                "Magsanay ng pasasalamat. Magsimulang tumuon sa mga positibong kaisipan at bitawan ang iyong nakakatakot, nababalisa na pattern ng utak",
                "I-reset ang iyong postura sa tuwing uupo ka, dahan-dahang ituwid ang iyong likod",
                "Mag-ehersisyo ngayon at tumuon sa mga pisikal na sensasyon",
                "Magsanay ng aktibong pakikinig ngayon. Nangangahulugan ito na tumuon sa sinasabi ng ibang tao at tumugon sa paraang naaangkop",
                "Magsagawa ng body scan. Dalhin ang iyong atensyon sa iyong katawan at ipadala ang hininga sa anumang lugar ng pag-igting",
                "Humanap ng mapayapang lugar kung saan maaari kang umupo at isulat ang anumang nararamdaman mo sa ngayon",
                "Maging mausisa ngayon. Magsanay na maging interesado sa kung ano ang nangyayari at ilagay ang iyong pansin sa pag-aaral ng higit pa tungkol dito",
                "Pansinin ang iyong pakiramdam kapag nakatikim ka, nahawakan, naaamoy at nakarinig ng isang bagay",
                "Maingat na paghinga. Huminga sa loob, hawakan ng 3 segundo at pagkatapos ay huminga",
                "Maglakad nang may pag-iisip. Kumuha ng paninindigan upang pakiramdam na konektado sa lupa at matatag na nakaugat sa lupa",
                "Uminom ng maalalahanin na tasa ng tsaa. Tumutok sa lasa, amoy at init",
                "Magsanay ng hindi mapanghusgang pakikinig habang nakikipag-usap",
                "Gawin ang isang bagay sa isang pagkakataon at tumuon lamang doon",
                "Umupo nang kumportable, pakiramdaman ang iyong mga paa ay mahigpit na nakatukod sa sahig, tuwid na likod at mga kamay sa iyong kandungan. Tumutok sa paghinga saglit",
                "Makinig sa iyong sarili na sumasagot sa telepono o habang nakikipag-usap ka, ang paraan ng iyong pagsasalita, ang mga salitang pinili mo",
                "Pahalagahan ang lahat ngayon. Pansinin ang lahat ng nangyayari at humanap ng paraan para pahalagahan ito",
                "Pagmasdan nang mabuti. Ilarawan sa isip ang isang bagay sa mga detalye, ang kulay, texture, hugis...",
                "Umupo sandali sa isang maaliwalas at tahimik na lugar",
                "Gawin ang isang gawain sa isang pagkakataon at panatilihin ang iyong pagtuon sa anumang iyong ginagawa",
                "Magsanay ng empatiya sa isang taong karaniwan nang nagpapasama sa iyo",
                "Maghanap ng artikulo o video tungkol sa kung bakit ang mga pagkakamali at kabiguan ay mabuti para sa iyo. Isapuso mo ito para mas kaunting oras ang iyong pagtutuunan ng pansin sa nakaraan",
                "Kumain nang may pag-iingat. Tikman ang ulam at subukang hulaan kung ilang sangkap ang napasok dito",
                "Tumingin ka sa paligid mo. Tumingin sa isang partikular na dahon/puno/bulaklak at ituon ang iyong atensyon",
                "Maghanap ng mga nakakatawang pelikula, magkwento ng mga nakakatawang biro, makinig sa mga nakakatawang tao . Tumawa hangga't maaari ngayon",
                "Sulitin ang mga oras na kailangan mong maghintay at maging maingat sa pamamagitan ng pagtutok sa iyong sentido at paghinga",
                "Brush your teeth with your non-dominant hand today to help encourage attention",
                "Palaging suriin ang Habitualizer App at paalalahanan na maging maingat sa lahat ng oras"
            ]
        },
        {
            "challenge_name": "Oras ng Pamilya",
            "challenge_description": "Ang oras ng pamilya ay nag-aalok ng maraming benepisyo, kabilang ang pagbuo ng kumpiyansa, paglikha ng mas matibay na ugnayang emosyonal sa pagitan ng mga miyembro ng pamilya, pagpapabuti ng mga kasanayan sa komunikasyon, mas mahusay na pagganap sa paaralan at nabawasan ang mga isyu sa pag-uugali, pati na rin ang pagbibigay ng pagkakataon na gumawa ng mga alaala na binuo sa kasiyahan, tawanan at pagsasama",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Hilingan ang iyong mga anak na magbahagi ng isang uri ng bagay na kanilang ginawa ngayon o planong gawin. Ibigay muna ang iyong mga plano",
                "Turuan kayo ng mga bata ng card trick o card game, o maglaro ng isa na pareho kayong nag-eenjoy",
                "Pumili ng landmark, lungsod, o bansa na kinagigiliwan ng iyong anak at gumugol ng oras sa pagtuklas dito sa pamamagitan ng Youtube o Facebook",
                "Gumawa ng espesyal na hapunan. Maglagay ng sariwang bulaklak sa mesa, magsindi ng kandila, at maglaan ng ilang sandali upang ipahayag ang pasasalamat na kayo ay isang pamilya",
                "Kumuha ng larawan ng pamilya",
                "Pumunta sa simbahan at manalangin nang sama-sama",
                "Pelikulang pampamilya at gabi ng pizza",
                "Gumuhit ng mga larawan ng bawat isa",
                "Sabay luto ng hapunan",
                "Maglaro ng 'gusto mo'ng magkasama",
                "Gumawa ng puzzle nang magkasama",
                "Maghurno ng cake o cookies para sa iyong pamilya",
                "Magplano ng piknik ng pamilya",
                "Maglaro ng mga video game nang magkasama",
                "Kumanta ng mga kanta sa karaoke nang magkasama",
                "Sabay-sabay kayong maglakad pagkatapos ng hapunan",
                "Maglaro ng board game nang magkasama",
                "Magplano ng paglalakbay o bakasyon",
                "Mag-ukit ng espesyal na oras para sabihin sa iyong anak ang mga biro. Tawanan mo rin siya",
                "Magluto ng espesyal na hapunan para sa iyong pamilya",
                "Gumawa ng bucket list ng pamilya",
                "Tumingin sa mga lumang larawan ng pamilya o manood ng mga lumang video",
                "Maglakad-lakad/magkasama",
                "Manood ng pagsikat (o paglubog ng araw) nang magkasama",
                "Gumugol ng 15 minuto sa bawat miyembro ng pamilya",
                "Bisitahin ang isang nature center at pahalagahan ang kagandahan nito",
                "Attend sa extra curricular activities ng iyong anak",
                "Hikayatin ang iyong mga anak sa kanilang mga libangan",
                "Surpresahin ang iyong mga anak sa isang paglalakbay o masayang aktibidad",
                "Lagi mong sabihin sa kanila kung gaano mo sila kamahal"
            ]
        },
        {
            "challenge_name": "Umalis sa iyong comfort zone",
            "challenge_description": "Ipatupad ang hamon na ito ay magdadala sa iyo upang maging mas malakas na tao, magkakaroon ka ng tiwala sa sarili sa pamamagitan ng mga karanasan, tulungan kang ipagpatuloy ang iyong personal na pag-unlad, at magkaroon ng pagkakataong makakilala ng mga bagong tao.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Bumangon ka ng 1 oras bago ka makasanayan",
                "Sabihin hi!' sa isang random na estranghero",
                "Huwag pumunta sa social media o manood ng TV sa loob ng 24 na oras",
                "Maglakad sa isang tao sa trabaho at bigyan sila ng isang tunay na papuri",
                "Makipag-ugnayan sa isang taong matagal mo nang hindi nakakausap",
                "Tumuha ng ibang ruta habang papasok sa trabaho/paaralan",
                "Magkaroon ng mahirap na pakikipag-usap sa isang tao tungkol sa isang paksang iniiwasan mo",
                "Bumili ng isang bagay na hindi mo kailanman bibilhin sa grocery store",
                "Simulan ang pag-aaral ng bagong wika",
                "Lumakad sa estranghero, ngumiti, at bigyan sila ng papuri",
                "Humingi ng tulong kung kailangan mo ito o tumulong sa isang tao nang hindi nila hinihiling",
                "Gumawa ng mga plano para sa katapusan ng linggo o para sa dayoff",
                "Subukan ang isang bagong libangan/isport na noon pa man ay gusto mo na rin",
                "Magsimula ng pakikipag-usap sa isang estranghero",
                "Subukan ang digital detox ngayon",
                "Gumawa ng vision board (makakuha ng inspirasyon sa Pinterest)",
                "Isama ang iyong sarili sa isang petsa",
                "Magtanong sa isang taong nakikipag-date/kumupuri sa isang taong nananakot sa iyo",
                "Magsimula ng isang blog/youtube channel/ Instagram page/ isang libro, anuman ang naisin ng iyong puso",
                "Pumunta sa isang bagong lugar upang kumain o dalhin sa labas",
                "Magsimula ng bagong hamon kasama ang isang kaibigan (maaari kang gumamit ng isa mula sa app na ito o gumawa ng sarili mo)",
                "Sumubok ng bagong ehersisyo (zumba, yoga, pilates, kickboxing, atbp)",
                "Bigyan ang isang tao ng kusang regalo",
                "Mag-sign up para sa isang bagong bagay",
                "Tumuha ng bagong ruta pauwi/trabaho/paaralan",
                "Matulog ka ng mas maaga kaysa sa inaasahan",
                "Paglalakbay sa isang bagong lugar",
                "Pagbuo ng bagong kasanayan",
                "Magpadala ng 5 mensahe ng pasasalamat sa 5 tao",
                "Subukan ang bagong hitsura"
            ]
        },
        {
            "challenge_name": "Maghanap ng Inner Peace",
            "challenge_description": "Inner peace calms our mind and allow us to see our path much clearer, helping us focus and keep track of our goals.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Subukan ang aromatherapy. Ang pabango ay maaaring pukawin ang matingkad at makatotohanang mga alaala. Kapag may naaamoy tayong masarap, nakakarelax tayo",
                "Magplano para bukas. Ito ay hindi lamang nagbibigay sa iyo ng mas maraming oras sa umaga, ngunit ito rin ay ginagawang mas kalmado at mas simple ang iyong buhay, na nagbibigay-daan sa iyo upang magplano nang maaga",
                "Sa ating abala at nakakagambalang buhay, madaling kalimutan ang tungkol sa pagpapakita ng pagpapahalaga sa mga taong nakakasalamuha natin araw-araw. Maglaan ng ilang oras upang ipakita ang pasasalamat sa mga taong nakapaligid sa iyo",
                "Subukan mong kumain ng kung ano-ano at tumutok sa iyong limang pandama. Talagang tumutok sa bawat pandama, panlasa, amoy, hawakan at paningin.",
                "Mag-declutter ng espasyo sa iyong tahanan. Ito ay isang landas sa pagpapagaling ng mga emosyonal na bloke at pagkalito sa loob. Lumikha ng isang kalmado, mapayapang kapaligiran",
                "Smile in the mirror. This may seem ridiculous, but it has many benefits to your well being. It slows the heart, relaxes the body and releases hormones to counteact stress",
                "Huminga ng malalim at ipikit ang iyong mga mata. Ilista sa isip ang 5 bagay na ipinagpapasalamat mo. Maaari nitong ilipat ang iyong mga iniisip mula sa negatibo patungo sa positibo",
                "Magtakda ng timer sa loob ng 60 segundo at tumuon lamang sa iyong paghinga. Pansinin kung ano ang tunog nito at kung ano ang pakiramdam ng iyong katawan",
                "Maligo ka. Magpahinga ka, patayin ang mga ilaw. Hayaang dumaloy ang tubig sa iyong katawan at tumuon sa mga sensasyon at init na iyong nararamdaman",
                "Gumawa ng ritwal ng tsaa o kape. Ang kailangan mo lang gawin ay magdahan-dahan. Bigyang-pansin ang iyong ginagawa at tikman ang lasa",
                "Kung ang iyong katawan ay tensiyonado sa buong araw, maglaan ng ilang sandali upang magpahinga. Huminga ng malalim, i-relax ang iyong mga balikat, at ibuka ang iyong panga",
                "Magtakda ng 3 pang-araw-araw na layunin. Ito ay isang mapapamahalaang numero at nagbibigay-daan sa iyo ng oras at lakas ng pag-iisip na kailangan na tumuon sa mga ito nang maingat at lubusan",
                "Subukan ang 4 na minutong pagmumuni-muni. Magtakda ng 4 na minutong alarma sa iyong telepono, umupo nang kumportable, ipikit ang iyong mga mata, at huminga nang natural. Kung ang iyong isip ay nagsimulang gumala, ibalik ito sa iyong paghinga",
                "Yakapin ang isang tao ng mahigpit at huminga nang sabay-sabay ng 3 malalaking paghinga. Ang paghinga ay magpapabagsak sa iyo",
                "Magpahinga ka sa digital. Huwag umasa sa iyong mga digital na device bilang pinagmumulan ng kaginhawahan. Lumilikha ito ng maling pakiramdam ng pagkaapurahan at nag-iiwan sa amin na parang may nawawala sa amin",
                "Sa halip na husgahan kung ano ang sinasabi ng isang tao, makinig sa kanila, at bigyang pansin ang sinasabi",
                "Napakakalma ng paglalakad ang katawan, isip at espiritu. Magsimula sa paghahanap ng angkop na lokasyon. Pagmasdan ang kapaligiran sa paligid mo, huminto at tumutok sa mga puno, mga dahon at lupang iyong nilalakaran",
                "Tumuon sa sandali. Ang pangunahing tip ay ihinto ang paghahambing ng kasalukuyan sa nakaraan at tumuon sa kung ano ang nangyayari sa kasalukuyan. Ito ay maaaring kasing simple ng pagtutuon ng iyong pansin sa isang gawain na iyong ginagawa",
                "Tumayo ka at huminga. Pakiramdam ang iyong koneksyon sa lupa",
                "I-scan ang iyong katawan at mapansin ang mga piskal na sensasyon o emosyon. Ilabas ang anumang hindi kasiya-siyang sensasyon, emosyon o damdamin sa labas ng hininga. Pansinin ang anumang kaaya-ayang damdamin at punan ang mga ito sa iyong hininga",
                "Idirekta ang iyong pansin sa kung ano ang iniisip mo sa kasalukuyan. Ang pagiging kamalayan sa iyong aktibidad sa pag-iisip ay makakatulong sa iyong magkaroon ng pananaw sa iyong mga iniisip",
                "Kilalanin ang iyong sarili at Mahalin ang iyong sarili",
                "Iwasan ang mga negatibong bagay",
                "Kilalanin at bitawan ang mga salik na pumipigil sa iyong kapayapaan",
                "Ipikit mo ang iyong mga mata kapag galit ka",
                "Huwag kang magmalasakit sa iniisip ng iba sayo",
                "Ang kapayapaan ay dumarating sa pamamagitan ng pamumuhay ng isang makabuluhang buhay",
                "Lagi kang magdasal pagkagising mo sa umaga at bago matulog",
                "Resolbahin ang mga tunggalian ng iyong buhay",
                "Tanggapin ang mga limitasyon upang pasiglahin ang katatagan"
            ]
        },
        {
            "challenge_name": "Gabi na Routine",
            "challenge_description": "Mga resulta ng nakagawiang gabi ng pagkakaroon ng sapat na oras ng pagtulog, magkakaroon ka ng mas matalas na pokus at mas mataas na antas ng enerhiya para sa isang produktibong araw pagdating ng umaga",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Pagnilayan ang araw. Sumulat ng kahit isang bagay na naging maganda",
                "Maglaan ng ilang sandali upang makipag-usap sa Diyos sa pamamagitan ng panalangin. Buksan ang iyong puso sa kanya, ilabas ang lahat ng nasa isip mo, at pasalamatan siya sa lahat ng nangyari sa maghapon. Ito ay isang mahusay na paraan upang hindi lamang isagawa ang pasasalamat, ngunit upang manatili din. konektado sa Diyos.",
                "Maglaan ng ilang sandali upang pag-isipan kung ano ang dapat mong gawin sa susunod na araw at magplano nang naaayon.",
                "Kumuha ka ng papel at isulat kung ano ang nasa isip mo. Nangangahulugan lamang ito na maaari kang matulog nang hindi na kailangang mag-alala tungkol sa kung ano ang iyong gagawin bukas dahil nakasulat na ito",
                "Magkaroon ng magandang kapaligiran sa pagtulog. Panatilihin ang silid sa isang magandang temperatura, gumamit ng mga blackout na kurtina o isang sleeo mask upang harangan ang liwanag",
                "Magsulat ng isang journal. Maglaan ng oras upang i-pause at magmuni-muni",
                "Magsindi ng ilang mabangong kandila at magpatugtog ng nakakarelaks na playlist",
                "Gumawa ng ilang stretching/yoga bago matulog",
                "Sumulat ng listahan ng pasasalamat",
                "Magbasa ng magandang libro bago matulog. Tumutulong sa iyong makapagpahinga at makatulog nang mas maayos.",
                "Planohin ang iyong mga gawain sa susunod na araw, pagkain, damit, ...",
                "Magpadala ng isang espesyal na magandang gabi para i-text ang isang taong mahal mo",
                "Maligo ka ng mainit na tubig o maligo",
                "Iwasan ang caffeine, alkohol, o asukal nang hindi bababa sa 3 oras bago matulog",
                "Magnilay/magdasal. Mag-isa ka lang sa iyong mga iniisip",
                "Ayusin ang iyong lugar. Mas magiging kalmado at nakakarelaks ka",
                "Kumain ng magaan na hapunan bago matulog",
                "Magtakda ng mga intensyon para bukas",
                "Mag-diffuse ng ilang essentails na langis para mapaganda ang kalidad ng iyong pagtulog",
                "Iwasang magsuri ng mga email, balita, mag-aral ng trabaho bago matulog",
                "Huwag matulog nang gutom. Kumain ng almond, saging o sinigang para makatulog ka ng maayos",
                "Iwasan ang iyong telepono nang hindi bababa sa 1 oras bago matulog",
                "Uminom ng ilang camomile tea o iba pang herbal tea (decaffeinated) bago matulog",
                "Maligo o mag-shower nang mga isang oras o dalawa bago ang oras ng pagtulog ay maaaring gumawa ng mga kababalaghan upang matulungan kang mag-relax sa oras ng pagtulog",
                "Siguraduhing uminom ng tubig bago matulog. Nawawalan tayo ng moisture kapag natutulog tayo. Mahalagang mag-hydrate ng maayos ",
                "Magsipilyo sa loob ng 2 minuto",
                "Isipin ang iyong huling 24 na oras at isulat ang kahit isang bagay na naging maganda",
                "Isulat ang mga pangunahing priyoridad para bukas sa isang planner o notebook.",
                "Bawasan ang pagkabalisa gamit ang Listahan ng Gagawin",
                "Laging magdasal bago matulog at patawarin ang iyong sarili"
            ]
        },
        {
            "challenge_name": "Positibong Pagpapatibay",
            "challenge_description": "Ang hamon na ito ay maaaring makatulong na palakasin ang pagpapahalaga sa sarili sa pamamagitan ng pagpapalakas ng iyong positibong opinyon sa iyong sarili at ang iyong pagtitiwala sa iyong kakayahang makamit ang iyong mga layunin. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Tinatanggap ko ang mga posibilidad at potensyal ng araw na ito",
                "Piliin kong maging masaya at mahalin ang sarili ko ngayon",
                "Handa akong magbago at umunlad",
                "Tinatanggap ko ang mga karanasan sa labas ng aking comfort zone",
                "Ako ay may talento at matalino",
                "Ang mga hamon ay nagdudulot sa akin ng mga pagkakataong lumago",
                "Nagtitiwala ako sa aking intuwisyon na gagabay sa akin",
                "Ako ay umiibig sa aking sarili at sa aking katawan",
                "Ako ay nasa kapayapaan sa aking nakaraan",
                "Magiging mabait ako sa aking sarili at sa iba ngayon",
                "Pinili ko ang pananampalataya kaysa sa takot",
                "Ngayon ay magiging isang positibong araw",
                "Nagpapasalamat ako sa lahat ng mayroon ako",
                "Ako ay higit pa sa aking mga negatibong iniisip",
                "Tinatanggap ko ang aking sarili nang walang kondisyon",
                "Ako ay malusog at masaya",
                "Lahat ng nangyayari ngayon ay nangyayari para sa aking tunay na ikabubuti",
                "Ako ang may hawak ng nararamdaman ko at ngayon pinipili ko ang kaligayahan",
                "Ngayon ay hindi ko ihahambing ang aking sarili sa mga estranghero sa Internet",
                "May kapangyarihan akong lumikha ng pagbabago",
                "Ang aking damdamin at iniisip ay wasto",
                "Ako ay may kasaganaan at panloob na lakas",
                "Handa akong makita ang mga bagay na may bagong pananaw",
                "Ako ay karapat-dapat sa pagmamahal at paggalang",
                "Ang aking isip ay malinaw, malakas at nakatuon",
                "Hinaharap ko ang araw nang may lakas at tapang",
                "Ako ay inspirasyon at motibasyon ng aking mga pangarap",
                "Karapat-dapat ako sa pinakamahusay at tanggapin ito ngayon",
                "Ako ay natatangi at tiwala",
                "Nakikita ko ang walang katapusang mga pagkakataon sa aking buhay"
            ]
        },
        {
            "challenge_name": "Araw-araw na Journaling",
            "challenge_description": "Ang journal ay nakakatulong na makontrol ang iyong mga sintomas at mapabuti ang iyong kalooban sa pamamagitan ng: Pagtulong sa iyong bigyang-priyoridad ang mga problema, takot, at alalahanin. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Sumulat tungkol sa isang taong nagbibigay inspirasyon sa iyo",
                "Sumulat ng tungkol sa 5 pagpapala sa iyong buhay",
                "Mag-post ng 30 katotohanan tungkol sa iyong sarili",
                "Anong ikinatuwa mo?",
                "Ano ang 3 aral na gusto mong matutunan sa iyo ng iyong mga anak/kaibigan/kapatid",
                "Sumulat tungkol sa kasalukuyang hamon",
                "Isulat ang mga solusyon sa mga problema",
                "Isulat ang gusto mong matutunan sa hinaharap",
                "Ilista kung ano ang gusto mo tungkol sa iyong mga magulang/pamilya",
                "Ano ang magiging hitsura ng iyong perpektong araw?",
                "Isulat ang lahat ng mga bagay na nais mong makamit sa taong ito",
                "Ano ang mas kailangan mo sa iyong buhay?",
                "Gumawa ng listahan ng mga bagay na gagawin mo kung hindi ka natatakot, at paano ito makakaapekto sa iyong buhay",
                "Anong payo ang ibibigay mo sa sampung taong gulang mo?",
                "Paano mo mapapaganda ang bukas?",
                "Isulat ang tungkol sa lahat ng bagay na nagpapakaba sa iyo at paano mo mababago iyon?",
                "Ano ang natutunan mo kahapon?",
                "Isulat ang tungkol sa isang nakaraang pakikibaka na napagtagumpayan mo. Paano ka nito pinalakas?",
                "Ano ang isang bagay na inaabangan mo ngayon?",
                "What brings you the most joy? How can you make more time for it?",
                "Ano ang kulang sa buhay mo? At paano mo mababago iyon?",
                "Sumulat tungkol sa isang oras na naramdaman mong ipinagmamalaki mo ang iyong sarili",
                "Kung mayroon kang 3 wish para sa taong ito, ano ang hiling mo?",
                "Ano bang nasa isip mo ngayon?",
                "Sumulat tungkol sa isang bagay o isang taong nami-miss mo",
                "Ano ang pinaka pinahahalagahan mo ngayon?",
                "Sumulat tungkol sa isang sandali sa iyong buhay na nagpapasaya sa iyo kapag iniisip mo ito",
                "Kung huminto ang buhay ngayon, ano ang pagsisisihan mong hindi mo ginawa?",
                "Paano mo gustong maalala ka ng mga tao at bakit?",
                "Anong mga aspeto ng iyong sarili ang kailangan mo para magpakita ng higit na pagmamahal?"
            ]
        },
        {
            "challenge_name": "Umaga sa Umaga",
            "challenge_description": "Ang pagkakaroon ng routine sa umaga ay maaaring magpapataas ng iyong enerhiya, pagiging produktibo at pagiging positibo.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Umupo o tumayo sa araw sa loob ng 20 minuto habang ginagawa mo ang iyong gawain sa umaga, kumakain ng almusal, nagsusuri ng balita, o nag-eehersisyo",
                "Pumili ng 3 Bagay na Gagawin Bago ang Tanghali",
                "Priyoridad ang Iyong Araw. Anong mga gawain ang inaasahan mong magawa ngayon?",
                "Ngayong umaga, maglaan ng ilang minuto upang pakinggan ang iyong mga iniisip at nararamdaman, kilalanin ang mga ito, at ilipat ang mga ito kung kailangan mo",
                "Sumulat ng listahan ng gagawin para sa araw na ito",
                "Makipag-ugnayan sa iyong pamilya at mga kaibigan o magpadala ng simpleng good morning text sa taong mahal mo",
                "Huminga ng Malalim at Magpasalamat sa Araw na Ito",
                "Sumulat ng 5 bagay na ipinagmamalaki mo sa iyong sarili",
                "Magnilay ng 15 minuto",
                "Uminom ng isang basong tubig bago mag-almusal",
                "Buksan ang iyong mga bintana para sa sariwang hangin at hayaang makapasok ang araw",
                "Maglakad o gumawa ng sesyon ng pag-eehersisyo sa bahay",
                "Basahin ang ilang mga kabanata ng iyong paboritong libro",
                "Gumawa ng 15 minutong yoga",
                "Makinig sa isang podcast o audiobook habang naghahanda ka",
                "Lumabas ka at langhap ang sariwang hangin sa umaga",
                "Gumawa ng listahan ng 3 bagay na gagawin para sa araw",
                "Iwasang tingnan ang mga balita sa umaga at social media",
                "Ayusin ang iyong higaan at ayusin ang iyong espasyo upang maging mas produktibo",
                "Pumili ng paninindigan upang gabayan ang iyong araw. Halimbawa:' 'Ang araw na ito ay isang magandang araw.'",
                "Maligo ka na at maghanda kahit wala kang pupuntahan",
                "Huwag suriin ang anumang anyo ng social media unang bagay sa umaga",
                "Pag gising mo, akitin mo ang magandang ideya na magkaroon ng good vibes buong araw",
                "Sumulat ng listahan ng pasasalamat sa umaga",
                "Makinig sa paborito mong playlist ng musika para maging maganda ang mood mo sa umaga",
                "Mag-stretch ka pagkatapos mong magising",
                "Gawin ang iyong sarili ng isang malusog at masarap na almusal",
                "Huwag Suriin ang Mga Notification Bago Mag-almusal",
                "Magpinta, magpatugtog ng instrumentong pangmusika. Gumawa ng isang bagay na magpapasigla sa iyong pagkamalikhain",
                "Gumising na may ngiti at positibong saloobin para sa susunod na araw"
            ]
        },
        {
            "challenge_name": "Positibong Mindset",
            "challenge_description": "Ang pag-iisip ng positibo ay isang ugali na maaari nating sanayin ang ating mga sarili na gawin. Ipinapakita ng pananaliksik na ito ay may positibong epekto sa kalusugan kapwa sa katawan at isipan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Magsanay kang ngumiti. Ngiti sa mga estranghero, sa salamin, ngumiti kung kaya mo. Mas magiging positibo ang pakiramdam mo",
                "Pahalagahan ang maliliit na bagay ngayon. Ang ngiti ng isang tao, ang paglubog ng araw, ang iyong kape sa umaga, ang init ng sinag ng araw, ang kalangitan",
                "Sa halip na isipin 'ang aking buhay ay kakila-kilabot', ang mga bagay ay hindi maganda sa sandaling ito, ngunit ito ay lilipas. Ang mas mahusay na mga araw ay darating",
                "Sa halip na isipin ang mga kakila-kilabot na bagay na maaaring mangyari, isaalang-alang ang magagandang bagay na maaaring magmula sa iyong kasalukuyang sitwasyon",
                "Sa halip na sabihing 'Sumuko na ako', sabihin mong 'mahirap ito ngunit patuloy akong magsisikap'",
                "Ihinto ang pag-aalaga sa kung ano ang iniisip ng ibang tao. Ang mga iniisip ng ibang tao ay hindi idinisenyo upang pasayahin ka at maging positibo",
                "Sa halip na isipin 'bakit ito nangyayari sa akin?', Isipin 'ano ang itinuturo nito sa akin?'",
                "Magtiwala na darating ang mas magagandang bagay kung bukas ka sa mga posibilidad'",
                "Sa halip na isipin na 'Hindi ko ito magagawa', isipin na 'Hindi ko pa alam kung paano ito gagawin'",
                "Wag mong ikumpara ang sarili mo sa iba ngayon. Sayang lang ang oras",
                "Tandaan, kahit na hindi mo makontrol ang isang partikular na sitwasyon, maaari mong kontrolin ang iyong respose",
                "Magnilay. Makakatulong ito sa iyo sa sobrang pag-iisip, mapababa ang iyong stress at makakatulong sa iyo na maging mas positibo",
                "Magsanay ng positibong pag-uusap sa sarili. Maaari kang gumamit ng mga positibong pagpapatibay sa iyong pagmumuni-muni",
                "Simulan o tapusin ang iyong araw sa pagsulat ng iyong journal ng pasasalamat",
                "Palibutan ang iyong sarili ng mga taong mahal mo at nagmamahal sa iyo pabalik",
                "Makinig sa musika. Maaaring magkaroon ng positibong epekto ang musika sa iyong kalusugan at araw",
                "Magsanay sa pagtanggap. Pahalagahan ang lahat ng mayroon ka ngayon",
                "Makinig sa isang inspirational youtube video/podcast. Punuin ang utak mo ng motivation",
                "Maglista ng 5 bagay na nagpangiti sa iyo ngayon",
                "Sa halip na sabihing 'Nabigo ako', sabihin ang 'Ang mga pagkakamali ay nakakatulong sa akin na matuto'",
                "Limitahan ang oras sa social media. Gumugol ng mas maraming oras sa paggawa at paggawa sa iyong sarili na nakakaubos ng nilalaman ng ibang tao",
                "Isulat ang iyong mga pangunahing priyoridad at mga plano para sa hinaharap na alam mong makakamit mo ang lahat ng gusto mo",
                "Manatiling kasalukuyan at pahalagahan ang kagandahan ng sandali. (Pakiramdam ang araw sa iyong mukha, pahalagahan ang sariwang hangin...)",
                "Ipagmalaki ang iyong sarili sa maliit na panalo ngayon (at sa iyong araw-araw)",
                "Ibahin ang iyong kalooban sa pamamagitan ng paggawa ng isang bagay na talagang kinagigiliwan mo",
                "Para sa paparating na sitwasyon na iyong inaalala, isulat ang pinakamagandang senaryo na maaaring mangyari",
                "Tumuon sa mga solusyon, hindi sa mga problema",
                "Bitawan ang mga inaasahan ng iba at tumuon sa kung ano ang mahalaga",
                "Palibutan ang iyong sarili ng positibong uri ng mga tao",
                "Alagaan ang iyong sarili. Kapag naramdaman namin ang aming makakaya, maaari naming makita ang mga bagay sa isang mas positibong paraan"
            ]
        },
        {
            "challenge_name": "Pagmamahal sa Sarili",
            "challenge_description": "Ang pagsali sa isang gawain sa pag-aalaga sa sarili ay napatunayang klinikal upang mabawasan o maalis ang pagkabalisa at depresyon, bawasan ang stress, pagbutihin ang konsentrasyon, bawasan ang pagkabigo at galit, dagdagan ang kaligayahan, at pagbutihin ang enerhiya",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Maglista ng 10 bagay na gusto mo tungkol sa iyong sarili",
                "Sabihin ang 'Salamat' sa iyong limang bahagi ng katawan sa salamin ngayon",
                "Sumulat ng post note sa tuwing ipinagmamalaki mo ang iyong sarili. Ilagay ito sa garapon na 'I am proud of myself' ",
                "Patawarin mo ang iyong sarili sa isang panghihinayang na iyong pinanghahawakan at hayaan mo na ito",
                "Sumulat ng isang listahan kasama ang lahat ng mga bagay na gusto mo tungkol sa iyong sarili",
                "Tratuhin ang iyong katawan na may malusog na pagkain at maraming tubig",
                "Linisin ang iyong kuwarto/desk/kubeta at linisin ang lahat ng manipis na hindi na nagdudulot ng kagalakan sa iyo",
                "Kumuha ng larawan ng iyong sarili at isulat ang lahat ng gusto mo tungkol sa iyong hitsura",
                "I-unfollow ang sinumang nagpaparamdam sa iyo na hindi ka sigurado at masama sa iyong sarili",
                "Pumunta ka sa isang lugar kung saan maaari mong panoorin ang pagsikat/paglubog ng araw at mag-enjoy dito",
                "Laging magbihis para sa iyong sarili. Magsuot ng paborito mong damit ngayon",
                "Magmuni-muni sa iyong linggo at sumulat ng 5 bagay na iyong pinasasalamatan",
                "Gumawa ng journal tungkol sa iyong nararamdaman at kung ano ang nangyayari sa iyong buhay",
                "Makipag-date sa iyong sarili. Pumunta sa iyong paboritong restaurant, pumunta sa beach...Sa isang lugar na sa tingin mo ay maganda at nakakarelaks kung saan makakakonekta ka sa iyong sarili",
                "Magplano ng gantimpala sa iyong sarili kapag natapos mo ang hamon na ito",
                "Maglakad nang matagal at kumonekta sa kalikasan",
                "Isulat ang pinakamalaking hamon na nalampasan mo",
                "Mag-unplug para sa buong araw sa anumang tech (maliban kung mayroon kang trabahong gagawin)",
                "Kumain ng paborito mong pagkain o dessert",
                "Sumulat ng love letter para sa sarili mo",
                "Isulat kung ano ang iyong natutunan mula sa hamon na ito at huwag kalimutan ang tungkol sa iyong gantimpala na iyong binalak noong Araw 15",
                "Ano ang gusto mong gawin noong bata ka? Gawin mo ngayon",
                "Gumawa ng masustansyang pagkain",
                "Makibalita sa isang matandang kaibigan o kamag-anak",
                "Matulog ka sa hapon",
                "Manood ng pelikulang matagal mo nang gustong manood",
                "Gumawa ng collage ng video ng iyong mga paboritong selfie",
                "Maglista ng 5 bagay na talagang mahusay ka",
                "Sumulat tungkol sa isang tagumpay na iyong ipinagmamalaki",
                "Pumili ng 3 positive affirmations na sasabihin araw-araw. Hal. Kaya ko."
            ]
        },
        {
            "challenge_name": "Pagbutihin ang Kumpiyansa",
            "challenge_description": "Ang kumpiyansa ay maaari ding magbigay sa iyo ng positibong pananaw sa buhay, na nagpapataas ng iyong mental at emosyonal na kagalingan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "I-unfollow ang lahat ng social media accounts na nagpaparamdam sa iyo ng insecure tungkol sa iyong sarili",
                "Pagsikapan ang pagtanggap ng mga papuri sa halip na tanggihan ang mga ito ngayon",
                "Maging conscious tungkol sa iyong postura. Ang magandang postura ay bumuo ng higit na kumpiyansa",
                "Gawin ang isang bagay na gusto mong gawin noong bata ka",
                "Gawin ang isang bagay na mapaghamong ngayon, tandaan na hindi tayo lumalaki kapag tayo ay nasa ating comfort zone",
                "Isulat ang 10 bagay na gusto mo tungkol sa iyong sarili",
                "Sabihin ang oo sa isang bagay na karaniwan mong hindi gagawin",
                "Magpatupad ng bagong malusog na gawi",
                "Magsalita ka kapag may sasabihin ka",
                "Magfocus ka sa gusto mo kaysa sa ayaw mo",
                "Magsikap sa pagpapabuti ng iyong mga kasanayan sa isang bagay na gusto mong gawin o gusto mong simulan ang paggawa",
                "Isulat ang lahat ng iyong mga nagawa kasama na ang sa hinaharap",
                "Mag-ehersisyo nang mabilis, maligo, maghanda at magsuot ng damit na magpapasaya sa iyo",
                "Lumabas ka mag-isa para panoorin ang paglubog ng araw",
                "Makipag-ugnayan sa isang matandang kaibigan",
                "Bumuo ng mga positibong kaisipan para sa bawat negatibo",
                "Bigyan ang isang tao ng isang magandang piraso ng payo",
                "Gumawa ng ehersisyo na gusto mo",
                "Magtrabaho sa maliliit na bagay. Ang mga maliliit na tagumpay ay nagpapasaya sa iyo",
                "I-pause at pag-isipan ang isang bagay bago ka kumilos, sa halip na mag-react nang pabigla-bigla",
                "Maging totoo at yakapin ang iyong pagiging natatangi. Ang buhay ay hindi isang kompetisyon",
                "Huwag magsalita ng negatibo tungkol sa ibang tao sa buong araw",
                "Isulat ang isang bagay na nagawa mo para sa iyong pamilya",
                "Sumulat ng love letter para sa sarili mo",
                "Isulat ang 3 takot at paano mo malalampasan ang bawat isa",
                "Tukuyin ang pagbabagong gusto mong gawin at ang mga hakbang para gawin ito",
                "Gumawa ng isang bagay na nagpaparamdam sa iyo na espesyal ka",
                "Hilingan ang tatlong kaibigan na sabihin sa iyo ang kanilang paboritong bagay tungkol sa iyo",
                "Isulat ang 3 sa iyong mga pagkakamali at natutunan",
                "Magtakda ng isang maaabot na layunin para sa iyong sarili"
            ]
        },
        {
            "challenge_name": "Act of Kindness",
            "challenge_description": "Ang isang gawa ng kabaitan ay maaaring magpalakas ng damdamin ng kumpiyansa, pagiging nasa kontrol, kaligayahan at optimismo. Maaari din nilang hikayatin ang iba na ulitin ang mabubuting gawa na kanilang naranasan sa kanilang sarili - na nag-aambag sa isang mas positibong komunidad.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Magpakita ng suporta sa isang tao ngayon",
                "Mag-donate ng dugo. Magligtas ng mga buhay",
                "Mag-iwan ng positibong pagsusuri ng iyong paboritong restaurant/coffee shop",
                "Gumawa ng almusal sa kama ang isang miyembro ng pamilya/mahal",
                "Magtanong sa isang tao kung paano mo sila matutulungan - at pagkatapos ay gawin ito.",
                "Ngiti sa taong nangangailangan nito",
                "Mag-iwan ng positibong pagsusuri ng iyong paboritong app",
                "Magbigay ng tip para sa kolektor ng basura",
                "Tanungin ang iyong mga magulang/kapatid/anak kung mayroon kang magagawa para matulungan sila",
                "Sumulat ng listahan ng mga dahilan kung bakit mo mahal ang isang tao at ibigay ito sa kanila",
                "Bigyan ng tip ang isang tao",
                "Spend the day saying only positive things aout of people",
                "Sabihin sa isang taong mahal mo kung gaano mo sila pinahahalagahan",
                "Gawin ang isang gawaing-bahay na karaniwang hindi mo gagawin",
                "Sabihin ang 'Have a nice day' kahit 3 taong nakatagpo mo",
                "Bumili ng pagkain para sa isang taong walang tirahan",
                "Tulungan ang isang tao bago sila humingi",
                "Maghurno ng cookies at iregalo ito sa isang tao",
                "Subukang mag-abuloy ng mga damit/laruan/libro sa isang lokal na kawanggawa",
                "Tumawag ka sa isang taong hindi mo nakakausap ng ilang sandali",
                "Higit sa lahat, laging maging mabait sa iyong sarili",
                "Sumulat ng tala ng pasasalamat sa isang taong gumawa ng epekto sa iyong buhay",
                "Hayaan ang isang tao na mauna sa iyong harapan habang nakapila",
                "Surprisahin ang isang tao na may regalo",
                "Maglagay ng mga positibong sticky note sa mga salamin",
                "Mag-check in kasama ang isang matandang kamag-anak",
                "Magbigay ng 3 tapat na papuri sa taong mahal mo",
                "Say thank you hangga't kaya mo",
                "Purihin ang isang tao",
                "Iwasan ang mga negatibong pag-iisip sa isang araw. Magpakita ka rin ng kabaitan!"
            ]
        },
        {
            "challenge_name": "Mental Wellness",
            "challenge_description": "Pagdating sa iyong kalusugang pangkaisipan, ang pag-aalaga sa sarili ay makakatulong sa iyo na pamahalaan ang stress, mapababa ang iyong panganib na magkasakit, at madagdagan ang iyong lakas. Kahit na ang maliliit na pag-aalaga sa sarili sa iyong pang-araw-araw na buhay ay maaaring magkaroon ng malaking epekto. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Pamahalaan ang Pagkabalisa",
                "Bago matulog, sumulat ng 3 bagay na pinahahalagahan mo mula sa araw",
                "Magsanay ng pakikiramay sa sarili",
                "Magsanay ng pag-iisip. Hilahin ang iyong sarili pabalik sa kasalukuyan",
                "Gumugol ng oras sa isang libangan. Palakasin ang iyong kalooban at makisali sa isang gawain na iyong kinagigiliwan",
                "Magpahinga sa social media para sa araw at tumuon sa buhay sa paligid mo",
                "Magtanim ng isang bagay. Ang pag-aalaga ng isang bagay maliban sa iyong sarili ay maraming benepisyo sa pag-iisip.",
                "Isipin ang pinakamagandang bahagi ng iyong buhay habang naghihintay ka ng isang bagay",
                "Alamin kung paano makipag-usap tungkol sa mental wellness sa iyong mga magulang, tagapagturo, kaibigan, miyembro ng pamilya, at iba pang malapit sa iyo.",
                "Buksan ang tungkol sa isang bagay sa iyong isip",
                "Tumuon sa pagpapahinga at pagrerelaks ngayon at matulog nang maaga",
                "Maglakad-lakad nang hindi tumitingin sa iyong telepono, nakatutok sa iyong paligid",
                "Isipin ang isang masayang lugar sa tuwing nababalisa ka",
                "Magbasa o manood ng isang bagay na mabuti para sa iyong kalusugang pangkaisipan",
                "Isipin ang iyong pangarap na buhay at isulat kung anong mga hakbang ang kailangan mong pag-usapan upang makarating doon",
                "Magsanay ng positibong pag-uusap sa sarili",
                "I-renew ang iyong motivation",
                "Simulang tuklasin ang ugat ng anumang negatibong kaisipan",
                "Isulat ang 5 bagay na pinasasalamatan mo",
                "Magsanay sa pag-aalaga sa sarili at alagaan ang iyong sarili",
                "Isulat ang mga positibong pagpapatibay at basahin ang mga ito bago matulog",
                "Huminga ng 3 buong malalim na paghinga hangga't maaari",
                "Magplano ng malusog na pagkain",
                "Magbigay ng shoutout sa taong pinahahalagahan mo.",
                "Tawagan mo ang taong mahal mo na matagal mo nang hindi nakakausap",
                "Subukan ang isang guided meditation",
                "Matuto ng bagong kasanayan upang ilipat ang iyong mga iniisip mula sa mga problema at pagkabalisa",
                "Sumulat ng journal ng lahat ng nangyayari sa iyong isipan",
                "Kumain ng masustansyang pagkain.",
                "Kumanta ng paborito mong kanta. Nakakatulong ang pag-awit na ayusin ang paghinga at bawasan ang pagkabalisa"
            ]
        },
        {
            "challenge_name": "Ayusin ang iyong iskedyul ng pagtulog",
            "challenge_description": "Ang mga pang-araw-araw na hamon na ito ay naglalayong tulungan kang magpatibay ng isang malusog na gawain sa oras ng pagtulog, makakuha ng sapat na tulog, at gumising na refresh ang pakiramdam tuwing umaga.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Itabi mo ang iyong telepono upang sa susunod na umaga kailangan mong bumangon sa kama upang patayin ang alarma",
                "I-off ang lahat ng iyong screen 1 oras bago matulog para maihanda ang iyong utak sa pagtulog",
                "Gantiyahan ang iyong sarili ng masarap na almusal para mas magkaroon ka ng motibasyon na gumising ng maaga",
                "Ang shower sa gabi, ang mainit na shower o paliguan ay makakatulong sa iyo na makapagpahinga bago matulog",
                "Subukan mong gumising sa parehong oras araw-araw, ang pagiging pare-pareho ang susi",
                "Pagkatapos ng hapunan ay isuot ang iyong maginhawang pajama, journal, magbasa ng isang sulok at maghandang mag-relax at hayaang ma-relax ang iyong isip",
                "Uminom ka ng maraming tubig pagkatapos mong magising, hindi ka makaramdam ng sobrang pagod sa buong araw",
                "Subukan mong kumain ng maaga, dahil mas maaga mong matutunaw ang iyong pagkain, ang iyong katawan ay maaaring tumuon sa pagkuha ng paulit-ulit na pagtulog na kailangan nito",
                "Magkaroon ng isang mabilis na pag-eehersisyo/pagtakbo sa umaga, ito ay makakatulong sa iyong makaramdam ng lakas sa araw at inaantok kapag dapat kang matulog",
                "Magnilay bago matulog, nakakarelax at nakakabawas ng stress",
                "Buksan ang mga bintana kapag nagising ka at hayaang dumampi ang sinag ng araw sa iyong balat",
                "Paunang planuhin ang iyong mga aktibidad ngayong gabi at gayundin ang iyong listahan ng gagawin para sa susunod na umaga",
                "Makinig sa paborito mong playlist pagkatapos mong magising para maging maganda ang mood mo",
                "Magtakda ng paalala na mag-aalerto sa iyo 30 minuto bago ang oras ng pagtulog",
                "Gumugol ng enerhiya sa araw upang mapagod ka sa gabi",
                "Tumigil sa pag-inom ng tubig 1 oras bago matulog para hindi mo na kailangang magising sa oras ng gabi o bumangon habang sinusubukan mong makatulog",
                "Ayusin mo ang iyong higaan pagkatapos magising para hindi ka na matuksong bumalik sa pagtulog",
                "Makinig sa magaan na musika bago matulog, makakatulong ito sa iyo na makatulog kaagad",
                "Pagkagising mo, dumiretso ka sa banyo para maghugas ng mukha o mag-shower.",
                "Kumain ng pagkain na may magnesium (tulad ng mga almendras, mani at buto ng kalabasa) at zinc upang mapabuti ang iyong kalidad ng pagtulog",
                "Langapin ang sariwang hangin sa iyong paggising. I-refresh ang iyong mga iniisip na tumutulong sa iyong utak na lumiwanag sa umaga",
                "Gamitin ang iyong kama para sa pagtulog at pakikipagtalik lamang. Bawal manood ng tv.",
                "Walang caffaine 6 na oras bago ang napiling oras ng pagtulog",
                "Iwasan ang pagkain ng malalaking pagkain bago ka matulog",
                "Gawing madilim at tahimik ang iyong silid hangga't maaari",
                "Iwasan ang pag-idlip. Maaari itong makagambala sa cycle ng iyong pagtulog",
                "Magtatag ng malamig at pare-parehong temperatura",
                "Matulog ka lang kapag inaantok ka",
                "Iwasan ang mahirap na pag-uusap bago matulog",
                "Labain o palitan ang iyong mga kumot at unan"
            ]
        },
        {
            "challenge_name": "Pag-aalaga sa sarili",
            "challenge_description": "Ang pangangalaga sa sarili ay nangangahulugan ng paglalaan ng oras upang gawin ang mga bagay na makakatulong sa iyong mamuhay nang maayos at mapabuti ang iyong pisikal na kalusugan at kalusugan ng isip.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Planohin ang iyong araw at manatili dito",
                "Sumulat ng isang journal, itala ang iyong mga damdamin at karanasan",
                "Magsanay ng isang libangan na talagang kinagigiliwan mo",
                "Magbasa ng paboritong libro noong bata ka pa",
                "Mag-ehersisyo sa bahay. Maghanap ng mga video sa pag-eehersisyo sa Youtube",
                "Subukan mong magluto ng bago",
                "Ibahagi ang isang bagay na iniisip mo sa iyong mga magulang o kaibigan",
                "Gumawa ng routine sa umaga",
                "Tawagan ang iyong pamilya at mga kaibigan",
                "Lutasin ang isang larong puzzle",
                "Gumawa ng ilang likhang sining. Makakahanap ka ng mga ideya sa internet",
                "Makinig sa iyong mga paboritong kanta",
                "Maglaro ng board games",
                "Sumulat ng liham para sa isang taong espesyal",
                "Kumuha ng online na kurso para matuto ng bagong kasanayan",
                "Manood ng bagong pelikula",
                "Matulog ng malakas para ipahinga ang iyong isip at katawan",
                "Makinig sa ilang podcast",
                "Magnilay para kalmado ang iyong isip at malaya sa pagkabalisa",
                "Maligo ka muna",
                "Itakda ang iyong mga layunin para sa hinaharap",
                "Kumanta sa iyong paboritong kanta",
                "Video chat sa isang taong mahalaga sa iyo",
                "Magtatag ng isang gawain sa pagtulog",
                "Walang reklamo",
                "Laging maghanap ng oras para manalangin.",
                "Say 'No' sa negativity",
                "Linisin at ayusin ang iyong lugar",
                "Magtakda ng layunin para sa susunod na linggo",
                "Humingi ng tulong kung kailangan mo ito"
            ]
        },
        {
            "challenge_name": "Epektibong Pag-aaral",
            "challenge_description": "Pag-aaral kung paano maging matagumpay sa iyong pag-aaral. Magtakda ng epektibo at malinaw na mga layunin upang makamit ang mas matataas na marka, matutunan kung paano pamahalaan ang iyong oras at pagbutihin ang iyong mga kasanayan sa pag-aaral.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Ayusin at linisin ang iyong mesa para sa pag-aaral",
                "Magplano ng sesyon ng pag-aaral at maghanda ng mga materyales sa pag-aaral",
                "Pagtagumpayan ang iyong mga kahinaan at hanapin ang iyong layunin sa pag-aaral at motibasyon",
                "Pag-aralan ang iyong syllabus at simulan ang pagiging aktibo sa iyong kurso",
                "Palaging ayusin ang iyong iskedyul at kumuha ng mga tala",
                "Isulat ng kamay ang iyong mga tala at i-highlight ang mga pangunahing salita",
                "50-10 na panuntunan. Mag-aral ng 50 minuto bawat oras. Gumugol ng 10 minuto sa paglilinis ng iyong isip",
                "Suriin ang iyong mga tala bago ka matulog",
                "Magtakda ng timer at tumuon lamang sa isang gawain",
                "Mag-aral ka na parang may tinuturuan ka",
                "Ipangako ang iyong sarili ng isang gantimpala kung natapos mo ang lahat ng mga gawain",
                "Gumamit ng mga kulay at highlighter sa iyong mga tala",
                "Gumamit lamang ng Google at Youtube para maunawaan ang mga konsepto",
                "Eat healthy. Mas gaganda ang pakiramdam ng iyong katawan at mas magiging alerto ka",
                "Ibuod ang mga konsepto",
                "Mag-aral ka sa kaibigan mo. Hilingin sa kaibigan mo na mag-quiz ka sa mga subject na mahirap",
                "Repasuhin kung ano ang iyong natutunan ngayon o sa linggong ito",
                "Gumamit ng mga app o flash card para sa mas mahusay na pag-aaral",
                "Priyoridad ang iyong mga gawain. Kumpletuhin muna ang mga pangunahing gawain",
                "Gumamit ng mapa ng isip upang ayusin ang impormasyon",
                "Pumili ng isang tahimik na lugar ng pag-aaral na walang distractions",
                "Huwag kalimutang Mag-De-Stress. Panatilihing mababa ang antas ng iyong stress at bawasan ang pag-aalala",
                "Suriin ang iyong mga tala bago mo simulan ang iyong takdang-aralin",
                "Pag-aralan muli ang mga problema sa araling-bahay, takpan ang mga sagot at mag-quiz sa iyong sarili",
                "Gumawa ng isang listahan ng mahalagang konsepto o mga formula",
                "Gumawa ng sarili mong mock exam",
                "Mag-aral na parang may surprise exam bukas.",
                "Matulog ng sapat dahil nakakatulong ito sa pagpapanatili ng memorya",
                "Maghanap ng mga diskarte sa memorya na angkop sa iyong pag-aaral nang epektibo",
                "Huwag matakot humingi ng tulong"
            ]
        },
        {
            "challenge_name": "Relasyon ng Mag-asawa",
            "challenge_description": "Ang hamon sa relasyong ito ay idinisenyo upang maging madaling isama sa iyong pang-araw-araw na buhay. Marami sa challenges ay dapat tumagal lamang ng ilang minuto upang gawin at maaaring gawin anumang oras sa buong araw. Ang ilan ay nangangailangan ng kaunting lakas at pagpaplano, ngunit ito ay magiging sulit.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Gumawa ng listahan ng mga bagay na gusto mo tungkol sa iyong kapareha",
                "Magplano ng sorpresang petsa ng gabi",
                "Sabihin sa iyong kapareha na mahal mo sila nang walang pasubali",
                "Ibahagi ang takot na mayroon ka tungkol sa iyong relasyon",
                "Ibahagi ang isang magandang alaala na mayroon ka tungkol sa iyong kapareha",
                "Padalhan ang iyong partner ng isang romantikong mensahe sa umaga",
                "Salamat sa iyong partner para sa isang bagay ngayon",
                "Surpresahin ang iyong partner ng isang magandang bagay",
                "Ibahagi ang isang layunin na mayroon ka para sa iyong relasyon",
                "Bigyan ng papuri ang iyong partner",
                "Magplano ng isang bakasyon sa katapusan ng linggo",
                "Tingnan ang mga lumang larawan na magkasama",
                "Alalahanin mo ang una mong pagkikita",
                "Gumawa ng bucket list nang magkasama",
                "Pumili ng random na salita at magsimula ng malalim na pag-uusap sa iyong kapareha",
                "Gumawa ng puzzle nang magkasama",
                "Sumulat ng love letter sa iyong partner at itago mo para mahanap nila mamaya",
                "Gawin ang isang bagay na kinagigiliwang gawin ng iyong kapareha",
                "Gumawa ng paboritong treat",
                "Sabihin sa iyong partner ang isang bagay na natatandaan mong gusto nila",
                "Bigyan ang iyong kapareha ng isang sorpresang halik at yakap",
                "Bigyan ang iyong kapareha ng nakakarelaks na masahe",
                "Ihanda ang iyong kapareha ng almusal sa kama",
                "Maglaro ng board game nang magkasama",
                "Tanungin mo siya kung paano ka magiging mas mabuting partner",
                "Mag-iwan sa kanya ng isang matamis na maliit na tala",
                "Sabay kayong mamasyal",
                "Bigyan ng papuri ang iyong partner ngayon",
                "Kumuha ng pagsusulit sa isang relasyon",
                "Mabagal na sayaw sa isang romantikong kanta"
            ]
        },
        {
            "challenge_name": "Declutter",
            "challenge_description": "Ang pagbabawas ng kalat sa ating buhaymaging ito ay pisikal, digital o iba paay nagbibigay-daan sa atin na harapin ang mga stressor nang direkta at nakikinabang sa ating kalusugang pangkaisipan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Linisin mo ang iyong aparador",
                "Ayusin ang iyong mga libro",
                "Ayusin mo ang iyong kwarto",
                "I-clear ang iyong nightstand",
                "Pagbukud-bukurin ang iyong mail",
                "Ayusin mo ang iyong pantry",
                "Mag-donate ng mga hindi nagamit na damit",
                "I-clear ang espasyo ng iyong computer o laptop",
                "Linisin ang iyong refrigerator at alisin ang mga nag-expire na item",
                "Linisin mo ang kotse mo",
                "Pumunta sa mga lumang papel at sulat",
                "Alisan ng laman ang iyong freezer",
                "Linisin mo ang iyong pitaka",
                "Ayusin mo ang iyong kusina",
                "I-clear ang iyong desk o workspace",
                "Tanggalin mo ang mga lumang damit",
                "Ayusin ang iyong mga kagamitan sa paglilinis",
                "Ayusin mo ang iyong aparador",
                "Alisin ang mga app na hindi mo na ginagamit",
                "Linisin ang mga kabinet ng gamot",
                "Isaayos ang lahat sa mga folder sa iyong computer",
                "Ayusin mo ang iyong sala",
                "Bumili ng functional na mga item sa storage",
                "Purge personal accessories",
                "Gumugol ng oras sa paglilinis ng iyong kotse/motorsiklo/bisikleta",
                "I-update at ayusin ang iyong kalendaryo",
                "Linisin ang mga patay na halaman at ayusin ang mga kaldero",
                "Ayusin ang mga tuyong paninda (spices) at linisin ang mga expired na kalakal",
                "Ayusin at lagyan ng label ang mga lalagyan at istante ng imbakan",
                "Magnilay para malinis ang iyong isip"
            ]
        },
        {
            "challenge_name": "Pagiging Produktibo",
            "challenge_description": "Maaaring makatulong sa iyo ang mahusay na produktibidad na magtakda ng mas mahusay na mga layunin, maging mas epektibo, pataasin ang pagtuon at palakasin ang pagganyak.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Ayusin mo ang iyong higaan sa umaga upang hindi ka mapilitan na bumalik sa kama",
                "Isulat ang 3 bagay na pinasasalamatan mo araw-araw",
                "Ayusin ang isang kalat na espasyo upang mapabuti ang lugar ng trabaho",
                "Gumugol ng mas kaunting oras sa telepono at maging mas produktibo",
                "Gumamit ng pang-araw-araw na tagaplano upang makamit ang lahat ng iyong pinlano",
                "I-off ang mga hindi kinakailangang notification sa telepono para maiwasan ang mga abala",
                "Gumawa ng meal plan para sa buong linggo ",
                "Gumawa ng listahan ng gagawin at subukang kumpletuhin ang lahat ng mga gawain",
                "Maglakad ng 30 minuto para makalanghap ng sariwang hangin at masiglang sakupin ang mundo",
                "Declutter email box. Minsan ito ay medyo nakakatakot",
                "Mag-ehersisyo ng 30 minuto kahit wala kang ginagawa sa maghapon, super productive ang pakiramdam mo pagkatapos mong mag-ehersisyo",
                "Basahin ang kabanata ng isang libro bago matulog para makalimutan ang tungkol sa social media",
                "Iwasang manood ng TV para magkaroon ka ng mas maraming oras para sa iyong sarili",
                "Ayusin ang iyong aparador at ibigay ang mga bagay na hindi mo na gusto",
                "Gumawa ng playlist ng musika gamit ang iyong mga paboritong kanta at linya ng sayaw na walang nanonood sa iyo",
                "Huwag suriin ang iyong telepono kaagad pagkatapos mong magising at magkaroon ng mabagal at mapayapang umaga",
                "Magnilay sa loob ng 10 minuto at mapapasigla ka",
                "Ayusin mo ang iyong pantry at refrigerator.",
                "Linisin nang malalim ang iyong silid. Maaliwalas na espasyo, malinaw na isip",
                "Mag-unsubscribe sa mga taong hindi na nagdudulot sa iyo ng kagalakan. Mas magaan ang pakiramdam mo",
                "Mag-iskedyul ng panahon ng pahinga sa iyong araw upang magkaroon ng ilang oras upang makapagpahinga",
                "Gumising ng mas maaga kaysa sa karaniwan. Ang mga matagumpay na tao ay nagsisimula ng kanilang araw nang maaga.",
                "Magbasa ng mga motivational at inspirational na libro ay makakatulong sa iyo na mabawi ang iyong pananampalataya sa iyong sarili",
                "Itigil ang pagsubok sa maraming gawain",
                "Gumawa ng listahan ng mga bagay na gusto mong ihinto",
                "Move. Maglakad. Mag-unat. Umupo ng tuwid",
                "Isulat ang mga ideyang lumalabas sa iyong ulo, ngunit huwag simulan ang paggawa sa mga ito. Iskedyul ang mga ito",
                "Mag-enjoy ng malusog na almusal para magkaroon ng lakas para maging mas produktibo sa buong araw",
                "Kapag natapos mo ang isang bagay, gaano man kaliit, isulat mo ito",
                "Delegate. Hindi mo kailangang gawin ang lahat"
            ]
        },
        {
            "challenge_name": "Kaligayahan",
            "challenge_description": "Ipinapakita ng mga siyentipikong pag-aaral na ang kaligayahan ay nauugnay sa maraming benepisyo, kabilang ang mas mataas na produktibidad, higit na pagkamalikhain, at mas malakas na katatagan sa harap ng stress.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Isulat ang mga bagay na gusto mo tungkol sa iyong sarili",
                "Ngitian mo lahat ng madadaanan mo",
                "Mag-ehersisyo ka",
                "Magluto ka ng hapunan",
                "Yakapin mo ang taong mahal mo",
                "Manood ng comedy film",
                "Tumawag ng kaibigan",
                "Sumayaw na parang walang nanonood",
                "Lumabas sa kalikasan at maging isang explorer sa isang araw",
                "Bumili ng regalo para sa taong mahal mo",
                "Subukan mong mag-yoga",
                "Matulog ka ng maaga at gumising din ng maaga",
                "Magbasa ng isang bagay na nagbibigay inspirasyon",
                "Magnilay ng 10 minuto",
                "Magplano ng isang bakasyon sa hinaharap",
                "Sumubok ng bagong recipe o magluto ng paborito mong pagkain",
                "Panoorin ang magandang paglubog ng araw",
                "Kumonekta sa iyong dating kaibigan",
                "Patawarin mo ang isang tao",
                "Sumubok ng bago",
                "Maglakad lakad sa labas",
                "Makinig sa paborito mong kanta",
                "Gumawa ng isang maliit na gawa ng kabaitan o tumulong sa isang kaibigan o kapitbahay",
                "Magbahagi ng tawa sa isang tao",
                "Bigyan ng yakap ang iyong mga anak/magulang/kaibigan/kapatid",
                "Makipaglaro sa iyong aso o iba pang mga alagang hayop",
                "Gumugol ng mas kaunting oras sa iyong telepono",
                "Sabihin sa mga tao kung gaano sila kahalaga sa iyo",
                "Bitawan mo ang mga nakalalasong tao at ugali",
                "Pagnilayan ang iyong paglalakbay mula sa Araw 1"
            ]
        },
        {
            "challenge_name": "Hamon sa Kalayaan sa Pananalapi",
            "challenge_description": "Isa sa pinakamahalagang benepisyo ng pagsasarili sa pananalapi ay ang pagbibigay sa iyo ng higit na kontrol sa iyong sariling buhay. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Tukuyin ang iyong mga layunin sa pananalapi",
                "Gumawa ng badyet sa susunod na buwan",
                "Bumuo ng isang emergency fund",
                "Tuklasin ang mga website at blog sa pananalapi",
                "Mag-ipon para sa pagreretiro",
                "Maghanap ng mga vlog ng financial literacy sa Youtube",
                "Pagtibayin ang minimalism",
                "Bumili ng money book at simulang basahin ito",
                "Isipin ang iyong karera",
                "I-automate ang iyong pera",
                "Subaybayan ang iyong credit score",
                "I-budget ang iyong pera",
                "Maghanap ng mga paraan para mabawasan ang iyong singil sa grocery",
                "Matutong kalkulahin ang porsyento",
                "Tuklasin ang mga paraan para kumita ng karagdagang kita",
                "Ibenta ang hindi mo kailangan/gamitin",
                "Magbasa pa tungkol sa pamumuhunan",
                "Humanap ng diskarte upang maiwasan ang emosyonal na paggastos",
                "Hindi gaanong ginugugol ang araw",
                "Sumulat ng isang plano sa pagtitipid para sa mga pagbili sa hinaharap",
                "Hanapin ang mga paraan upang mabawasan ang mga bayarin",
                "Basahin ang tungkol sa pamamahala ng pera",
                "Alamin ang mga pangunahing tuntunin sa pananalapi",
                "Alamin kung paano gumagana ang mga credit card",
                "Sumulat ng plano para mabayaran ang utang",
                "Humanap ng mga paraan para mabawasan ang iyong mga hindi mahahalagang paggasta",
                "I-automate ang iyong mga bill",
                "Ipagdiwang ang iyong pag-unlad ",
                "Mag-sign up para sa kursong financial literacy",
                "Manatili sa daan patungo sa kalayaan sa pananalapi"
            ]
        },
        {
            "challenge_name": "Positibong Pagiging Magulang",
            "challenge_description": "Ang pagsasagawa ngpositibong pagiging magulang ay isang mahalagang gabaysa pagitan ng mga magulang at mga anak upang magkaroon ng positibong resulta sa pag-unlad tulad ng pagpapahalaga sa sarili, tiwala, kakayahan sa sarili, mas malakas na ugnayan sa pagitan ng mga magulang at mga anak, at mas mahusay at epektibong daloy ng komunikasyon.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Gawin ang isang bagay sa iyong anak na alam mong mahal nila",
                "Tanungin ang iyong anak kung ano ang kanilang mga paborito",
                "Gawin ang craft kasama ang mga bata tulad ng aming paper plate butterfly",
                "Gumugol ng hindi bababa sa 30 minuto ng isa-isang oras kasama ang iyong anak",
                "Basahin ang kwento ng oras ng pagtulog",
                "Sabay kayong mamasyal",
                "Yakapin mo ang iyong anak ng apat na beses ngayon",
                "Magluto ng isang bagay para sa iyong anak na gusto nila ",
                "Kumuha ng ilang larawan nang magkasama o gumawa ng DIY photobooth",
                "Tanungin ang iyong anak kung anong espesyal na bagay ang gusto niyang gawin",
                "Dalhin sila sa kanilang paboritong lugar",
                "Gumawa ng 'Happy box' na magkasama ",
                "Magsulat ng isang kuwento nang sama-sama. Kunin ang iyong anak na gumuhit ng mga larawan",
                "Gumawa ng mga tatak ng kamay nang magkasama",
                "Turuan ang iyong anak kung paano gumawa ng bago ngayon",
                "Turuan ang iyong anak tungkol sa pera",
                "Maglagay ng musika at sumayaw nang magkasama",
                "Gumawa ng family board game",
                "Kumuha ng isang maliit na regalo para sa kanila at itago ito sa bahay para mahanap nila",
                "Maghurno ng muffins o Magluto ng pancake at dalhin ito sa isang kapitbahay",
                "Gumawa ng card para sa ibang magulang nang magkasama",
                "Magsalita ng mga positibong bagay sa iyong anak ngayon",
                "Tanungin mo sila kung ano ang iniisip nila",
                "Tanungin ang kanilang paboritong hayop at gumawa ng isang masayang proyekto nang magkasama",
                "Turuan ang iyong anak ng kasanayan sa buhay",
                "Pumunta sa isang nature walk. Mangolekta ng mga item mula sa isang listahan",
                "Magkaroon ng isang kulay na araw. Magbihis sa kulay, kumain ng mga pagkaing may kulay.",
                "Gumawa ng isang masayang gawain para sa mga lolo't lola",
                "Maglaro ng play dough nang magkasama. Magkaroon ng mga kumpetisyon sa paghubog",
                "Tanungin ang iyong anak ng kanilang paboritong alaala. Planuhin itong gawin muli"
            ]
        },
        {
            "challenge_name": "Pagtagumpayan ang Depresyon",
            "challenge_description": "Ang hamon na ito ay gumagabay sa iyo upang mapagtagumpayan ang depresyon at nagpapaalala sa iyo na may malaking pag-asa para sa paggaling. Ang depresyon ay lubos na magagamot. Maraming mga tao na nakakaranas ng depresyon ay ganap na gagaling. Ang iba ay nakakahanap ng ilang antas ng kaginhawahan mula sa kanilang mga sintomas. Ang laban ay sulit - ang kakayahang umunlad sa buhay pagkatapos ng depresyon ay nariyan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Napakahalaga ng pagpindot sa pagpapagaling ng depresyon. I-stroke ang mga alagang hayop, yakapin ang mga kaibigan at pamilya, ipagpatuloy ang pakikipagtalik sa iyong kapareha o magpamasahe.",
                "Lumabas para sa 15 minutong pisikal na aktibidad. Subukang tumakbo. Linisin ang bakuran. Maglakad kasama ang iyong alagang hayop.",
                "Malaking bahagi ang diet sa pagtulong sa pagpapagaan ng depression. Siguraduhing kumain ka ng maayos at regular, kahit na wala kang gana",
                "Matulog ng sapat",
                "Ngiti at baguhin ang iyong postura para mabago ang nararamdaman mo.",
                "Basahin ang mga positibong halimbawa kung paano nalampasan ng mga tao ang mga isyu sa kalusugan ng isip at alamin na posible rin ito para sa iyo.",
                "Kalimutan ang hinaharap at ang nakaraan. Tanungin ang iyong sarili 'Sa ngayon, dito mismo sa sandaling ito ano ang mali?'",
                "Supplement ang iyong mga bitamina upang madagdagan ang mga happy hormones. Ang kakulangan ng bitamina B3 at bitamina D, na ginawa sa balat sa pamamagitan ng sikat ng araw, ay naiugnay din sa depresyon",
                "Pakinggan mo ang iyong panloob na boses. Malupit ba ito o kritikal? Ituturing mo ba ang iba na may parehong paghatol? Ang mga kaisipang ito ba ay nakabubuo o nakakasira?",
                "Siguraduhing lumabas ka araw-araw habang ang liwanag ng araw at sikat ng araw ay nagpapataas ng serotonin at kailangan para sa bitamina D",
                "Huwag kang mahiya. Baka mabigla kang malaman kung gaano karaming tao ang tahimik na dumaranas ng depresyon. Makipag-usap sa iyong pamilya at mga kaibigan.",
                "Putulin ang mga mapang-abusong relasyon",
                "Spend time with your pet",
                "Mas malakas ka kaysa sa iyong depresyon",
                "Makinig sa musika araw-araw",
                "Gumawa ng mga bagay na minsang nakapagpasaya sa iyo kahit na hindi mo ito gusto",
                "Iwasan ang paghihiwalay",
                "Ang pagtawa ay isang mahalagang panlunas sa depresyon.",
                "Gawin mo ang gusto mo",
                "Iwasan ang alak at droga",
                "Maghanap ng Oportunidad sa Pagboluntaryo bilang Paraan para Hindi Malungkot ang Lonely",
                "Alamin Kung Kailan Makikipag-ugnayan o Aalis sa Online na Mundo",
                "Maghanap ng Maaasahan",
                "Gawin ang kabaligtaran ng kung ano ang iminumungkahi ng 'depression voice'",
                "Humanap ng maliliit na paraan upang maging paglilingkod sa iba",
                "Don't dwell on problems. Focus on the right solution instead",
                "Magkaroon ng mga magagawang layunin upang mabigyan ka ng pakiramdam ng tagumpay",
                "Magpasalamat at mapansin ang 3 magagandang bagay sa bawat araw",
                "Hilingan ang isang mahal sa buhay na mag-check in sa iyo nang regular.",
                "Hamunin ang mga negatibong kaisipan."
            ]
        }
    ]
}