{
    "all_challenges": [
        {
            "challenge_name": "Kelola Tantangan Kecemasan",
            "challenge_description": "Kurangi rasa khawatir dan nikmati hidup lebih banyak dengan tantangan kami yang telah terbukti. Katakan ya untuk menantang diri sendiri dan Anda akan merasa lebih baik dalam satu bulan.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Jaga rutinitas tidurmu.",
                "Tidak apa-apa untuk meminta bantuan.",
                "Akui perasaanmu.",
                "Berdoa dan mohon petunjuk Allah.",
                "Tuliskan emosimu.",
                "Visualisasikan sesuatu yang menginspirasi.",
                "Hentikan pola berpikir negatif.",
                "Temukan hal-hal positif dalam hidup.",
                "Memiliki belas kasih diri untuk diri sendiri dan kecemasan Anda.",
                "Periksa akar dari setiap pikiran negatif.",
                "Bangun keberanianmu untuk menghadapi sesuatu yang kamu hindari.",
                "Tidak apa-apa memiliki kecemasan. Kenali gejalanya dan pelajari cara mengendalikannya.",
                "Buat daftar hal-hal yang Anda hindari karena kecemasan Anda. Bagikan",
                "Perkuat salah satu keterampilan koping Anda dengan melakukan riset",
                "Lakukan rutinitas yoga di Youtube khusus untuk kecemasan",
                "Bacalah sesuatu yang baik untuk kesehatan mentalmu",
                "Perbaiki sesuatu yang rusak karena kecemasanmu",
                "Pergi ke suatu tempat yang membuat Anda rileks dan meredakan kecemasan",
                "Makan hari ini dengan cara yang nyaman bagi tubuh, pikiran, dan jiwa",
                "Lakukan sesuatu yang membantu Anda mengisi ulang di mana Anda merasa terkuras",
                "Luangkan 20 menit mendengarkan suara alam",
                "Pastikan umpan media sosial Anda bebas dari kecemasan",
                "Bekerjalah pada pembicaraan Anda sendiri, tidak ada kata-kata kasar yang ditujukan pada diri Anda sendiri",
                "Lakukan pemindaian seluruh tubuh. Di mana Anda menahan kecemasan Anda",
                "Fokus pada tidur dan istirahat dan waktu tidur yang sehat",
                "Ubah satu hal di hari Anda yang akan meningkatkan kecemasan Anda",
                "Latihan perhatian",
                "Gulir melalui rol kamera ponsel Anda. Ketika Anda menemukan gambar yang membuat Anda tersenyum, bagikan dengan siapa pun yang ada di dalamnya",
                "Hubungi seseorang yang menurut Anda mungkin juga sedang berjuang melawan kecemasan. Membicarakannya saja dapat membantu Anda berdua",
                "Periksa dengan tujuan Anda dari Hari 1. Apa kemajuan Anda?"
            ]
        },
        {
            "challenge_name": "Merasa Luar Biasa",
            "challenge_description": "Luangkan waktu Anda yang akan membuat Anda merasa sedikit lebih hebat dan luar biasa dengan mengambil tantangan afektif ini.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Refleksikan hal-hal luar biasa yang telah Anda lakukan tahun ini.",
                "Fokus untuk menjadi positif",
                "Buatlah daftar hal-hal yang membuatmu bahagia.",
                "Makan jajanan masa kecil favoritmu.",
                "Menarilah di sekitar rumahmu.",
                "Cobalah minum air putih 8 gelas.",
                "Tonton film favoritmu.",
                "Ubah kamar tidur/tempat kerja Anda",
                "Nonton sunset/sunrise sambil dengerin lagu favorit",
                "Buatlah makanan yang sehat",
                "Beli sesuatu yang benar-benar kamu inginkan (cokelat, bunga…)",
                "Lakukan sesuatu yang baik untuk seseorang",
                "Buat daftar putar Anda sendiri dengan lagu-lagu yang memberi Anda kegembiraan",
                "Melihat bintang kapan pun Anda bisa",
                "Pesan makanan favoritmu dan manjakan dirimu",
                "Jalan-jalan",
                "Buat minuman favoritmu di rumah",
                "Dengarkan podcast tentang sesuatu yang menarik minat Anda",
                "Kumpulkan teka-teki",
                "Menonton film dari masa kecilmu",
                "Buat pizza/makanan favoritmu sendiri",
                "Kirim pesan 'Terima Kasih' kepada seseorang di Messenger/WhatsApp",
                "Pakai pakaian favoritmu hari ini.",
                "Pelajari kata baru",
                "Buat rencana menu untuk minggu ini",
                "Ngobrol bareng anak/adik",
                "Pujian 3 orang hari ini",
                "Akhirnya menyelesaikan proyek yang belum selesai",
                "Tidak ada permen, soda, atau makanan cepat saji hari ini",
                "Rencanakan hari yang menyenangkan bersama keluarga Anda"
            ]
        },
        {
            "challenge_name": "Hidup dengan Sengaja",
            "challenge_description": "Berkomitmen pada tantangan kecil harian ini akan mengubah hidup Anda menjadi versi terbaik dari diri Anda",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Berdoalah ketika kamu bangun hari ini. Terima kasih Tuhan untuk hari yang baru dengan penuh kesempatan.",
                "Tetapkan niat atau hanya 3 tujuan untuk hari ini",
                "Berhati-hatilah dengan kata-kata yang Anda ucapkan atas diri sendiri dan orang lain",
                "Tulis daftar terima kasih, cobalah untuk memasukkan ini setiap pagi/malam",
                "Jauhi layar setidaknya 1 jam sebelum tidur",
                "Masak sesuatu yang Anda sukai dan makan makanan Anda dengan penuh perhatian tanpa gangguan",
                "Lakukan sesi perawatan diri, mandi, doa masker wajah dan nikmati setiap detik prosesnya",
                "Buat jurnal 20 menit tentang pengalaman Anda bulan ini",
                "Jauhkan ponsel Anda saat Anda sedang makan",
                "Hadiah diri Anda ketika Anda menyelesaikan tugas Anda. Ini bisa sesederhana hanya memberi diri Anda waktu untuk melakukan sesuatu yang benar-benar Anda nikmati",
                "Lihatlah ke cermin dan katakan pada diri sendiri bahwa Anda cantik dan mampu melakukan segalanya",
                "Lakukan sesi yoga/meditasi 15 menit",
                "Dengarkan musik yang membangkitkan semangat. Pilih untuk memiliki lagu di daftar putar Anda yang akan menjaga emosi Anda tetap baik",
                "Ekspresikan kreativitas Anda hari ini. Menggambar, melukis, menulis, menari, lakukan sesuatu",
                "Jalan-jalan di alam",
                "Buat pilihan sadar untuk menggunakan media sosial dengan bijak dan penuh perhatian. Tetapkan batasan dan pilih konten yang memengaruhi kesejahteraan Anda secara positif",
                "Luangkan waktu 10 menit untuk menuliskan semua hal yang ingin Anda lakukan dan buat rencana untuk melakukan setidaknya salah satunya bulan depan",
                "Berhenti mengikuti akun Instagram yang tidak Anda sukai lagi",
                "Biarkan diri Anda mengambil beberapa menit untuk hanya duduk dan bernapas. Jadilah pada saat ini",
                "Manjakan diri Anda dengan sepotong surga. Pergi ke toko kue favorit Anda, beli kue favorit Anda, duduk di tempat yang tenang dan nikmati setiap gigitan",
                "Perhatikan kesehatan mental Anda. Berhati-hatilah dan sadar akan emosi dan keadaan pikiran Anda. Jangan takut untuk meminta bantuan saat Anda membutuhkannya",
                "Makan dan nikmati makanan hari ini tanpa ponsel atau layar apa pun",
                "Terhubung kembali dengan seseorang. Buat rencana dengan teman di Messenger, Facetime, WhatApp, atau bertemu untuk mengejar ketinggalan",
                "Dengarkan pidato motivasi di Youtube",
                "Lihat blog Habitualize",
                "Konsumsi 3 jenis buah yang berbeda hari ini",
                "Tuliskan 3 hal yang harus diselesaikan besok",
                "Lakukan jalan yang intuitif",
                "Tulis jurnal selama 10 menit atau lebih",
                "Mimpi besar. Tetapkan niat. Buat papan visi"
            ]
        },
        {
            "challenge_name": "Belajar Bahasa Baru",
            "challenge_description": "Mempelajari bahasa baru itu menantang tetapi juga bisa menyenangkan, sederhana, dan mudah. ​​Mengikuti tantangan belajar bahasa 30 hari akan memungkinkan Anda meningkatkan pembelajaran bahasa Anda setiap hari.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Pelajari 5 kata baru",
                "Cobalah aplikasi bahasa baru",
                "Tonton film dalam bahasa yang Anda pelajari dengan subtitle",
                "Tulis daftar belanja/yang harus dilakukan dalam bahasa target Anda",
                "Ajari seseorang beberapa kata dan frasa",
                "Tanyakan 'Bagaimana kabarmu?' ke teman",
                "Tonton tutorial untuk sesuatu dalam bahasa",
                "Tuliskan tentang pengalaman Anda hari ini",
                "Menceritakan sesuatu yang Anda lakukan",
                "Tonton video tutorial Youtube tentang bahasa",
                "Ajari seseorang 5 kata baru",
                "Belajar tata bahasa dasar",
                "Jurnal dalam bahasa target Anda",
                "Baca artikel berita",
                "Bicaralah dengan seseorang atau hewan peliharaan Anda",
                "Ubah pengaturan telepon Anda selama sehari",
                "Menulis resensi untuk buku/film",
                "Baca sesuatu",
                "Rekam diri Anda berlatih bahasa",
                "Tulis 40 kata yang telah kamu pelajari",
                "Tuliskan bagaimana tantangan ini membantu Anda",
                "Apakah Anda masih ingat kata-kata yang telah Anda pelajari pada Hari 1?",
                "Jawab kuis online tentang bahasa target",
                "Ajari anggota keluarga dengan 7-10 kata baru",
                "Tulis 50 kata yang telah kamu pelajari",
                "Tulis sesuatu tentang harimu",
                "Dengarkan lagu dalam bahasa",
                "Menulis sebuah cerita",
                "Dengarkan podcast",
                "Buat kartu flash untuk menghafal kata-kata dengan mudah"
            ]
        },
        {
            "challenge_name": "Tantangan Perhatian",
            "challenge_description": "Latihan mindfulness membantu mengatur ulang pikiran Anda dan memiliki perspektif yang jelas ketika menjadi tidak fokus atau merasa kewalahan dalam hidup",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Sebelum melakukan tugas apa pun hari ini, tanyakan pada diri Anda apa alasan Anda melakukan tugas itu dan renungkan sejenak",
                "Mindful shower. Visualisasikan membasuh pikiran negatif Anda dan berkonsentrasi pada rasa air di kulit Anda",
                "Sebelum tidur, tuliskan 3 hal yang sangat kamu hargai sejak hari itu",
                "Latih rasa syukur. Mulailah fokus pada pikiran positif dan lepaskan pola otak Anda yang ketakutan dan cemas",
                "Setel ulang postur Anda setiap kali Anda duduk, luruskan punggung Anda dengan lembut",
                "Berolahraga hari ini dan fokus pada sensasi fisik",
                "Berlatih mendengarkan aktif hari ini. Ini berarti fokus pada apa yang dikatakan orang lain dan merespons dengan cara yang sesuai",
                "Lakukan pemindaian tubuh. Arahkan perhatian Anda ke tubuh Anda dan kirimkan napas ke area yang tegang",
                "Temukan tempat yang damai di mana Anda dapat duduk dan menulis apa pun yang Anda rasakan saat ini",
                "Jadilah penasaran hari ini. Berlatihlah untuk tertarik pada apa yang sedang terjadi dan fokuskan perhatian Anda untuk mempelajari lebih lanjut tentangnya",
                "Perhatikan indera Anda ketika Anda merasakan, menyentuh, mencium, dan mendengar sesuatu",
                "Pernapasan penuh kesadaran. Tarik napas, tahan selama 3 detik lalu hembuskan",
                "Berjalanlah dengan penuh kesadaran. Ambil posisi untuk merasa terhubung dengan bumi dan berakar kuat pada tanah",
                "Minumlah secangkir teh penuh perhatian. Fokus pada rasa, aroma, dan kehangatan",
                "Berlatih mendengarkan tanpa menghakimi saat melakukan percakapan",
                "Lakukan satu hal pada satu waktu dan fokus hanya pada itu",
                "Duduklah dengan nyaman, rasakan kaki Anda menapak dengan kuat di lantai, punggung lurus dan tangan di pangkuan Anda. Fokus pada pernapasan sebentar",
                "Dengarkan diri Anda menjawab telepon atau saat Anda sedang melakukan percakapan, cara Anda berbicara, kata-kata yang Anda pilih",
                "Hargai segalanya hari ini. Perhatikan semua yang terjadi dan temukan cara untuk menghargainya",
                "Amati dengan penuh perhatian. Gambarkan secara mental suatu objek secara detail, warna, tekstur, bentuk...",
                "Duduklah di tempat yang nyaman dan tenang untuk sementara waktu",
                "Lakukan satu tugas pada satu waktu dan tetap fokus pada apa pun yang Anda lakukan",
                "Latih empati terhadap seseorang yang biasanya membuat Anda merasa kesal",
                "Temukan artikel atau video tentang mengapa kesalahan dan kegagalan baik untuk Anda. Ambillah dengan hati sehingga Anda dapat menghabiskan lebih sedikit waktu untuk fokus pada masa lalu",
                "Makanlah dengan penuh perhatian. Cicipi hidangannya dan coba tebak berapa banyak bahan yang masuk ke dalamnya",
                "Lihat sekelilingmu. Lihatlah daun/pohon/bunga tertentu dan fokuskan perhatianmu",
                "Temukan film lucu, ceritakan lelucon lucu, dengarkan orang lucu. Tertawalah sebanyak mungkin hari ini",
                "Manfaatkan waktu yang Anda butuhkan untuk menunggu dan berhati-hati dengan memusatkan perhatian pada indra dan napas Anda",
                "Sikat gigi Anda dengan tangan yang tidak dominan hari ini untuk membantu mendorong perhatian",
                "Selalu periksa Aplikasi Habitualizer dan diingatkan untuk selalu berhati-hati"
            ]
        },
        {
            "challenge_name": "Waktu Keluarga",
            "challenge_description": "Waktu keluarga menawarkan banyak manfaat, termasuk membangun kepercayaan diri, menciptakan ikatan emosional yang lebih kuat antara anggota keluarga, meningkatkan keterampilan komunikasi, kinerja yang lebih baik di sekolah dan mengurangi masalah perilaku, serta memberikan kesempatan untuk membuat kenangan yang dibangun di atas kesenangan, tawa dan kebersamaan",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Mintalah anak-anak Anda untuk membagikan satu jenis hal yang mereka lakukan hari ini atau rencanakan untuk dilakukan. Tawarkan rencana Anda terlebih dahulu",
                "Ajari anak-anak Anda trik kartu atau permainan kartu, atau mainkan yang Anda berdua sukai",
                "Pilih tengara, kota, atau negara yang menarik minat anak Anda dan habiskan waktu menjelajahinya melalui Youtube atau Facebook",
                "Buat makan malam spesial. Letakkan bunga segar di atas meja, nyalakan lilin, dan luangkan waktu sejenak untuk mengucapkan terima kasih bahwa Anda adalah keluarga",
                "Ambil foto keluarga",
                "Pergi ke gereja dan berdoa bersama",
                "Film keluarga dan malam pizza",
                "Menggambar potret satu sama lain",
                "Memasak makan malam bersama",
                "Mainkan 'apakah kamu lebih suka' bersama",
                "Lakukan teka-teki bersama",
                "Membuat kue atau kue kering untuk keluarga Anda",
                "Rencanakan piknik keluarga",
                "Main video game bersama",
                "Nyanyikan lagu karaoke bersama",
                "Jalan-jalan setelah makan malam bersama",
                "Mainkan permainan papan bersama",
                "Rencanakan perjalanan atau liburan",
                "Buatlah waktu khusus untuk menceritakan lelucon anak Anda. Tertawakan dia juga",
                "Memasak makan malam spesial untuk keluarga Anda",
                "Buat daftar ember keluarga",
                "Lihat foto keluarga lama atau tonton video lama",
                "Jalan-jalan/jalan-jalan bersama",
                "Menonton matahari terbit (atau matahari terbenam) bersama-sama",
                "Menghabiskan 15 menit dengan setiap anggota keluarga",
                "Kunjungi pusat alam dan hargai keindahannya",
                "Menghadiri kegiatan ekstra kurikuler anak Anda",
                "Dorong anak-anak Anda dalam hobi mereka",
                "Kejutkan anak-anak Anda dengan perjalanan atau aktivitas yang menyenangkan",
                "Selalu beri tahu mereka betapa Anda mencintai mereka"
            ]
        },
        {
            "challenge_name": "Keluar dari zona nyaman",
            "challenge_description": "Menerapkan tantangan ini akan membawa Anda menjadi orang yang lebih kuat, Anda mendapatkan kepercayaan diri melalui pengalaman, membantu Anda melanjutkan pengembangan pribadi, dan mendapatkan kesempatan untuk bertemu orang baru.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Bangun 1 jam sebelum biasanya",
                "Katakan Hai!' untuk orang asing acak",
                "Jangan buka media sosial atau nonton TV selama 24 jam",
                "Jalani seseorang di tempat kerja dan beri mereka pujian yang tulus",
                "Hubungi seseorang yang sudah lama tidak Anda ajak bicara",
                "Ambil rute yang berbeda saat pergi bekerja/sekolah",
                "Lakukan percakapan yang sulit dengan seseorang tentang topik yang Anda hindari",
                "Beli sesuatu yang tidak akan pernah Anda beli di toko kelontong",
                "Mulai belajar bahasa baru",
                "Berjalanlah ke orang asing, tersenyum, dan beri mereka pujian",
                "Mintalah bantuan jika Anda membutuhkannya atau membantu seseorang tanpa mereka meminta",
                "Buat rencana untuk akhir pekan atau hari libur",
                "Cobalah hobi/olahraga baru yang juga selalu Anda inginkan",
                "Mulailah percakapan dengan orang asing",
                "Cobalah detoks digital hari ini",
                "Buat papan visi (dapatkan inspirasi di Pinterest)",
                "Ajak dirimu berkencan",
                "Tanyakan seseorang berkencan / pujilah seseorang yang mengintimidasi Anda",
                "Mulailah blog/channel youtube/ halaman Instagram/ buku, apa pun yang diinginkan hatimu",
                "Pergi ke suatu tempat baru untuk makan atau makan",
                "Mulailah tantangan baru dengan seorang teman (Anda dapat menggunakannya dari aplikasi ini atau membuatnya sendiri)",
                "Cobalah latihan baru (zumba, yoga, pilates, kickboxing, dll)",
                "Beri seseorang hadiah spontan",
                "Daftar untuk sesuatu yang baru",
                "Ambil rute baru pulang/kerja/sekolah",
                "Tidurlah lebih awal dari yang diharapkan",
                "Perjalanan ke tempat baru",
                "Mengembangkan keterampilan baru",
                "Kirim 5 pesan terima kasih kepada 5 orang",
                "Cobalah tampilan baru"
            ]
        },
        {
            "challenge_name": "Temukan Kedamaian Batin",
            "challenge_description": "Kedamaian batin menenangkan pikiran kita dan memungkinkan kita melihat jalan kita lebih jelas, membantu kita fokus dan melacak tujuan kita.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Cobalah aromaterapi. Aroma dapat membangkitkan kenangan yang hidup dan realistis. Ketika kita mencium sesuatu yang enak, kita merasa rileks",
                "Rencanakan untuk hari esok. Ini tidak hanya memberi Anda lebih banyak waktu di pagi hari, tetapi juga membuat hidup Anda lebih tenang dan sederhana, memberi Anda waktu untuk merencanakan ke depan",
                "Dengan kehidupan kita yang sibuk dan terganggu, mudah untuk melupakan menunjukkan penghargaan kepada orang-orang yang berinteraksi dengan kita setiap hari. Luangkan waktu untuk menunjukkan rasa terima kasih kepada orang-orang di sekitar Anda",
                "Cobalah makan sesuatu dan fokus pada panca indera Anda. Benar-benar fokus pada setiap indera, rasa, penciuman, sentuhan dan penglihatan.",
                "Bersihkan ruang di rumah Anda. Ini adalah jalan untuk menyembuhkan hambatan emosional dan kebingungan batin. Ciptakan lingkungan yang tenang dan damai",
                "Tersenyumlah di cermin. Ini mungkin tampak konyol, tetapi memiliki banyak manfaat untuk kesehatan Anda. Ini memperlambat jantung, merilekskan tubuh dan melepaskan hormon untuk melawan stres",
                "Ambil napas dalam-dalam dan pejamkan mata Anda. Secara mental, tuliskan 5 hal yang membuat Anda bersyukur. Ini dapat mengubah pikiran Anda dari negatif ke positif",
                "Atur timer selama 60 detik dan fokus hanya pada pernapasan Anda. Perhatikan bagaimana suaranya dan bagaimana perasaan tubuh Anda",
                "Selamat mandi. Luangkan waktu, matikan lampu. Biarkan air mengalir ke seluruh tubuh Anda dan fokus pada sensasi dan kehangatan yang Anda rasakan",
                "Buat ritual minum teh atau kopi. Yang perlu Anda lakukan hanyalah pelan-pelan. Perhatikan apa yang Anda lakukan dan nikmati rasanya",
                "Jika tubuh Anda tegang sepanjang hari, luangkan waktu sejenak untuk rileks. Ambil napas dalam-dalam, rilekskan bahu Anda, dan buka rahang Anda",
                "Tetapkan 3 tujuan harian. Ini adalah angka yang dapat diatur dan memberi Anda waktu dan energi mental yang dibutuhkan untuk fokus pada tujuan tersebut dengan penuh perhatian dan menyeluruh",
                "Cobalah meditasi 4 menit. Setel alarm 4 menit di ponsel Anda, duduklah dengan nyaman, pejamkan mata, dan bernapaslah secara alami. Jika pikiran Anda mulai mengembara, kembalikan ke pernapasan Anda",
                "Peluk seseorang erat-erat dan ambil 3 napas besar bersama-sama. Bernapas akan membumi",
                "Beristirahatlah secara digital. Jangan mengandalkan perangkat digital Anda sebagai sumber kenyamanan. Ini menciptakan rasa urgensi yang salah dan membuat kita berpijak seolah-olah kita kehilangan sesuatu",
                "Daripada menilai apa yang dikatakan seseorang, dengarkan mereka dengan penuh perhatian, dan berikan perhatian pada apa yang dikatakan",
                "Berjalan sangat menenangkan tubuh, pikiran dan jiwa. Mulailah dengan mencari lokasi yang cocok. Amati lingkungan di sekitar Anda, berhenti dan fokus pada pepohonan, dedaunan dan tanah tempat Anda berjalan",
                "Fokus pada saat ini. Tip dasarnya adalah berhenti membandingkan masa kini dengan masa lalu dan fokus pada apa yang terjadi saat ini. Ini bisa sesederhana memfokuskan perhatian Anda pada tugas yang Anda lakukan",
                "Berdiri dan bernapas. Rasakan koneksi Anda ke bumi",
                "Pindai tubuh Anda dan perhatikan sensasi fisik atau emosi. Keluarkan sensasi, emosi, atau perasaan yang tidak menyenangkan pada napas yang keluar. Perhatikan perasaan menyenangkan apa pun dan penuhi perasaan itu pada napas",
                "Arahkan perhatian Anda pada apa yang Anda pikirkan saat ini. Menyadari aktivitas mental Anda dapat membantu Anda mendapatkan perspektif tentang pikiran Anda",
                "Kenali dirimu dan Cintai dirimu sendiri",
                "Jauhi hal-hal negatif",
                "Identifikasi dan lepaskan faktor-faktor yang menghentikan kedamaian Anda",
                "Tutup matamu saat marah",
                "Berhentilah peduli dengan orang lain yang memikirkanmu",
                "Kedamaian datang dengan menjalani hidup yang bermakna",
                "Selalu berdoa saat bangun pagi dan sebelum tidur",
                "Selesaikan konflik hidup Anda",
                "Terima keterbatasan untuk menumbuhkan ketahanan"
            ]
        },
        {
            "challenge_name": "Rutinitas Malam",
            "challenge_description": "Rutinitas malam hasil dari mendapatkan jam tidur yang cukup, Anda akan memiliki fokus yang lebih tajam dan tingkat energi yang lebih tinggi untuk hari yang produktif di pagi hari",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Refleksikan hari itu. Tulis setidaknya satu hal yang berjalan cukup baik",
                "Luangkan waktu sejenak untuk berkomunikasi dengan Tuhan melalui doa. Buka hatimu untuknya, lepaskan semua yang ada di pikiranmu, dan berterima kasih padanya untuk semua yang terjadi sepanjang hari. Ini adalah cara yang bagus untuk tidak hanya mempraktikkan rasa syukur, tetapi juga untuk tetap bertahan. berhubungan dengan Tuhan.",
                "Luangkan waktu sejenak untuk merenungkan apa yang harus Anda lakukan pada hari berikutnya dan rencanakan dengan tepat.",
                "Ambil kertas dan tuliskan apa yang ada di pikiranmu. Ini hanya berarti kamu bisa tidur tanpa harus khawatir tentang apa yang akan kamu lakukan besok karena sudah tertulis",
                "Siapkan lingkungan tidur yang baik. Pertahankan suhu kamar tidur yang baik, gunakan tirai anti tembus pandang atau sleeo mask untuk menghalangi cahaya",
                "Menulis jurnal. Luangkan waktu untuk berhenti sejenak dan merenung",
                "Nyalakan lilin beraroma dan mainkan playlist santai",
                "Lakukan peregangan/yoga sebelum tidur",
                "Tulis daftar terima kasih",
                "Bacalah buku yang bagus sebelum tidur. Membantu Anda bersantai dan tidur lebih nyenyak.",
                "Rencanakan tugas hari berikutnya, makanan, pakaian, ...",
                "Kirim ucapan selamat malam khusus untuk mengirim pesan kepada seseorang yang Anda cintai",
                "Mandi atau mandi air panas yang bagus",
                "Hentikan kafein, alkohol, atau gula setidaknya 3 jam sebelum tidur",
                "Meditasi/berdoa. Hanya menyendiri dengan pikiranmu",
                "Rapikan tempat Anda. Anda akan bisa merasa lebih tenang dan rileks",
                "Makan malam ringan sebelum tidur",
                "Tetapkan niat untuk hari esok",
                "Sebarkan beberapa minyak esensial untuk meningkatkan kualitas tidur Anda",
                "Hindari memeriksa email, berita, belajar dan bekerja sebelum tidur",
                "Jangan tidur dalam keadaan lapar. Makanlah kacang almond, pisang, atau bubur untuk membantumu tidur lebih nyenyak",
                "Hindari ponsel Anda setidaknya 1 jam sebelum tidur",
                "Minumlah teh camomile atau teh herbal lainnya (tanpa kafein) sebelum tidur",
                "Mandi atau mandi air hangat sekitar satu atau dua jam sebelum tidur dapat membantu Anda bersantai sebelum tidur",
                "Pastikan minum air sebelum tidur. Kita kehilangan kelembapan saat tidur. Yang penting terhidrasi dengan baik",
                "Sikat gigi dalam 2 menit",
                "Pikirkan tentang 24 jam terakhir Anda dan tuliskan setidaknya satu hal yang berjalan cukup baik",
                "Tulis prioritas utama untuk hari esok di perencana atau buku catatan.",
                "Kurangi kecemasan dengan To-Do List",
                "Selalu berdoa sebelum tidur dan memaafkan diri sendiri"
            ]
        },
        {
            "challenge_name": "Afirmasi Positif",
            "challenge_description": "Tantangan ini dapat membantu memperkuat harga diri dengan meningkatkan opini positif Anda tentang diri sendiri dan kepercayaan diri Anda pada kemampuan Anda untuk mencapai tujuan Anda.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Saya merangkul kemungkinan dan potensi hari ini",
                "Saya memilih untuk bahagia dan mencintai diri sendiri hari ini",
                "Saya bersedia untuk berubah dan berkembang",
                "Saya merangkul pengalaman di luar zona nyaman saya",
                "Saya berbakat dan cerdas",
                "Tantangan memberi saya kesempatan untuk berkembang",
                "Saya percaya intuisi saya untuk membimbing saya",
                "Saya jatuh cinta dengan diri saya dan tubuh saya",
                "Saya berdamai dengan masa lalu saya",
                "Saya akan bersikap baik kepada diri sendiri dan orang lain hari ini",
                "Saya memilih iman daripada ketakutan",
                "Hari ini akan menjadi hari yang positif",
                "Saya bersyukur atas semua yang saya miliki",
                "Saya lebih dari pikiran negatif saya",
                "Saya menerima diri saya tanpa syarat",
                "Saya sehat dan bahagia",
                "Segala sesuatu yang terjadi sekarang terjadi untuk kebaikan terakhir saya",
                "Saya bertanggung jawab atas apa yang saya rasakan dan hari ini saya memilih kebahagiaan",
                "Hari ini saya tidak akan membandingkan diri saya dengan orang asing di Internet",
                "Saya memiliki kekuatan untuk menciptakan perubahan",
                "Perasaan dan pikiran saya valid",
                "Saya memiliki kelimpahan dan kekuatan batin",
                "Saya siap melihat sesuatu dengan perspektif baru",
                "Saya layak dicintai dan dihormati",
                "Pikiran saya jernih, kuat dan fokus",
                "Saya menghadapi hari dengan energi dan keberanian",
                "Saya terinspirasi dan termotivasi oleh mimpi saya",
                "Saya pantas mendapatkan yang terbaik dan menerimanya sekarang",
                "Saya unik dan percaya diri",
                "Saya melihat peluang tanpa akhir dalam hidup saya"
            ]
        },
        {
            "challenge_name": "Jurnal Harian",
            "challenge_description": "Journal membantu mengendalikan gejala Anda dan memperbaiki suasana hati Anda dengan: Membantu Anda memprioritaskan masalah, ketakutan, dan kekhawatiran. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Tulislah tentang seseorang yang menginspirasi Anda",
                "Tuliskan tentang 5 berkah dalam hidupmu",
                "Posting 30 fakta tentang diri Anda",
                "Apa yang membuatmu bersemangat?",
                "Apa 3 pelajaran yang Anda ingin anak/teman/saudara Anda pelajari dari Anda",
                "Tulis tentang tantangan saat ini",
                "Tuliskan solusi untuk masalah",
                "Tuliskan apa yang ingin Anda pelajari di masa depan",
                "Buat daftar apa yang Anda sukai dari orang tua/keluarga Anda",
                "Seperti apa hari sempurna Anda?",
                "Tuliskan semua hal yang ingin kamu capai tahun ini",
                "Apa yang lebih Anda butuhkan dalam hidup Anda?",
                "Buatlah daftar hal-hal yang akan Anda lakukan jika Anda tidak takut, dan bagaimana hal itu akan memengaruhi hidup Anda",
                "Nasihat apa yang akan Anda berikan kepada Anda yang berusia sepuluh tahun?",
                "Bagaimana kamu bisa membuat hari esok lebih baik?",
                "Tuliskan semua hal yang membuat Anda gugup dan bagaimana Anda bisa mengubahnya?",
                "Apa yang kamu pelajari kemarin?",
                "Tuliskan tentang perjuangan masa lalu yang Anda atasi. Bagaimana hal itu membuat Anda lebih kuat?",
                "Apa yang kamu nantikan saat ini?",
                "Apa yang paling membuat Anda bahagia? Bagaimana Anda bisa meluangkan lebih banyak waktu untuk itu?",
                "Apa yang hilang dari hidup Anda? Dan bagaimana Anda bisa mengubahnya?",
                "Tuliskan tentang saat Anda merasa bangga pada diri sendiri",
                "Jika kamu memiliki 3 permintaan untuk tahun ini, apa yang kamu inginkan?",
                "Apa yang ada di pikiranmu sekarang?",
                "Tulislah tentang sesuatu atau seseorang yang kamu rindukan",
                "Apa yang paling Anda hargai hari ini?",
                "Tuliskan tentang momen dalam hidup Anda yang membuat Anda bahagia ketika Anda memikirkannya",
                "Jika hidup berhenti hari ini, apa yang akan kamu sesali karena tidak melakukan?",
                "Bagaimana Anda ingin orang mengingat Anda dan mengapa?",
                "Aspek apa dari diri Anda yang Anda butuhkan untuk menunjukkan lebih banyak cinta?"
            ]
        },
        {
            "challenge_name": "Rutinitas Pagi",
            "challenge_description": "Melakukan rutinitas pagi dapat meningkatkan energi, produktivitas, dan kepositifan Anda.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Duduk atau berdiri di bawah sinar matahari selama 20 menit saat Anda menjalani rutinitas pagi Anda, makan sarapan, memeriksa berita, atau berolahraga",
                "Pilih 3 Hal yang Harus Dikerjakan Sebelum Tengah Hari",
                "Prioritaskan Hari Anda. Tugas apa yang ingin Anda selesaikan hari ini?",
                "Pagi ini, luangkan beberapa menit untuk mendengarkan pikiran dan perasaan Anda, mengidentifikasinya, dan mengubahnya jika perlu",
                "Tulis daftar tugas hari ini",
                "Terhubung dengan keluarga dan teman Anda atau kirim pesan selamat pagi sederhana kepada seseorang yang Anda cintai",
                "Ambil Nafas Dalam-dalam dan Ucapkan Terima Kasih Untuk Hari Ini",
                "Tuliskan 5 hal yang kamu banggakan dari dirimu sendiri",
                "Meditasi selama 15 menit",
                "Minumlah segelas air sebelum sarapan",
                "Buka jendela Anda untuk mendapatkan udara segar dan biarkan sinar matahari masuk",
                "Jalan-jalan atau lakukan sesi latihan di rumah",
                "Baca beberapa bab dari buku favorit Anda",
                "Lakukan yoga 15 menit",
                "Dengarkan podcast atau buku audio saat Anda bersiap-siap",
                "Pergi keluar dan hirup udara pagi yang segar",
                "Buat daftar 3 hal yang harus dilakukan untuk hari itu",
                "Hindari memeriksa berita pagi dan media sosial",
                "Rapikan tempat tidur Anda dan rapikan ruang Anda agar terasa lebih produktif",
                "Pilih afirmasi untuk memandu hari Anda. Misalnya:' 'Hari ini adalah hari yang menyenangkan.'",
                "Mandi dan bersiap-siaplah meski tidak kemana-mana",
                "Jangan memeriksa segala bentuk media sosial di pagi hari",
                "Ketika Anda bangun, tarik ide bagus untuk memiliki getaran yang baik sepanjang hari",
                "Tulis daftar syukur pagi",
                "Dengarkan daftar putar musik favorit Anda untuk membuat Anda dalam suasana hati yang baik di pagi hari",
                "Lakukan peregangan setelah bangun tidur",
                "Buatlah sarapan yang sehat dan lezat untuk dirimu sendiri",
                "Jangan Cek Notifikasi Sebelum Sarapan",
                "Cat, mainkan alat musik. Lakukan sesuatu yang memicu kreativitasmu",
                "Bangun dengan senyuman dan sikap positif untuk hari depan"
            ]
        },
        {
            "challenge_name": "Pikiran Positif",
            "challenge_description": "Berpikir positif adalah kebiasaan yang bisa kita latih untuk dilakukan. Penelitian menunjukkan hal itu berdampak positif bagi kesehatan tubuh dan pikiran.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Berlatih tersenyum. Tersenyumlah pada orang asing, di cermin, tersenyumlah kapan pun Anda bisa. Anda akan merasa jauh lebih positif",
                "Hargai hal-hal kecil hari ini. Senyum seseorang, matahari terbenam, kopi pagimu, kehangatan sinar matahari, langit",
                "Alih-alih berpikir 'hidupku mengerikan', hal-hal tidak baik saat ini, tetapi ini akan berlalu. Hari-hari yang lebih baik akan datang",
                "Daripada memikirkan hal-hal mengerikan yang mungkin terjadi, pertimbangkan hal-hal hebat yang bisa datang dari situasi Anda saat ini",
                "Daripada mengatakan 'aku menyerah', katakan 'ini sulit tapi aku akan terus mencoba'",
                "Berhentilah peduli dengan apa yang dipikirkan orang lain. Pikiran orang lain tidak dirancang untuk membuatmu bahagia dan positif",
                "Daripada berpikir 'mengapa ini terjadi pada saya?', Pikirkan 'apa yang diajarkan ini kepada saya?'",
                "Percayalah bahwa hal-hal yang lebih baik akan datang jika Anda terbuka terhadap kemungkinan'",
                "Daripada berpikir 'Saya tidak bisa melakukan ini', pikirkan 'Saya belum tahu bagaimana melakukan ini'",
                "Jangan bandingkan dirimu dengan orang lain hari ini. Itu benar-benar buang-buang waktu",
                "Ingat, bahkan jika Anda tidak dapat mengendalikan situasi tertentu, Anda dapat mengontrol istirahat Anda",
                "Meditasi. Ini akan membantu Anda mengatasi overthinking, menurunkan stres dan membantu Anda menjadi lebih positif",
                "Latih pembicaraan diri yang positif. Anda dapat menggunakan afirmasi positif dengan meditasi Anda",
                "Awali atau akhiri hari Anda dengan menulis jurnal rasa syukur Anda",
                "Kelilingi diri Anda dengan orang-orang yang Anda cintai dan yang membalas cinta Anda",
                "Dengarkan musik. Musik dapat memberikan efek positif pada kesehatan dan hari Anda",
                "Latih penerimaan. Hargai semua yang kamu miliki saat ini",
                "Dengarkan video/podcast youtube yang inspiratif. Isi otakmu dengan motivasi",
                "Tuliskan 5 hal yang membuatmu tersenyum hari ini",
                "Daripada mengatakan 'Saya gagal', katakan 'Kesalahan membantu saya belajar'",
                "Batasi waktu media sosial. Luangkan lebih banyak waktu untuk membuat dan mengerjakan diri Anda sendiri daripada menghabiskan konten orang lain",
                "Tuliskan prioritas dan rencana utama Anda untuk masa depan dengan mengetahui bahwa Anda akan mencapai semua yang Anda inginkan",
                "Tetap hadir dan hargai keindahan saat ini. (Rasakan matahari di wajahmu, hargai udara segar….)",
                "Banggalah pada diri sendiri atas kemenangan kecil hari ini (dan di hari ke hari)",
                "Ubah suasana hati Anda dengan melakukan sesuatu yang benar-benar Anda nikmati",
                "Untuk situasi mendatang yang Anda khawatirkan, tuliskan skenario terbaik yang bisa terjadi",
                "Fokus pada solusi, bukan masalah",
                "Lepaskan ekspektasi orang lain dan fokus pada apa yang penting",
                "Kelilingi dirimu dengan orang-orang yang positif",
                "Jaga dirimu baik-baik. Saat kita merasakan yang terbaik, kita bisa melihat segala sesuatu dengan cara yang lebih positif"
            ]
        },
        {
            "challenge_name": "Cinta Diri",
            "challenge_description": "Terlibat dalam rutinitas perawatan diri telah terbukti secara klinis mengurangi atau menghilangkan kecemasan dan depresi, mengurangi stres, meningkatkan konsentrasi, meminimalkan frustrasi dan kemarahan, meningkatkan kebahagiaan, dan meningkatkan energi",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Tuliskan 10 hal yang Anda sukai dari diri Anda",
                "Ucapkan 'Terima Kasih' pada lima bagian tubuhmu di cermin hari ini",
                "Tulis catatan pos setiap kali kamu bangga dengan dirimu sendiri. Taruh di toples 'Aku bangga dengan diriku sendiri'",
                "Maafkan dirimu atas penyesalan yang selama ini kamu pertahankan dan lepaskan",
                "Tulislah daftar dengan semua hal yang Anda sukai tentang diri Anda",
                "Perlakukan tubuh Anda dengan makanan sehat dan banyak air",
                "Bersihkan kamar/meja/lemari Anda dan bersihkan semua barang tipis yang tidak lagi membawa kebahagiaan bagi Anda",
                "Ambil foto diri Anda dan tuliskan semua yang Anda sukai tentang penampilan Anda",
                "Berhenti mengikuti siapa pun yang membuat Anda merasa tidak aman dan buruk tentang diri Anda sendiri",
                "Pergi ke suatu tempat Anda dapat menyaksikan matahari terbit/terbenam dan menikmatinya sendiri",
                "Selalu berpakaian untuk dirimu sendiri. Kenakan pakaian favoritmu hari ini",
                "Refleksikan dalam minggumu dan tulislah 5 hal yang kamu syukuri",
                "Buatlah jurnal tentang apa yang Anda rasakan dan apa yang terjadi dalam hidup Anda",
                "Pergilah berkencan dengan dirimu sendiri. Pergi ke restoran favoritmu, pergi ke pantai... Di suatu tempat dimana kamu merasa nyaman dan santai dimana kamu bisa terhubung dengan dirimu sendiri",
                "Rencanakan hadiah untuk diri sendiri ketika Anda menyelesaikan tantangan ini",
                "Jalan-jalan dan terhubung dengan alam",
                "Tuliskan tantangan terbesar yang telah Anda atasi",
                "Cabut untuk sepanjang hari dari teknologi apa pun (kecuali jika Anda memiliki pekerjaan yang harus dilakukan)",
                "Makan makanan atau makanan penutup favorit Anda",
                "Tulislah surat cinta untuk dirimu sendiri",
                "Tuliskan apa yang telah Anda pelajari dari tantangan ini dan jangan lupa tentang hadiah yang Anda rencanakan di Hari 15",
                "Apa sesuatu yang kamu suka lakukan ketika kamu masih kecil? Lakukan hari ini",
                "Buat makanan bergizi",
                "Mengejar teman lama atau saudara",
                "Tidur siang yang kuat",
                "Menonton film yang Anda inginkan",
                "Buat kolase video selfie favorit Anda",
                "Tuliskan 5 hal yang sangat Anda kuasai",
                "Tuliskan tentang prestasi yang Anda banggakan",
                "Pilih 3 afirmasi positif untuk diucapkan setiap hari. Contoh. Saya bisa melakukannya."
            ]
        },
        {
            "challenge_name": "Meningkatkan Kepercayaan Diri",
            "challenge_description": "Kepercayaan diri juga dapat memberi Anda pandangan positif tentang kehidupan, meningkatkan kesejahteraan mental dan emosional Anda.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Berhenti mengikuti semua akun media sosial yang membuat Anda merasa tidak aman tentang diri sendiri",
                "Bekerjalah untuk menerima pujian daripada menyangkalnya hari ini",
                "Sadarlah tentang postur Anda. Postur tubuh yang baik mengembangkan lebih banyak kepercayaan diri",
                "Lakukan sesuatu yang Anda suka lakukan sebagai seorang anak",
                "Lakukan sesuatu yang menantang hari ini, ingatlah bahwa kita tidak tumbuh ketika kita berada di zona nyaman kita",
                "Tuliskan 10 hal yang Anda sukai dari diri Anda",
                "Katakan ya untuk sesuatu yang biasanya tidak kamu lakukan",
                "Terapkan kebiasaan baru yang sehat",
                "Bicaralah ketika Anda ingin mengatakan sesuatu",
                "Fokus pada apa yang Anda inginkan daripada apa yang tidak Anda inginkan",
                "Bekerjalah untuk meningkatkan keterampilan Anda pada sesuatu yang Anda sukai atau yang ingin Anda mulai lakukan",
                "Tuliskan semua pencapaian Anda termasuk yang di masa depan",
                "Lakukan olahraga cepat, mandi, bersiap-siap dan kenakan pakaian yang membuat Anda merasa hebat",
                "Pergi sendiri untuk melihat matahari terbenam",
                "Hubungi teman lama",
                "Munculkan pikiran positif untuk setiap hal negatif",
                "Beri seseorang nasihat yang baik",
                "Lakukan latihan yang Anda sukai",
                "Bekerjalah pada hal-hal kecil. Prestasi kecil membuatmu merasa baik",
                "Jeda dan renungkan sesuatu sebelum Anda bertindak, alih-alih bereaksi secara impulsif",
                "Jadilah autentik dan rangkul keunikanmu. Hidup bukanlah kompetisi",
                "Jangan berbicara negatif tentang orang lain sepanjang hari",
                "Tuliskan satu hal yang telah kamu lakukan untuk keluargamu",
                "Tulislah surat cinta untuk dirimu sendiri",
                "Tuliskan 3 ketakutan dan bagaimana Anda bisa mengatasi masing-masing",
                "Identifikasi perubahan yang ingin Anda buat dan langkah-langkah untuk melakukannya",
                "Lakukan sesuatu yang membuatmu merasa istimewa",
                "Minta tiga teman untuk memberi tahu Anda hal favorit mereka tentang Anda",
                "Tuliskan 3 kesalahan Anda dan pelajaran yang didapat",
                "Tetapkan tujuan yang dapat dicapai untuk diri sendiri"
            ]
        },
        {
            "challenge_name": "Tindakan Kebaikan",
            "challenge_description": "Tindakan kebaikan dapat meningkatkan perasaan percaya diri, memegang kendali, kebahagiaan, dan optimisme. Mereka juga dapat mendorong orang lain untuk mengulangi perbuatan baik yang mereka alami sendiri – berkontribusi pada komunitas yang lebih positif.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Tunjukkan dukungan kepada seseorang hari ini",
                "Mendonorkan darah. Menyelamatkan nyawa",
                "Berikan ulasan positif tentang restoran/kedai kopi favorit Anda",
                "Buat anggota keluarga/orang tersayang sarapan di tempat tidur",
                "Tanyakan seseorang bagaimana Anda dapat membantu mereka - dan kemudian melakukannya.",
                "Tersenyumlah pada seseorang yang membutuhkannya",
                "Berikan ulasan positif untuk aplikasi favorit Anda",
                "Berikan tip untuk pemulung",
                "Tanyakan kepada orang tua/saudara/anak Anda apakah ada yang bisa Anda lakukan untuk membantu mereka",
                "Tuliskan daftar alasan mengapa Anda mencintai seseorang dan berikan kepada mereka",
                "Beri seseorang tip",
                "Habiskan hari hanya dengan mengatakan hal-hal positif tentang orang lain",
                "Beri tahu seseorang yang Anda cintai betapa Anda menghargai mereka",
                "Lakukan tugas yang biasanya tidak Anda lakukan",
                "Katakan 'Semoga harimu menyenangkan' minimal 3 orang yang kamu temui",
                "Beli makan untuk seorang tunawisma",
                "Bantulah seseorang sebelum mereka meminta",
                "Membuat kue dan memberikannya kepada seseorang",
                "Cobalah untuk menyumbangkan pakaian/mainan/buku ke badan amal setempat",
                "Telepon seseorang yang sudah lama tidak kamu ajak bicara",
                "Yang terpenting dari semuanya, selalu bersikap baik pada diri sendiri",
                "Tuliskan ucapan terima kasih kepada seseorang yang memberi dampak dalam hidup Anda",
                "Biarkan seseorang berjalan di depan Anda saat mengantre",
                "Kejutkan seseorang dengan hadiah",
                "Letakkan catatan tempel positif di cermin",
                "Check in dengan kerabat lanjut usia",
                "Berikan 3 pujian jujur ​​untuk seseorang yang kamu cintai",
                "Ucapkan terima kasih sebanyak-banyaknya",
                "Pujian seseorang",
                "Hindari pikiran negatif selama sehari. Tunjukkan kebaikan juga pada dirimu sendiri!"
            ]
        },
        {
            "challenge_name": "Kesehatan Mental",
            "challenge_description": "Dalam hal kesehatan mental Anda, perawatan diri dapat membantu Anda mengelola stres, menurunkan risiko penyakit, dan meningkatkan energi Anda. Bahkan tindakan perawatan diri kecil dalam kehidupan sehari-hari Anda dapat berdampak besar. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Mengelola Kecemasan",
                "Sebelum tidur, tulislah 3 hal yang kamu hargai dari hari ini",
                "Latih belas kasih diri",
                "Latih perhatian penuh. Tarik diri Anda kembali ke masa sekarang",
                "Luangkan waktu untuk hobi. Tingkatkan mood Anda dan lakukan tugas yang Anda sukai",
                "Ambil istirahat media sosial untuk hari itu dan fokus pada kehidupan di sekitar Anda",
                "Tanam sesuatu. Merawat sesuatu selain diri sendiri memiliki banyak manfaat mental.",
                "Pikirkan bagian terbaik dari hidup Anda saat Anda sedang menunggu sesuatu",
                "Pelajari cara berbicara tentang kesehatan mental kepada orang tua, pendidik, teman, anggota keluarga, dan orang lain yang dekat dengan Anda.",
                "Bukalah tentang sesuatu di pikiranmu",
                "Fokus pada istirahat dan bersantai hari ini dan tidur lebih awal",
                "Jalan-jalan tanpa melihat ponsel Anda, fokus pada lingkungan Anda",
                "Bayangkan tempat yang bahagia setiap kali Anda merasa cemas",
                "Baca atau tonton sesuatu yang baik untuk kesehatan mental Anda",
                "Bayangkan kehidupan impian Anda dan tuliskan langkah-langkah apa yang perlu Anda bicarakan untuk mencapainya",
                "Latih pembicaraan diri yang positif",
                "Perbarui motivasi Anda",
                "Mulailah jelajahi akar dari segala pikiran negatif",
                "Tuliskan 5 hal yang kamu syukuri",
                "Latihan perawatan diri dan manjakan diri Anda",
                "Tuliskan afirmasi positif dan bacalah sebelum tidur",
                "Ambil napas dalam-dalam sebanyak 3 kali kapan pun Anda bisa",
                "Rencanakan makanan sehat",
                "Berikan teriakan kepada seseorang yang Anda hargai.",
                "Panggil seseorang yang kamu cintai yang sudah lama tidak kamu ajak bicara",
                "Cobalah meditasi terbimbing",
                "Pelajari keterampilan baru untuk mengalihkan pikiran Anda dari masalah dan kecemasan",
                "Tulislah jurnal dari segala sesuatu yang terjadi dalam pikiran Anda",
                "Makan makanan yang bergizi.",
                "Nyanyikan lagu favorit Anda. Menyanyi membantu mengatur pernapasan dan mengurangi kecemasan"
            ]
        },
        {
            "challenge_name": "Perbaiki jadwal tidur Anda",
            "challenge_description": "Tantangan harian ini dimaksudkan untuk membantu Anda menerapkan rutinitas tidur yang sehat, cukup tidur, dan bangun dengan perasaan segar setiap pagi.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Singkirkan ponsel Anda sehingga keesokan paginya Anda harus bangun dari tempat tidur untuk mematikan alarm",
                "Matikan semua layarmu 1 jam sebelum tidur agar otakmu siap untuk tidur",
                "Hadiah diri Anda dengan sarapan yang enak agar Anda lebih termotivasi untuk bangun pagi",
                "Mandi di malam hari, mandi air panas atau mandi akan membantu Anda untuk bersantai sebelum tidur",
                "Cobalah untuk bangun di waktu yang sama setiap hari, konsistensi adalah kuncinya",
                "Setelah makan malam kenakan piyama nyaman Anda, jurnal, baca sudut dan bersiaplah untuk bersantai dan biarkan pikiran Anda rileks",
                "Minum banyak air setelah bangun tidur, kamu tidak akan merasa terlalu lelah sepanjang hari",
                "Cobalah makan malam lebih awal, karena Anda akan mencerna makanan lebih awal, tubuh Anda bisa fokus untuk mendapatkan tidur nyenyak yang dibutuhkan",
                "Berolahraga/lari cepat di pagi hari, ini akan membantu Anda merasa berenergi di siang hari dan mengantuk saat harus tidur",
                "Meditasi sebelum tidur, itu santai dan mengurangi stres",
                "Buka jendela ketika Anda bangun dan biarkan sinar matahari menyentuh kulit Anda",
                "Rencanakan kegiatan Anda malam ini dan juga to-do-list Anda untuk keesokan paginya",
                "Dengarkan daftar putar favorit Anda setelah bangun untuk membuat Anda dalam suasana hati yang baik",
                "Setel pengingat yang akan mengingatkan Anda 30 menit sebelum waktu tidur",
                "Menghabiskan energi di siang hari agar Anda cepat lelah di malam hari",
                "Berhenti minum air putih 1 jam sebelum tidur agar tidak terbangun saat malam atau bangun saat hendak tidur",
                "Bereskan tempat tidurmu setelah bangun tidur agar kamu tidak tergoda untuk kembali tidur lagi",
                "Dengarkan musik ringan sebelum tidur, ini akan membantu Anda untuk segera tidur",
                "Setelah bangun tidur langsung ke kamar mandi untuk mencuci muka atau mandi",
                "Makan makanan dengan magnesium (seperti almond, kacang tanah dan biji labu) dan seng untuk meningkatkan kualitas tidur Anda",
                "Hembuskan udara segar ketika Anda bangun. Segarkan pikiran Anda yang membantu otak Anda jernih di pagi hari",
                "Gunakan tempat tidur Anda murni untuk tidur dan seks saja. Tidak menonton tv.",
                "Tidak ada kafein 6 jam sebelum waktu tidur yang dipilih",
                "Hindari makan besar sebelum tidur",
                "Jadikan kamar Anda segelap dan setenang mungkin",
                "Hindari tidur siang karena bisa mengganggu siklus tidur Anda",
                "Tetapkan suhu yang sejuk dan konsisten",
                "Tidurlah hanya ketika kamu mengantuk",
                "Hindari percakapan yang sulit sebelum tidur",
                "Cuci atau ganti seprai dan sarung bantal"
            ]
        },
        {
            "challenge_name": "Perawatan diri",
            "challenge_description": "Perawatan diri berarti meluangkan waktu untuk melakukan hal-hal yang membantu Anda hidup dengan baik dan meningkatkan kesehatan fisik dan mental Anda.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Rencanakan hari Anda dan patuhi itu",
                "Tulis jurnal, catat emosi dan pengalaman Anda",
                "Latih hobi yang benar-benar Anda nikmati",
                "Bacalah buku kesukaanmu sejak kecil",
                "Olahraga di rumah. Cari video latihan di Youtube",
                "Cobalah untuk memasak sesuatu yang baru",
                "Bagikan sesuatu yang Anda pikirkan dengan orang tua atau teman Anda",
                "Buat rutinitas pagi",
                "Telepon keluarga dan teman Anda",
                "Memecahkan permainan puzzle",
                "Lakukan beberapa karya seni. Anda dapat menemukan ide di internet",
                "Dengarkan lagu favoritmu",
                "Main permainan-permainan papan",
                "Tulislah surat untuk seseorang yang spesial",
                "Ikuti kursus online untuk mempelajari sesuatu keterampilan baru",
                "Nonton film baru",
                "Tidur siang yang kuat untuk mengistirahatkan pikiran dan tubuh Anda",
                "Dengarkan beberapa podcast",
                "Meditasi untuk menenangkan pikiran dan bebas dari kecemasan",
                "Mandi santai",
                "Tetapkan tujuan Anda untuk masa depan",
                "Bernyanyilah bersama lagu favoritmu",
                "Video chat dengan seseorang yang Anda sayangi",
                "Buat rutinitas tidur",
                "Tidak mengeluh",
                "Selalu temukan waktu untuk berdoa.",
                "Katakan 'Tidak' pada hal negatif",
                "Bersihkan dan atur tempat Anda",
                "Tetapkan tujuan untuk minggu depan",
                "Mintalah bantuan jika Anda membutuhkannya"
            ]
        },
        {
            "challenge_name": "Studi Efektif",
            "challenge_description": "Belajar bagaimana menjadi lebih sukses dengan studi Anda. Tetapkan tujuan yang efektif dan jelas untuk mencapai nilai yang lebih tinggi, pelajari cara mengatur waktu dan meningkatkan keterampilan belajar Anda.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Tata dan bersihkan meja Anda untuk belajar",
                "Rencanakan sesi belajar dan siapkan bahan belajar",
                "Atasi kelemahanmu dan temukan tujuan dan motivasi belajarmu",
                "Pelajari silabus Anda dan mulailah aktif dalam kursus Anda",
                "Selalu atur jadwal Anda dan buat catatan",
                "Tulis catatan Anda dengan tangan dan sorot kata kunci",
                "Peraturan 5-10. Pelajari 50 menit setiap jam. Luangkan 10 menit untuk membersihkan pikiran",
                "Tinjau catatan Anda sebelum Anda tidur",
                "Setel timer dan hanya fokus pada satu tugas",
                "Belajarlah seperti kamu sedang mengajar seseorang",
                "Janjikan diri Anda hadiah jika Anda menyelesaikan semua tugas",
                "Gunakan warna dan stabilo di catatan Anda",
                "Gunakan hanya Google dan Youtube untuk memahami konsep",
                "Makan sehat. Tubuh Anda akan terasa lebih baik dan Anda akan lebih waspada",
                "Ringkas konsep",
                "Belajarlah bersama temanmu. Mintalah temanmu untuk menanyaimu tentang mata pelajaran yang sulit",
                "Ulas kembali apa yang Anda pelajari hari ini atau minggu ini",
                "Gunakan aplikasi atau kartu flash untuk pembelajaran yang lebih baik",
                "Prioritaskan tugas Anda. Selesaikan tugas utama terlebih dahulu",
                "Gunakan peta pikiran untuk mengatur informasi",
                "Pilih tempat belajar yang tenang tanpa gangguan",
                "Jangan lupa untuk Menghilangkan Stres. Jaga tingkat stres Anda tetap rendah dan kurangi rasa khawatir",
                "Tinjau catatan Anda sebelum Anda memulai pekerjaan rumah Anda",
                "Pelajari kembali masalah pekerjaan rumah, tutupi jawabannya dan kuis sendiri",
                "Buatlah daftar konsep atau rumus penting",
                "Buat ujian tiruanmu sendiri",
                "Belajarlah seperti ujian kejutan besok.",
                "Tidur yang cukup karena sangat membantu retensi memori",
                "Cari teknik memori yang sesuai dengan studi Anda secara efektif",
                "Jangan pernah takut untuk meminta bantuan"
            ]
        },
        {
            "challenge_name": "Hubungan Pasangan",
            "challenge_description": "Tantangan hubungan ini dirancang agar mudah diintegrasikan ke dalam kehidupan sehari-hari Anda. Banyak tantangan yang hanya membutuhkan waktu beberapa menit untuk dilakukan dan dapat dilakukan kapan saja sepanjang hari. Beberapa tantangan memerlukan sedikit lebih banyak energi dan perencanaan, tapi itu akan sia-sia.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Buatlah daftar hal-hal yang Anda sukai dari pasangan Anda",
                "Rencanakan kencan malam kejutan",
                "Beri tahu pasangan Anda bahwa Anda mencintai mereka tanpa syarat",
                "Bagikan ketakutan yang Anda miliki tentang hubungan Anda",
                "Bagikan kenangan indah yang Anda miliki tentang pasangan Anda",
                "Kirimkan pesan pagi yang romantis kepada pasangan Anda",
                "Terima kasih pasangan Anda untuk sesuatu hari ini",
                "Kejutkan pasangan Anda dengan sesuatu yang baik",
                "Bagikan tujuan yang Anda miliki untuk hubungan Anda",
                "Beri pasangan Anda pujian",
                "Rencanakan liburan akhir pekan",
                "Lihat foto-foto lama bersama",
                "Ingat saat pertama kali bertemu",
                "Buat daftar ember bersama",
                "Pilih kata acak dan mulailah percakapan mendalam dengan pasangan Anda",
                "Lakukan teka-teki bersama",
                "Tulislah surat cinta untuk pasanganmu dan sembunyikan untuk mereka temukan nanti",
                "Lakukan sesuatu yang disukai pasangan Anda bersama-sama",
                "Buat suguhan favorit",
                "Beri tahu pasangan Anda sesuatu yang Anda ingat mereka sukai",
                "Beri pasangan Anda ciuman dan pelukan kejutan",
                "Beri pasangan Anda pijatan yang menenangkan",
                "Buat pasangan Anda sarapan di tempat tidur",
                "Mainkan permainan papan bersama",
                "Tanyakan padanya bagaimana Anda bisa menjadi pasangan yang lebih baik",
                "Tinggalkan dia catatan kecil yang manis",
                "Jalan-jalan bareng",
                "Beri pasangan Anda pujian hari ini",
                "Ikuti kuis hubungan",
                "Menari pelan dengan lagu romantis"
            ]
        },
        {
            "challenge_name": "Declutter",
            "challenge_description": "Mengurangi kekacauan dalam hidup kita—baik secara fisik, digital, atau lainnya—memungkinkan kita untuk mengatasi stres secara langsung dan itu bermanfaat bagi kesehatan mental kita.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Bersihkan lemarimu",
                "Atur buku Anda",
                "Tata kamar tidur Anda",
                "Bersihkan nakas Anda",
                "Sortir melalui surat Anda",
                "Atur dapur Anda",
                "Sumbangkan pakaian yang tidak terpakai",
                "Kosongkan ruang komputer atau laptop Anda",
                "Bersihkan lemari es Anda dan singkirkan barang-barang kedaluwarsa",
                "Bersihkan mobilmu",
                "Periksa surat-surat dan surat-surat lama",
                "Kosongkan freezer Anda",
                "Bersihkan dompetmu",
                "Tata dapur Anda",
                "Bersihkan meja atau ruang kerja Anda",
                "Singkirkan pakaian lama",
                "Atur perlengkapan kebersihan Anda",
                "Atur meja rias Anda",
                "Hapus aplikasi yang tidak Anda gunakan lagi",
                "Bersihkan lemari obat",
                "Atur semuanya ke dalam folder di komputer Anda",
                "Tata ruang tamu Anda",
                "Beli item penyimpanan fungsional",
                "Bersihkan aksesori pribadi",
                "Luangkan waktu untuk membersihkan mobil/motor/sepeda",
                "Perbarui dan atur kalender Anda",
                "Bersihkan tanaman mati dan atur pot",
                "Mengatur barang kering (bumbu) dan membersihkan barang kadaluarsa",
                "Mengatur dan memberi label wadah penyimpanan dan rak",
                "Meditasi untuk membersihkan pikiran Anda"
            ]
        },
        {
            "challenge_name": "Produktivitas",
            "challenge_description": "Produktivitas yang baik dapat membantu Anda menetapkan tujuan yang lebih baik, lebih efektif, meningkatkan fokus, dan meningkatkan motivasi.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Bersihkan tempat tidurmu di pagi hari agar tidak tergoda untuk kembali tidur",
                "Tuliskan 3 hal yang kamu syukuri setiap hari",
                "Atur ruang yang berantakan untuk meningkatkan tempat kerja",
                "Menghabiskan lebih sedikit waktu di telepon dan menjadi lebih produktif",
                "Gunakan perencana harian untuk mencapai semua yang telah Anda rencanakan",
                "Matikan notifikasi yang tidak perlu di ponsel untuk menghindari gangguan",
                "Buat rencana makan sepanjang minggu",
                "Buat daftar tugas dan coba selesaikan semua tugas",
                "Berjalanlah selama 30 menit untuk menghirup udara segar dan merasa termotivasi untuk menaklukkan dunia",
                "Declutter kotak email. Terkadang bisa sedikit berlebihan",
                "Olahraga selama 30 menit meskipun tidak melakukan apa-apa di siang hari, Anda akan merasa sangat produktif setelah berolahraga",
                "Baca bab buku sebelum tidur untuk melupakan media sosial",
                "Hindari menonton TV agar Anda punya lebih banyak waktu untuk diri sendiri",
                "Atur lemari Anda dan sumbangkan barang-barang yang tidak Anda inginkan lagi",
                "Buat daftar putar musik dengan lagu favorit Anda dan dance line tidak ada yang melihat Anda",
                "Jangan memeriksa ponsel Anda segera setelah Anda bangun dan menikmati pagi yang tenang dan damai",
                "Meditasi selama 10 menit dan Anda akan merasa segar kembali",
                "Atur dapur dan lemari es Anda.",
                "Bersihkan kamar Anda secara mendalam. Ruang yang bersih, pikiran yang jernih",
                "Berhenti berlangganan orang yang tidak membawa kebahagiaan lagi. Anda akan merasa jauh lebih lega",
                "Jadwalkan waktu istirahat di siang hari Anda untuk memiliki waktu untuk bersantai",
                "Bangun lebih awal dari biasanya. Orang-orang sukses memulai hari mereka lebih awal.",
                "Membaca buku-buku motivasi dan inspirasi membantu Anda untuk mendapatkan kembali kepercayaan Anda pada diri sendiri",
                "Berhentilah mencoba melakukan banyak tugas",
                "Buat daftar hal-hal yang ingin Anda hentikan",
                "Bergerak. Berjalan. Regangkan. Duduk tegak",
                "Tuliskan ide-ide yang muncul di kepala Anda, tetapi jangan mulai mengerjakannya. Jadwalkan",
                "Nikmati sarapan sehat agar energi lebih produktif sepanjang hari",
                "Ketika Anda menyelesaikan sesuatu, sekecil apa pun, tulislah",
                "Delegasikan. Anda tidak harus melakukan semuanya"
            ]
        },
        {
            "challenge_name": "Kebahagiaan",
            "challenge_description": "Studi ilmiah menunjukkan bahwa kebahagiaan dikaitkan dengan sejumlah manfaat, termasuk produktivitas yang lebih tinggi, kreativitas yang lebih besar, dan ketahanan yang lebih kuat dalam menghadapi stres.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Tuliskan hal-hal yang Anda sukai tentang diri Anda",
                "Tersenyumlah pada setiap orang yang kamu lewati",
                "Lakukan olahraga",
                "Memasak makan malam",
                "Peluk seseorang yang kamu cintai",
                "Menonton film komedi",
                "Panggil teman",
                "Menarilah seperti tidak ada yang melihat",
                "Pergilah ke alam dan jadilah penjelajah selama sehari",
                "Beli hadiah untuk seseorang yang kamu cintai",
                "Cobalah melakukan yoga",
                "Tidur lebih awal dan bangun lebih awal juga",
                "Baca sesuatu yang menginspirasi",
                "Meditasi selama 10 menit",
                "Rencanakan liburan masa depan",
                "Cobalah resep baru atau masak makanan favorit Anda",
                "Melihat matahari terbenam yang indah",
                "Terhubung dengan teman lamamu",
                "Maafkan seseorang",
                "Mencoba sesuatu yang baru",
                "Jalan-jalan di luar",
                "Dengarkan lagu favoritmu",
                "Lakukan satu kebaikan kecil atau bantu teman atau tetangga",
                "Berbagi tawa dengan seseorang",
                "Berikan pelukan pada anak/orang tua/teman/saudara",
                "Bermain dengan anjing Anda atau hewan peliharaan lainnya",
                "Habiskan lebih sedikit waktu di ponsel Anda",
                "Beri tahu orang-orang betapa berartinya mereka bagi Anda",
                "Lepaskan orang dan kebiasaan toxic",
                "Refleksikan perjalanan Anda dari Hari 1"
            ]
        },
        {
            "challenge_name": "Tantangan Kebebasan Finansial",
            "challenge_description": "Salah satu manfaat terpenting dari kemandirian finansial adalah memberikan Anda kendali lebih besar atas hidup Anda sendiri.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Tentukan tujuan keuangan Anda",
                "Buat anggaran bulan depan",
                "Mengembangkan dana darurat",
                "Temukan situs web dan blog keuangan",
                "Tabung untuk pensiun",
                "Temukan vlog literasi keuangan di Youtube",
                "Mengadopsi minimalis",
                "Beli buku uang dan mulailah membacanya",
                "Pertimbangkan karir Anda",
                "Otomatiskan uang Anda",
                "Pantau skor kredit Anda",
                "Anggaran uang Anda",
                "Temukan cara untuk mengurangi tagihan belanjaan Anda",
                "Belajar menghitung persentase",
                "Jelajahi cara mendapatkan penghasilan tambahan",
                "Jual apa yang tidak Anda butuhkan/gunakan",
                "Baca lebih lanjut tentang investasi",
                "Temukan strategi untuk mencegah pengeluaran emosional",
                "Kurang menghabiskan hari",
                "Tulis rencana penghematan untuk pembelian di masa mendatang",
                "Cari cara untuk mengurangi tagihan",
                "Baca tentang pengelolaan uang",
                "Pelajari istilah keuangan dasar",
                "Pelajari cara kerja kartu kredit",
                "Tulis rencana untuk melunasi hutang",
                "Temukan cara untuk meminimalkan pengeluaran yang tidak penting",
                "Otomatiskan tagihan Anda",
                "Rayakan kemajuan Anda",
                "Mendaftar untuk kursus literasi keuangan",
                "Tetap di jalan menuju kebebasan finansial"
            ]
        },
        {
            "challenge_name": "Pengasuhan yang Positif",
            "challenge_description": "Mempraktikkan pengasuhan yang positif adalah panduan penting antara orang tua dan anak-anak untuk mendapatkan hasil perkembangan yang positif seperti harga diri, kepercayaan, kompetensi diri, ikatan yang lebih kuat antara orang tua dan anak, serta aliran komunikasi yang lebih baik dan efektif.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Lakukan sesuatu dengan anak Anda yang Anda tahu mereka sukai",
                "Tanyakan pada anak Anda apa yang menjadi favoritnya",
                "Lakukan kerajinan dengan anak-anak seperti kupu-kupu piring kertas kami",
                "Luangkan setidaknya 30 menit satu lawan satu waktu dengan anak Anda",
                "Baca cerita pengantar tidur",
                "Jalan-jalan bareng",
                "Peluk anakmu empat kali hari ini",
                "Memasak sesuatu untuk anak Anda yang mereka sukai",
                "Ambil beberapa foto bersama atau bahkan buat photobooth DIY",
                "Tanyakan pada anak Anda hal spesial apa yang ingin mereka lakukan",
                "Bawa mereka ke tempat favorit mereka",
                "Buat 'Happy box' bersama",
                "Menulis cerita bersama. Ajak anak menggambar",
                "Buat sidik jari bersama",
                "Ajari anak Anda bagaimana melakukan sesuatu yang baru hari ini",
                "Ajari anakmu tentang uang",
                "Nyalakan musik dan menari bersama",
                "Buat permainan papan keluarga",
                "Dapatkan hadiah kecil untuk mereka dan sembunyikan di rumah untuk mereka temukan",
                "Panggang muffin atau Masak pancake dan bawa ke tetangga",
                "Buat kartu untuk orang tua lain bersama",
                "Bicaralah hal-hal positif tentang anak Anda hari ini",
                "Tanyakan apa yang mereka pikirkan",
                "Tanya hewan favorit mereka dan lakukan proyek yang menyenangkan bersama",
                "Ajari anak Anda keterampilan hidup",
                "Pergilah berjalan-jalan di alam. Kumpulkan item dari daftar",
                "Semoga harimu berwarna. Berpakaianlah berwarna, makanlah makanan yang berwarna.",
                "Lakukan kerajinan yang menyenangkan untuk kakek-nenek",
                "Main bareng play dough. Adakan lomba moulding",
                "Tanyakan kepada anak Anda memori favorit mereka. Rencanakan untuk melakukannya lagi"
            ]
        },
        {
            "challenge_name": "Mengatasi Depresi",
            "challenge_description": "Tantangan ini memandu Anda untuk mengatasi depresi dan mengingatkan Anda bahwa ada harapan besar untuk penyembuhan. Depresi sangat dapat diobati. Banyak orang yang mengalami depresi akan pulih sepenuhnya. Yang lain menemukan beberapa tingkat kelegaan dari gejala mereka. Perjuangannya adalah sepadan - kapasitas untuk berkembang dalam kehidupan setelah depresi ada di sana.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Sentuhan sangat penting dalam penyembuhan depresi. Stroke hewan peliharaan, peluk teman dan keluarga, lanjutkan hubungan seks dengan pasangan Anda atau pijat.",
                "Keluarlah selama 15 menit aktivitas fisik. Cobalah berlari. Bersihkan halaman. Jalan-jalan dengan hewan peliharaan Anda.",
                "Diet dapat memainkan peran besar dalam membantu meringankan depresi. Pastikan Anda makan dengan baik dan teratur, bahkan jika Anda tidak nafsu makan",
                "Tidur yang cukup",
                "Tersenyumlah dan ubah postur Anda untuk mengubah perasaan Anda.",
                "Bacalah contoh-contoh positif tentang bagaimana orang-orang telah mengatasi masalah kesehatan mental dan ketahuilah itu mungkin bagi Anda juga.",
                "Lupakan masa depan dan masa lalu. Tanyakan pada diri sendiri 'Sekarang, di sini, di saat ini, apa yang salah?'",
                "Tambahan vitamin Anda untuk meningkatkan hormon bahagia. Kekurangan vitamin B3 dan vitamin D, yang dibuat di kulit oleh sinar matahari, juga dikaitkan dengan depresi",
                "Dengarkan suara hati Anda. Apakah itu kasar atau kritis? Apakah Anda akan memperlakukan orang lain dengan penilaian yang sama? Apakah pemikiran ini membangun atau merusak?",
                "Pastikan Anda keluar setiap hari karena siang hari dan sinar matahari meningkatkan serotonin dan dibutuhkan untuk vitamin D",
                "Jangan merasa malu. Anda mungkin terkejut mengetahui berapa banyak orang yang menderita depresi secara diam-diam. Bicaralah dengan keluarga dan teman Anda.",
                "Putuskan hubungan yang kasar",
                "Luangkan waktu dengan hewan peliharaan Anda",
                "Kamu lebih kuat dari depresimu",
                "Dengarkan musik setiap hari",
                "Lakukan hal-hal yang pernah membuatmu bahagia meskipun kamu tidak menyukainya",
                "Hindari isolasi",
                "Tertawa adalah penangkal penting untuk depresi.",
                "Lakukan apa yang kamu sukai",
                "Hindari alkohol dan narkoba",
                "Temukan Peluang Relawan sebagai Cara untuk Tidak Merasa Kesepian",
                "Ketahui Kapan Harus Terlibat atau Keluar dari Dunia Online",
                "Temukan Sesuatu untuk Dinantikan",
                "Lakukan kebalikan dari apa yang disarankan oleh 'suara depresi'",
                "Temukan cara-cara kecil untuk melayani orang lain",
                "Jangan terpaku pada masalah. Fokuslah pada solusi yang tepat",
                "Memiliki tujuan yang bisa diterapkan untuk memberi Anda rasa pencapaian",
                "Bersyukurlah dan perhatikan 3 hal baik dalam setiap hari",
                "Minta orang yang dicintai untuk memeriksa Anda secara teratur.",
                "Tantang pikiran negatif."
            ]
        }
    ]
}