{
    "all_challenges": [
        {
            "challenge_name": "Вызов по преодолению тревожности",
            "challenge_description": "Меньше беспокойтесь и получайте больше удовольствия от жизни с нашей проверенной задачей. Скажите да, чтобы бросить себе вызов, и через месяц вы почувствуете себя лучше.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/manage_anxiety_icon",
            "challenges": [
                "Позаботьтесь о своем режиме сна.",
                "Это нормально просить о помощи.",
                "Признайте свои чувства.",
                "Молитесь и просите Божьего руководства.",
                "Запишите свои эмоции.",
                "Визуализируйте что-нибудь вдохновляющее.",
                "Остановить негативные модели мышления.",
                "Найди в жизни положительные стороны.",
                "Имейте сострадание к себе и своему беспокойству.",
                "Исследуйте корень любых негативных мыслей.",
                "Наберитесь смелости, чтобы встретиться лицом к лицу с тем, чего вы избегаете",
                "Тревога — это нормально. Распознайте симптомы и научитесь их контролировать",
                "Перечислите вещи, которых вы избегаете из-за беспокойства. Поделитесь этим",
                "Укрепите один из своих навыков преодоления трудностей, проведя небольшое исследование",
                "Займитесь йогой на Youtube специально для беспокойства",
                "Читай что-нибудь, что полезно для твоего психического здоровья",
                "Отремонтируй то, что было повреждено твоим беспокойством",
                "Идите куда-нибудь, что вас расслабит и уменьшит тревогу",
                "Ешьте сегодня так, чтобы было приятно телу, уму и душе",
                "Сделайте что-нибудь, что поможет вам перезарядиться там, где вы чувствуете себя истощенным",
                "Проведите 20 минут, слушая звуки природы",
                "Убедитесь, что ваши ленты в социальных сетях не вызывают беспокойства",
                "Работайте над своим разговором с самим собой, никаких злых слов в свой адрес",
                "Проведите полное сканирование тела. Где вы держите свою тревогу?",
                "Сосредоточьтесь на сне, отдыхе и здоровом сне",
                "Измените в своем дне одну вещь, которая уменьшит вашу тревожность",
                "Практика внимательности",
                "Прокрутите фотопленку своего телефона. Когда вы найдете изображение, которое вызывает у вас улыбку, поделитесь им с теми, кто еще на нем есть",
                "Поговорите с кем-то, кто, по вашему мнению, тоже борется с тревогой. Просто скажите об этом, это может помочь вам обоим",
                "Отметьте свою цель с первого дня. Каковы ваши успехи?"
            ]
        },
        {
            "challenge_name": "Чувствую себя прекрасно",
            "challenge_description": "Проведите время, которое заставит вас чувствовать себя немного лучше и чудеснее, приняв этот аффективный вызов.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/feel_wonderful_icon",
            "challenges": [
                "Подумайте о удивительных вещах, которые вы уже сделали в этом году.",
                "Сосредоточьтесь на позитиве",
                "Составьте список вещей, которые делают вас счастливыми.",
                "Ешьте любимые детские закуски.",
                "Танцуй вокруг своего дома.",
                "Попробуйте выпить 8 стаканов воды.",
                "Посмотри свой любимый фильм.",
                "Преобразите свою спальню/рабочее место",
                "Наблюдай за закатом/рассветом, слушая любимые песни",
                "Приготовь здоровую еду",
                "Купи то, что тебе очень хочется (шоколад, цветок…)",
                "Сделай кому-нибудь что-нибудь приятное",
                "Создай свой собственный плейлист с песнями, которые приносят тебе радость",
                "Смотрите на звезды, когда можете",
                "Закажи любимую еду и побалуй себя",
                "Идти гулять",
                "Приготовь любимый напиток дома",
                "Послушайте подкаст о том, что вас интересует",
                "Собери пазл",
                "Посмотри фильм из детства",
                "Сделай себе пиццу/любимое блюдо",
                "Отправить кому-нибудь сообщение Спасибо в Messenger/WhatsApp",
                "Наденьте сегодня свои любимые вещи.",
                "Узнай новое слово",
                "Составьте план меню на неделю",
                "Общайтесь со своими детьми/братьями и сестрами",
                "Сделай комплимент 3 людям сегодня",
                "Доделай, наконец, незаконченный проект",
                "Сегодня никаких сладостей, газировки и фаст-фуда",
                "Запланируйте веселый день с семьей"
            ]
        },
        {
            "challenge_name": "Намеренная жизнь",
            "challenge_description": "Выполнение этого ежедневного небольшого задания изменит вашу жизнь и сделает вас лучшей версией себя",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/international_living_icon",
            "challenges": [
                "Молитесь, проснувшись сегодня. Благодарите Бога за новый день, полный возможностей",
                "Поставь намерение или просто 3 цели на день",
                "Будьте преднамеренными со словами, которые вы говорите о себе и других",
                "Напишите список благодарностей, старайтесь включать его каждое утро/вечер",
                "Держитесь подальше от экранов как минимум за 1 час до сна",
                "Приготовьте что-нибудь, что вы любите, и ешьте осознанно.без отвлекающих факторов",
                "Проведите сеанс ухода за собой, примите ванну, сделайте маску для лица и наслаждайтесь каждой секундой процесса",
                "Возьмите 20-минутный дневник о своем опыте в этом месяце",
                "Держи телефон подальше, пока ешь",
                "Награждайте себя, когда вы выполняете свои задачи. Это может быть так же просто, как просто дать себе время сделать то, что вам действительно нравится",
                "Посмотри в зеркало и скажи себе, что ты прекрасна и на все способна",
                "Займитесь 15-минутным сеансом йоги/медитации",
                "Слушайте вдохновляющую музыку. Выбирайте песни, которые будут поддерживать ваши эмоции в вашем плейлисте",
                "Выразите свое творчество сегодня. Рисуйте, рисуйте, пишите, танцуйте, просто делайте что-нибудь",
                "Погулять на природе",
                "Сделайте сознательный выбор, чтобы использовать социальные сети с умом и осознанно. Установите границы и выберите контент, который положительно влияет на ваше самочувствие",
                "Выделите 10 минут, чтобы записать все, что вы хотели бы сделать, и составьте план сделать хотя бы одно из них в следующем месяце",
                "Отписаться от аккаунтов в Instagram, которые вам больше не нравятся",
                "Позвольте себе несколько минут, чтобы просто посидеть и подышать. Просто будьте в моменте",
                "Побалуйте себя кусочком рая. Зайдите в свою любимую кондитерскую, купите любимую, посидите где-нибудь в тишине и смакуйте каждый кусочек",
                "Обратите внимание на свое психическое здоровье. Будьте преднамеренными и осознавайте свои эмоции и душевное состояние. Не бойтесь просить о помощи, когда она вам нужна",
                "Ешьте и наслаждайтесь едой сегодня без телефона или экрана",
                "Снова свяжитесь с кем-нибудь. Составьте план с другом в Messenger, Facetime, WhatApp или встретитесь, чтобы наверстать упущенное",
                "Послушайте мотивационную речь на Youtube",
                "Загляните в блог Habitualize",
                "Сегодня съешьте 3 разных вида фруктов",
                "Запиши 3 дела, которые нужно выполнить завтра",
                "Делай интуитивную ходьбу",
                "Пиши дневник на 10 минут или больше",
                "Мечтайте по-крупному. Установите намерения. Создайте доску визуализации"
            ]
        },
        {
            "challenge_name": "Выучить новый язык",
            "challenge_description": "Изучать новый язык сложно, но это также может быть весело, просто и без усилий. Выполнение 30-дневного задания по изучению языка позволит вам каждый день улучшать свои знания языка.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/languages_icon",
            "challenges": [
                "Выучи 5 новых слов",
                "Попробуйте новое языковое приложение",
                "Посмотрите фильм на изучаемом языке с субтитрами",
                "Напишите списки покупок / дел на целевом языке",
                "Научите кого-нибудь некоторым словам и фразам",
                "Спросите: Как дела? другу",
                "Посмотрите учебник по языку",
                "Напишите о своем опыте сегодня",
                "Расскажи о том, что ты делаешь",
                "Посмотрите видеоурок на Youtube о языке",
                "Научи кого-нибудь 5 новым словам",
                "Изучите базовую грамматику",
                "Журнал на вашем целевом языке",
                "Читать новостную статью",
                "Поговори с человеком или со своим питомцем",
                "Изменить настройки телефона на день",
                "Написать рецензию на книгу/фильм",
                "Читай что-нибудь",
                "Запишите себя, практикуя язык",
                "Напиши 40 слов, которые ты выучил",
                "Напишите, как вам помог этот челлендж",
                "Вы все еще помните слова, которые выучили в первый день?",
                "Ответь на онлайн-викторину на изучаемом языке",
                "Научи члена семьи 7-10 новым словам",
                "Напиши 50 слов, которые ты выучил",
                "Напиши что-нибудь о своем дне",
                "Послушайте песню на языке",
                "Написать историю",
                "Слушай подкаст",
                "Создавайте карточки, чтобы легко запоминать слова"
            ]
        },
        {
            "challenge_name": "Вызов осознанности",
            "challenge_description": "Практика осознанности помогает перезагрузить ваш разум и получить четкую перспективу, когда вы теряете концентрацию или чувствуете себя подавленным в жизни",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mindfulness_challenge_icon",
            "challenges": [
                "Прежде чем приступить к какой-либо задаче сегодня, спросите себя, для чего вы ее выполняете, и на мгновение задумайтесь об этом",
                "Внимательный душ. Визуализируйте смывание негативных мыслей и сконцентрируйтесь на ощущении воды на коже",
                "Перед сном запишите 3 вещи, которые вы действительно цените за день",
                "Практикуйте благодарность. Начните сосредотачиваться на позитивных мыслях и избавьтесь от своего страха и беспокойства",
                "Переустанавливайте свою позу каждый раз, когда вы садитесьп, мягко выпрями спину",
                "Займитесь сегодня спортом и сосредоточьтесь на физических ощущениях",
                "Практикуйте активное слушание сегодня. Это означает, что вы должны сосредоточиться на том, что говорит другой человек, и реагировать соответствующим образом",
                "Проведите сканирование тела. Перенесите внимание на свое тело и направьте дыхание на любые области напряжения",
                "Найдите спокойное место, где вы можете сесть и написать все, что вы чувствуете в данный момент",
                "Будьте любопытны сегодня. Практикуйтесь в том, чтобы интересоваться тем, что происходит, и направлять свое внимание на то, чтобы узнать об этом больше",
                "Обратите внимание на свои ощущения, когда пробуете, осязаете, обоняете и слышите что-то",
                "Осознанное дыхание. Вдох, задержка на 3 секунды и выдох",
                "Идите осознанно. Примите позу, чтобы почувствовать связь с землей и прочно укоренившиеся в ней корни",
                "Внимательно выпейте чашку чая. Сосредоточьтесь на вкусе, запахе и тепле",
                "Практикуйте непредвзятое слушание во время разговора",
                "Делай одно дело за раз и сосредоточься только на этом",
                "Сядьте удобно, почувствуйте, как ваши ноги твердо стоят на полу, прямая спина и руки на коленях. Некоторое время сосредоточьтесь на дыхании",
                "Прислушайтесь к себе, отвечая на телефонный звонок или во время разговора, как вы говорите, какие слова выбираете",
                "Цени все сегодня. Замечай все, что происходит, и найди способ это ценить",
                "Внимательно наблюдайте. Опишите мысленно предмет в деталях, цвете, фактуре, форме…",
                "Посидите немного в уютном и тихом месте",
                "Выполняйте одну задачу за раз и сосредоточьтесь на том, что вы делаете",
                "Проявляйте сочувствие к тому, кто обычно вас расстраивает",
                "Найдите статью или видео о том, почему ошибки и неудачи полезны для вас. Примите это близко к сердцу, чтобы меньше времени уделять прошлому",
                "Ешьте осознанно. Попробуйте блюдо и попытайтесь угадать, сколько ингредиентов в него вошло",
                "Оглянитесь вокруг. Посмотрите на определенный лист/дерево/цветок и сосредоточьте свое внимание",
                "Находите смешные фильмы, рассказывайте смешные анекдоты, слушайте забавных людей. Смейтесь сегодня как можно больше",
                "Используйте время, когда вам нужно подождать, и будьте внимательны, сосредоточившись на своих чувствах и дыхании",
                "Почистите сегодня зубы недоминантной рукой, чтобы привлечь внимание",
                "Всегда проверяйте приложение Habitualizer и всегда будьте внимательны"
            ]
        },
        {
            "challenge_name": "Время с семьей",
            "challenge_description": "Время, проведенное с семьей, дает много преимуществ, в том числе укрепление доверия, создание более сильной эмоциональной связи между членами семьи, улучшение навыков общения, повышение успеваемости в школе и уменьшение поведенческих проблем, а также возможность создавать воспоминания, основанные на веселье, смех и единение",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/family_time_icon",
            "challenges": [
                "Попросите детей рассказать, что они сегодня сделали или планируют сделать. Сначала предложите свои планы",
                "Научите детей карточному фокусу или карточной игре или сыграйте в ту, которая понравится вам обоим",
                "Выберите достопримечательность, город или страну, которая интересна вашему ребенку, и проведите время, изучая ее через Youtube или Facebook",
                "Приготовьте особенный ужин. Поставьте на стол свежие цветы, зажгите свечи и найдите минутку, чтобы выразить благодарность за то, что вы семья",
                "Сделай семейное фото",
                "Идите в церковь и помолитесь вместе",
                "Семейный фильм и вечер пиццы",
                "Рисуем портреты друг друга",
                "Приготовить ужин вместе",
                "Поиграйте вместе в Хотели бы вы",
                "Собери пазл вместе",
                "Испеки торт или печенье для своей семьи",
                "Устроить семейный пикник",
                "Играть вместе в видеоигры",
                "Поем песни под караоке вместе",
                "Погулять вместе после ужина",
                "Поиграем вместе в настольную игру",
                "Планируйте поездку или отпуск",
                "Выделите особое время, чтобы рассказать ребенку анекдоты. Посмейтесь и над ним тоже",
                "Приготовь особенный ужин для своей семьи",
                "Создать семейный список",
                "Посмотрите старые семейные фотографии или посмотрите старые видео",
                "Погулять/погулять вместе",
                "Встретить восход (или закат) вместе",
                "Проведите по 15 минут с каждым членом семьи",
                "Посетите природный центр и оцените его красоту",
                "Посещайте внеклассные занятия вашего ребенка",
                "Поощряйте своих детей в их увлечениях",
                "Удивите своих детей путешествием или веселым занятием",
                "Всегда говори им, как сильно ты любишье их"
            ]
        },
        {
            "challenge_name": "Выйдите из зоны комфорта",
            "challenge_description": "Выполнение этого задания поможет вам стать сильнее, обрести уверенность в себе благодаря полученному опыту, поможет продолжить личностное развитие и даст возможность познакомиться с новыми людьми.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/getout_from_comfortzone_icon",
            "challenges": [
                "Вставайте на 1 час раньше обычного",
                "Скажи привет!' случайному незнакомцу",
                "Не заходить в соцсети и не смотреть телевизор 24 часа",
                "Подойдите к кому-нибудь на работе и сделайте искренний комплимент",
                "Свяжись с кем-то, с кем давно не разговаривал",
                "Езжай на работу/учебу другим маршрутом",
                "Начните трудный разговор с кем-то на тему, которую вы избегали",
                "Купи то, что никогда не купишь в продуктовом магазине",
                "Начни учить новый язык",
                "Подойдите к незнакомцу, улыбнитесь и сделайте ему комплимент",
                "Попросите о помощи, если она вам нужна, или помогите кому-то без просьбы",
                "Планируй выходные или выходной",
                "Попробуйте новое хобби/спорт, о котором вы всегда мечтали",
                "Начать разговор с незнакомцем",
                "Попробуйте цифровой детокс сегодня",
                "Создайте доску визуализации (вдохновляйтесь на Pinterest)",
                "Пригласи себя на свидание",
                "Пригласить кого-нибудь на свидание/сделать комплимент тому, кто вас пугает",
                "Заведи блог/канал на YouTube/страницу в Instagram/книгу, все, что душе угодно",
                "Иди в новое место, чтобы поесть или взять с собой",
                "Начать новый вызов с другом (вы можете использовать его в этом приложении или создать свой собственный)",
                "Попробуйте новую тренировку (зумба, йога, пилатес, кикбоксинг и т. д.)",
                "Подарите кому-нибудь спонтанный подарок",
                "Подпишитесь на что-то новое",
                "Новым маршрутом домой/на работу/учебу",
                "Ложись спать раньше, чем ожидалось",
                "Путешествие в новое место",
                "Развитие нового навыка",
                "Отправить 5 сообщений с благодарностью 5 людям",
                "Попробуй новый образ"
            ]
        },
        {
            "challenge_name": "Обрести внутренний покой",
            "challenge_description": "Внутренний покой успокаивает наш разум и позволяет нам намного яснее увидеть свой путь, помогая нам сосредоточиться и отслеживать наши цели.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/find_inner_peace_icon",
            "challenges": [
                "Попробуйте ароматерапию. Аромат может вызвать яркие и реалистичные воспоминания. Когда мы чувствуем приятный запах, мы расслабляемся",
                "Планируйте завтра. Это не только дает вам больше времени по утрам, но и делает вашу жизнь спокойнее и проще, позволяя вам планировать заранее",
                "С нашей занятой и рассеянной жизнью легко забыть о выражении благодарности людям, с которыми мы общаемся каждый день. Найдите время, чтобы выразить благодарность людям вокруг вас",
                "Попробуйте съесть что-нибудь и сосредоточьтесь на своих пяти чувствах. На самом деле сосредоточьтесь на каждом чувстве, вкусе, обонянии, осязании и зрении",
                "Наведите порядок в доме. Это путь к избавлению от эмоциональных блоков и внутреннего смятения. Создайте спокойную, мирную обстановку",
                "Улыбнитесь зеркалу. Это может показаться смешным, но это имеет много преимуществ для вашего здоровья. Это замедляет сердцебиение, расслабляет тело и высвобождает гормоны для противодействия стрессу",
                "Сделайте глубокий вдох и закройте глаза. Мысленно перечислите 5 вещей, за которые вы были благодарны. Это может изменить ваши мысли с негативных на позитивные",
                "Установите таймер на 60 секунд и сосредоточьтесь исключительно на своем дыхании. Обратите внимание на то, как оно звучит и как себя чувствует ваше тело",
                "Примите осознанную ванну. Сделайте перерыв, выключите свет. Позвольте воде течь по вашему телу и сосредоточьтесь на ощущениях и тепле, которые вы чувствуете",
                "Создайте чайный или кофейный ритуал. Все, что вам действительно нужно сделать, это замедлиться. Сосредоточьтесь на том, что вы делаете, и насладитесь вкусом",
                "Если ваше тело напряжено в течение дня, найдите минутку, чтобы расслабиться. Сделайте глубокий вдох, расслабьте плечи и разожмите челюсть",
                "Поставьте 3 ежедневные цели. Это управляемое число, которое позволяет вам тратить время и умственную энергию, необходимые для осознанного и тщательного сосредоточения на них",
                "Попробуйте 4-минутную медитацию. Установите 4-минутный будильник на своем телефоне, сядьте поудобнее, закройте глаза и дышите естественно. Если ваш разум начинает блуждать, верните его к дыханию",
                "Крепко обнимите кого-нибудь и сделайте 3 больших вдоха вместе. Дыхание заземлит вас",
                "Сделайте цифровой перерыв. Не полагайтесь на свои цифровые устройства как на источник комфорта. Они создают ложное ощущение срочности и заставляют нас стоять на ногах, как будто мы что-то упустили",
                "Вместо того, чтобы судить о том, что кто-то говорит,внимательно слушайте их и обращайте внимание на то, что говорится",
                "Ходьба очень успокаивает тело, разум и дух. Начните с поиска подходящего места. Наблюдайте за окружающей средой, остановитесь и сосредоточьтесь на деревьях, листве и земле, по которой вы идете",
                "Сосредоточьтесь на настоящем. Основной совет — перестаньте сравнивать настоящее с прошлым и сосредоточьтесь на том, что происходит в данный момент. Это может быть так же просто, как сосредоточить свое внимание на задаче, которую вы выполняете",
                "Встань и дыши. Почувствуй свою связь с землей",
                "Сканируйте свое тело и отмечайте физические ощущения или эмоции. Выпускайте любые неприятные ощущения, эмоции или чувства на выдохе. Отмечайте любые приятные ощущения и наполняйте ими себя на вдохе",
                "Направьте свое внимание на то, о чем вы думаете в настоящем. Осознание своей умственной деятельности может помочь вам получить представление о своих мыслях",
                "Познай себя и полюби себя",
                "Держись подальше от негатива",
                "Определите и отпустите факторы, которые мешают вашему спокойствию",
                "Закрой глаза, когда злишься",
                "Перестань заботиться о том, чтобы другие думали о тебе",
                "Мир приходит, когда живешь осмысленной жизнью",
                "Всегда молитесь, когда вы просыпаетесь утром и перед сном",
                "Решить конфликты своей жизни",
                "Примите ограничения, чтобы повысить устойчивость"
            ]
        },
        {
            "challenge_name": "Ночная рутина",
            "challenge_description": "Результаты ночной рутины - достаточное количество часов сна, у вас будет более четкая фокусировка и более высокий уровень энергии для продуктивного дня утром",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/sleep_schedule_icon",
            "challenges": [
                "Подумай о прошедшем дне. Напиши хотя бы одну вещь, которая прошла очень хорошо",
                "Найдите минутку, чтобы пообщаться с Богом через молитву. Откройте Ему свое сердце, отпустите все, что у вас на уме, и поблагодарите Его за все, что произошло в течение дня. Это отличный способ не только практиковать благодарность, но и оставаться связан с Богом",
                "Найдите минутку, чтобы подумать о том, что вы должны сделать на следующий день, и спланируйте это соответствующим образом",
                "Возьми бумагу и записывай все, что у тебя на уме. Это означает только то, что ты можешь идти спать, не беспокоясь о том, что ты будешь делать завтра, потому что это уже записано",
                "Хороших условий для сна. Поддерживайте в спальне хорошую температуру, используйте плотные шторы или солярийную маску, чтобы блокировать свет",
                "Пишите дневник. Найдите время, чтобы сделать паузу и подумать",
                "Зажгите ароматические свечи и включите расслабляющий плейлист",
                "Займитесь растяжкой/йогой перед сном",
                "Напишите список благодарностей",
                "Почитайте хорошую книгу перед сном. Она поможет вам расслабиться и лучше заснуть.",
                "Планируйте свои дела на следующий день, еду, одежду, …",
                "Отправьте специальное сообщение спокойной ночи тому, кого вы любите",
                "Примите горячий душ или ванну",
                "Откажитесь от кофеина, алкоголя или сахара как минимум за 3 часа до сна",
                "Медитируй/молись. Просто будь наедине со своими мыслями",
                "Приведите в порядок свое место. Вы сможете чувствовать себя спокойнее и расслабленнее",
                "Легкий ужин перед сном",
                "Установи намерения на завтра",
                "Распылите эфирные масла, чтобы улучшить качество сна",
                "Не проверяйте электронную почту, новости, не учитесь на работе перед сном",
                "Не ложитесь спать голодным. Съешьте немного миндаля, банана или каши, чтобы лучше спать",
                "Избегайте использования телефона как минимум за 1 час до сна",
                "Выпейте ромашковый чай или другой травяной чай (без кофеина) перед сном",
                "Примите теплую ванну или душ примерно за час или два до сна, и это поможет вам расслабиться перед сном",
                "Обязательно пейте воду перед сном. Мы теряем влагу, когда спим. Важно хорошо увлажнять",
                "Почисти зубы за 2 минуты",
                "Подумай о своих последних 24 часах и запиши хотя бы одну вещь, которая прошла очень хорошо",
                "Запишите главные приоритеты на завтра в планировщик или блокнот.",
                "Уменьшить тревогу с помощью списка дел",
                "Всегда молись перед сном и прощай себя"
            ]
        },
        {
            "challenge_name": "Положительное подтверждение",
            "challenge_description": "Это испытание может помочь укрепить самооценку, повысив как ваше положительное мнение о себе, так и вашу уверенность в своей способности достичь своих целей. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_affirmations_icon",
            "challenges": [
                "Я принимаю возможности и потенциал этого дня",
                "Я выбираю быть счастливым и любить себя сегодня",
                "Яжелание меняться и расти",
                "Я принимаю опыт за пределами моей зоны комфорта",
                "Я талантлив и умен",
                "Вызовы дают мне возможность расти",
                "Я доверяю своей интуиции вести меня",
                "Я влюблена в себя и свое тело",
                "Я в мире со своим прошлым",
                "Сегодня я буду добр к себе и другим",
                "Я выбираю веру вместо страха",
                "Сегодня будет позитивный день",
                "Я благодарен за все, что у меня есть",
                "Я больше, чем мои негативные мысли",
                "Я принимаю себя безоговорочно",
                "Я здоров и счастлив",
                "Все, что происходит сейчас, происходит для моего конечного блага",
                "Я отвечаю за то, что чувствую, и сегодня я выбираю счастье",
                "Сегодня я не буду сравнивать себя с незнакомцами в Интернете",
                "У меня есть сила создавать изменения",
                "Мои чувства и мысли действительны",
                "У меня есть изобилие и внутренняя сила",
                "Я готов смотреть на вещи с новой точки зрения",
                "Я достоин любви и уважения",
                "Мой разум ясен, силен и сосредоточен",
                "Я встречаю день с энергией и мужеством",
                "Меня вдохновляют и мотивируют мои мечты",
                "Я заслуживаю лучшего и принимаю это сейчас",
                "Я уникален и уверен в себе",
                "Я вижу безграничные возможности в своей жизни"
            ]
        },
        {
            "challenge_name": "Ежедневный дневник",
            "challenge_description": "Ведение дневника помогает контролировать симптомы и улучшать настроение: Помогает расставить приоритеты в проблемах, страхах и заботах.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/daily_journaling_icon",
            "challenges": [
                "Напиши о том, кто тебя вдохновляет",
                "Напиши о 5 благословениях в своей жизни",
                "Опубликовать 30 фактов о себе",
                "Чем ты взволнован?",
                "Какие 3 урока вы хотите, чтобы ваши дети/друзья/братья и сестры узнали от вас",
                "Написать о текущей задаче",
                "Напишите решения проблем",
                "Запишите, чему вы хотите научиться в будущем",
                "Перечислите, что вам нравится в ваших родителях/семье",
                "Как бы выглядел твой идеальный день?",
                "Напишите все, чего вы хотите достичь в этом году",
                "Что тебе еще нужно в жизни?",
                "Составьте список вещей, которые вы бы сделали, если бы не боялись, и как они повлияли бы на вашу жизнь",
                "Какой совет вы бы дали десятилетнему себе?",
                "Как сделать завтра лучше?",
                "Напишите обо всем, что заставляет вас нервничать, и как вы могли бы это изменить?",
                "Что вы узнали вчера?",
                "Напишите о прошлой борьбе, которую вы преодолели. Как это сделало вас сильнее?",
                "Чего вы ждете с нетерпением сейчас?",
                "Что приносит тебе наибольшую радость? Как уделить этому больше времени?",
                "Чего вам не хватает в жизни? И как вы можете это изменить?",
                "Напишите о времени, когда вы гордились собой",
                "Если бы у вас было 3 желания на этот год, что бы вы загадали?",
                "Что у тебя сейчас на уме?",
                "Напиши о чем-то или о ком-то, по кому скучаешь",
                "Что вы больше всего цените в сегодняшнем дне?",
                "Напишите о моменте в вашей жизни, который делает вас счастливым, когда вы думаете об этом",
                "Если бы жизнь остановилась сегодня, о чем бы вы жалели, что не сделали?",
                "Каким вы хотите, чтобы люди запомнили вас и почему?",
                "Какие аспекты себя вам нужны, чтобы проявлять больше любви?"
            ]
        },
        {
            "challenge_name": "Утренняя рутина",
            "challenge_description": "Утренняя рутина может повысить вашу энергию, продуктивность и позитивный настрой.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/morning_routine_icon",
            "challenges": [
                "Сядьте или постойте на солнце в течение 20 минут, пока вы занимаетесь утренней рутиной, завтракаете, проверяете новости или занимаетесь спортом",
                "Выберите 3 дела, которые нужно выполнить до полудня",
                "Расставьте приоритеты на день. Какие задачи вы надеетесь выполнить сегодня?",
                "Сегодня утром потратьте несколько минут на то, чтобы прислушаться к своим мыслям и чувствам, определить их и изменить, если нужно",
                "Напиши список дел на сегодня",
                "Общайтесь со своей семьей и друзьями или отправьте простое сообщение с добрым утром тому, кого вы любите",
                "Сделай глубокий вдох и скажи спасибо за этот день",
                "Напиши 5 вещей, которыми ты гордишься",
                "Медитация 15 минут",
                "Выпей стаканвода перед завтраком",
                "Откройте окна на свежий воздух и впустите немного солнечного света",
                "Прогуляйтесь или сделайте домашнюю тренировку",
                "Прочитай несколько глав из любимой книги",
                "Займись 15-минутной йогой",
                "Послушайте подкаст или аудиокнигу, пока готовитесь",
                "Выйдите на улицу и просто подышите свежим утренним воздухом",
                "Составьте список из 3 дел, которые нужно сделать в течение дня",
                "Избегайте проверки утренних новостей и социальных сетей",
                "Заправьте постель и приведите в порядок свое пространство, чтобы чувствовать себя более продуктивно",
                "Выберите аффирмацию, которой вы будете руководствоваться в течение дня. Например: Сегодня отличный день",
                "Прими душ и соберись, даже если ты никуда не идешь",
                "С утра первым делом не проверяйте никакие социальные сети",
                "Проснувшись, притяни хорошую идею, чтобы зарядиться хорошим настроением на весь день",
                "Напиши утренний список благодарностей",
                "Слушайте свой любимый музыкальный плейлист, чтобы поднять себе настроение с утра",
                "Сделайте растяжку после пробуждения",
                "Приготовьте себе полезный и вкусный завтрак",
                "Не проверять уведомления перед завтраком",
                "Рисуйте, играйте на музыкальных инструментах. Делайте что-то, что подпитывает ваше творчество",
                "Просыпайтесь с улыбкой и позитивным настроем на предстоящий день"
            ]
        },
        {
            "challenge_name": "Позитивное мышление",
            "challenge_description": "Позитивное мышление — это привычка, которой мы можем себя научить. Исследования показывают, что это положительно влияет на здоровье как тела, так и разума.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_mindest_icon",
            "challenges": [
                "Практикуйтесь улыбаться. Улыбайтесь незнакомцам, в зеркале, улыбайтесь всякий раз, когда можете. Вы почувствуете себя намного позитивнее",
                "Цени сегодня мелочи. Чью-то улыбку, закат, свой утренний кофе, тепло солнечного луча, небо",
                "Вместо того, чтобы думать: Моя жизнь ужасна, сейчас все не так хорошо, но это пройдет. Наступают лучшие дни",
                "Вместо того, чтобы думать об ужасных вещах, которые могут произойти, подумайте о великих вещах, которые могут возникнуть в вашей нынешней ситуации",
                "Вместо того, чтобы сказать: Я сдаюсь, скажите: Это сложно, но я буду стараться",
                "Перестаньте заботиться о том, что думают другие люди. Мысли других людей не предназначены для того, чтобы делать вас счастливыми и позитивными",
                "Вместо того, чтобы думать почему это происходит со мной?, подумайте чему это меня учит?",
                "Верьте в лучшее, если вы открыты для возможностей",
                "Вместо того, чтобы думать: Я не могу этого сделать, подумайте: Я еще не знаю, как это сделать",
                "Не сравнивайте себя ни с кем сегодня. Это пустая трата времени",
                "Помните, даже если вы не можете контролировать определенную ситуацию, вы можете контролировать свой отдых",
                "Медитируйте. Это поможет вам переосмыслить, снизит стресс и поможет вам быть более позитивным",
                "Практикуйте позитивный разговор с самим собой. Вы можете использовать позитивные аффирмации во время медитации",
                "Начните или закончите свой день написанием дневника благодарности",
                "Окружите себя людьми, которых вы любите и которые любят вас в ответ",
                "Слушайте музыку. Музыка может оказать положительное влияние на ваше здоровье и день",
                "Практикуйте принятие. Цените все, что у вас есть прямо сейчас",
                "Послушайте вдохновляющее видео/подкаст на YouTube. Наполните свой мозг мотивацией",
                "Перечислите 5 вещей, которые сегодня заставили вас улыбнуться",
                "Вместо того, чтобы говорить Я потерпел неудачу, скажите: Ошибки помогают мне учиться",
                "Ограничьте время в социальных сетях. Тратьте больше времени на создание и работу над собой, чем на потребление чужого контента",
                "Запишите свои главные приоритеты и планы на будущее, зная, что вы добьетесь всего, чего хотите",
                "Оставайтесь в настоящем и цените красоту момента. (Почувствуйте солнце на своем лице, оцените свежий воздух….)",
                "Гордитесь собой маленькими победами сегодня (и в повседневной жизни)",
                "Измените свое настроение, делая то, что вам действительно нравится",
                "Для предстоящей ситуации, которая вас беспокоит, запишите лучший сценарий, который может произойти",
                "Сосредоточьтесь на решениях, а не на проблемах",
                "Отпусти ожидания других и сосредоточься на том, что важно",
                "Окружите себя позитивными людьми",
                "Позаботьтесь о себе. Когда мы чувствуем себя лучше, мы можем смотреть на вещи более позитивно"
            ]
        },
        {
            "challenge_name": "Любовь к себе",
            "challenge_description": "Клинически доказано, что ежедневный уход за собой снижает или устраняет тревожность.и депрессии, уменьшают стресс, улучшают концентрацию, минимизируют разочарование и гнев, повышают уровень счастья и повышают уровень энергии",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_love_icon",
            "challenges": [
                "Перечислите 10 вещей, которые вы любите в себе",
                "Скажи спасибо своим пяти частям тела в зеркале сегодня",
                "Пишите заметку каждый раз, когда вы гордитесь собой. Поместите ее в банку Я горжусь собой",
                "Прости себя за сожаление, за которое ты цеплялся, и отпусти его",
                "Напишите список всего, что вам нравится в себе",
                "Побалуйте свое тело здоровой пищей и большим количеством воды",
                "Очистите свою комнату/стол/кладовую и выкиньте все вещи, которые больше не приносят вам радости",
                "Сфотографируйте себя и запишите все, что вам нравится в своей внешности",
                "Отпишитесь от любого, кто заставляет вас чувствовать себя неуверенно и плохо о себе",
                "Идите куда-нибудь, где вы сможете наблюдать восход/закат солнца и наслаждаться им в одиночестве",
                "Всегда одевайтесь для себя. Наденьте сегодня свой любимый наряд",
                "Подумай о своей неделе и напиши 5 вещей, за которые ты благодарен",
                "Веди дневник о том, что ты чувствуешь и что происходит в твоей жизни",
                "Сходите на свидание с собой. Сходите в свой любимый ресторан, сходите на пляж… Где-нибудь, где вы чувствуете себя хорошо и расслабленно, где вы можете соединиться с самим собой",
                "Придумайте себе награду, когда закончите это испытание",
                "Совершите долгую прогулку и соединитесь с природой",
                "Запишите самую большую проблему, которую вы преодолели",
                "Отключите на весь день любую технику (если у вас нет работы)",
                "Ешьте любимое блюдо или десерт",
                "Напиши себе любовное письмо",
                "Запишите, что вы узнали из этого испытания, и не забывайте о своей награде, которую вы запланировали на 15-й день",
                "Что вы любили делать в детстве? Сделайте это сегодня",
                "Приготовь сытную еду",
                "Встретиться со старым другом или родственником",
                "Вздремнуть после обеда",
                "Посмотрите фильм, который вы давно хотели",
                "Сделай видеоколлаж из любимых селфи",
                "Перечислите 5 вещей, в которых вы действительно хороши",
                "Напишите о достижении, которым вы гордитесь",
                "Выберите 3 позитивных утверждения, чтобы произносить их каждый день. Например, я могу это сделать"
            ]
        },
        {
            "challenge_name": "Повысить уверенность",
            "challenge_description": "Уверенность также может дать вам позитивный взгляд на жизнь, улучшая ваше психическое и эмоциональное благополучие.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/confidence_icon",
            "challenges": [
                "Отмените подписку на все аккаунты в социальных сетях, которые заставляют вас чувствовать себя неуверенно",
                "Работайте над тем, чтобы принимать комплименты, а не отказываться от них сегодня",
                "Следите за своей осанкой. Хорошая осанка развивает уверенность",
                "Делайте то, что вы любили делать в детстве",
                "Сделайте что-нибудь сложное сегодня, помните, что мы не растем, когда находимся в своей зоне комфорта",
                "Напишите 10 вещей, которые вы любите в себе",
                "Скажи да тому, на что ты обычно не стал бы",
                "Внедрите новую здоровую привычку",
                "Говори, когда тебе есть что сказать",
                "Сосредоточьтесь на том, чего вы хотите, а не на том, чего вы не хотите",
                "Работайте над улучшением своих навыков в том, что вы любите делать или чем хотели бы начать заниматься",
                "Запишите все свои достижения, в том числе и будущие",
                "Сделайте быструю тренировку, примите душ, приготовьтесь и наденьте одежду, в которой вы чувствуете себя прекрасно",
                "Выйди один, чтобы встретить закат",
                "Пообщаться со старым другом",
                "Придумывайте позитивные мысли на каждую негативную",
                "Дайте кому-нибудь хороший совет",
                "Занимайтесь спортом, который вам нравится",
                "Работайте над мелочами. Маленькие достижения поднимают настроение",
                "Прежде чем действовать, сделайте паузу и подумайте о чем-нибудь, а не реагируйте импульсивно",
                "Будь настоящим и прими свою уникальность. Жизнь — это не соревнование",
                "Не отзывайся о других негативно весь день",
                "Напиши одну вещь, которую ты сделал для своей семьи",
                "Напиши себе любовное письмо",
                "Напиши 3 страха и как побороть каждый",
                "Определите изменение, которое вы хотите внести, и шаги для его выполнения",
                "Сделай что-нибудь, что заставит тебя чувствовать себя особенным",
                "Попроси трех друзей рассказать тебе о том, что им больше всего нравится в тебе",
                "Запишите 3 свои ошибки и извлеченные уроки",
                "Поставь себе достижимую цель"
            ]
        },
        {
            "challenge_name": "Акт доброты",
            "challenge_description": "Добрый поступок может усилить чувство уверенности, контроля, счастья и оптимизма. Он также может побудить других повторить добрые дела, которые они испытали сами, - способствуя более позитивному сообществу.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/kindness_icon",
            "challenges": [
                "Поддержите кого-нибудь сегодня",
                "Сдай кровь. Спаси жизни",
                "Оставить положительный отзыв о любимом ресторане/кофейне",
                "Приготовить члену семьи/любимому завтрак в постель",
                "Спросите кого-нибудь, как вы можете им помочь, и сделайте это",
                    "Улыбнись тому, кому это нужно",
                "Оставить положительный отзыв о любимом приложении",
                "Дайте чаевые сборщику мусора",
                "Спросите своих родителей/братьев и сестер/детей, можете ли вы чем-нибудь им помочь",
                "Напишите список причин, по которым вы кого-то любите, и дайте его ему",
                "Дайте кому-нибудь чаевые",
                "Проведите день, говоря о людях только хорошее",
                "Скажи тому, кого любишь, как сильно ты его ценишь",
                "Выполняйте работу, которую вы обычно не делаете",
                "Скажи Хорошего дня как минимум трем людям, с которыми ты столкнулся",
                "Купи еды для бомжа",
                "Помоги кому-то, прежде чем он попросит",
                "Испеките печенье и подарите его кому-нибудь",
                "Попробуйте пожертвовать одежду/игрушки/книги местной благотворительной организации",
                "Позвони тому, с кем давно не разговаривал",
                "Самое главное, всегда будь добр к себе",
                "Напишите благодарственное письмо тому, кто оказал влияние на вашу жизнь",
                "Пропусти кого-нибудь впереди себя, пока становишься в очередь",
                "Удиви кого-нибудь подарком",
                "Наклей позитивные стикеры на зеркала",
                "Отметиться у пожилого родственника",
                "Скажи 3 честных комплимента тому, кого любишь",
                "Скажи спасибо, сколько сможешь",
                "Поздравь кого-нибудь",
                "Избегайте негативных мыслей в течение дня. Проявите и к себе немного доброты!"
            ]
        },
        {
            "challenge_name": "Психическое здоровье",
            "challenge_description": "Когда дело доходит до вашего психического здоровья, забота о себе может помочь вам справиться со стрессом, снизить риск заболеваний и увеличить вашу энергию. Даже небольшие акты заботы о себе в вашей повседневной жизни могут иметь большое значение. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/mental_wellness_icon",
            "challenges": [
                "Управлять тревогой",
                "Перед сном напиши 3 вещи, которые тебе понравились за день",
                "Практикуйте самосострадание",
                "Практикуйте осознанность. Верните себя в настоящее",
                "Потратьте время на хобби. Поднимите себе настроение и займитесь делом, которое вам нравится",
                "Сделайте дневной перерыв в социальных сетях и сосредоточьтесь на жизни вокруг вас",
                "Посадите что-нибудь. Забота о чем-то, кроме себя, имеет много умственных преимуществ",
                "Думай о лучших моментах своей жизни, пока чего-то ждешь",
                "Узнайте, как говорить о психическом благополучии со своими родителями, педагогами, друзьями, членами семьи и другими близкими вам людьми",
                    "Расскажи о чем-то, что у тебя на уме",
                "Сосредоточьтесь сегодня на отдыхе и расслаблении и ложитесь спать пораньше",
                "Отправляйтесь на прогулку, не глядя в телефон, сосредоточившись на своем окружении",
                "Представьте себе счастливое место всякий раз, когда вы чувствуете тревогу",
                "Прочитай или посмотри что-нибудь, что полезно для твоего психического здоровья",
                "Представьте жизнь своей мечты и запишите, какие шаги вам нужно пройти, чтобы туда попасть",
                "Практикуйте позитивный разговор с самим собой",
                "Обновите свою мотивацию",
                "Начните исследовать корень любых негативных мыслей",
                "Напишите 5 вещей, за которые вы благодарны",
                "Заботьтесь о себе и балуйте себя",
                "Запишите положительные аффирмации и прочитайте их перед сном",
                "Сделайте 3 полных глубоких вдоха, когда сможете",
                "Планируйте здоровое питание",
                "Поблагодарите того, кого вы цените.",
                "Позвони любимому человеку, с которым давно не разговаривал",
                "Попробуйте управляемую медитацию",
                "Обучитесь новому навыку, чтобы отвлечь свои мысли от проблем и беспокойства",
                "Пишите в дневник все, что происходит в вашей голове",
                "Ешьте питательную пищу.",
                "Спойте свою любимую песню. Пение помогает регулировать дыхание и снижает тревогу"
            ]
        },
        {
            "challenge_name": "Исправьте график сна",
            "challenge_description": "Эти ежедневные задания помогут вам придерживаться здорового режима сна, высыпатьсяр, и просыпаться каждое утро с чувством свежести.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/fix_sleep_schedule_icon",
            "challenges": [
                "Убери телефон, чтобы на следующее утро тебе пришлось встать с постели, чтобы выключить будильник",
                "Выключите все свои экраны за 1 час до сна, чтобы ваш мозг был готов ко сну",
                "Наградите себя вкусным завтраком, чтобы у вас было больше мотивации рано вставать",
                "Душ на ночь, горячий душ или ванна помогут расслабиться перед сном",
                "Старайтесь просыпаться в одно и то же время каждый день, постоянство — это ключ",
                "После ужина наденьте уютную пижаму, заведите дневник, почитайте уголок и приготовьтесь расслабиться и дать своему уму расслабиться",
                "Пейте много воды после пробуждения, вы не будете чувствовать себя слишком уставшим в течение дня",
                "Постарайтесь поужинать пораньше, так как вы переварите пищу раньше, ваше тело сможет сосредоточиться на том, чтобы получить необходимый ему полноценный сон",
                "Проведите быструю утреннюю тренировку/пробежку, это поможет вам чувствовать себя энергичным в течение дня и чувствовать себя сонным, когда вы должны ложиться спать",
                "Медитируйте перед сном, это расслабляет и снижает стресс",
                "Открывайте окна, когда просыпаетесь, и пусть солнечные лучи касаются вашей кожи",
                "Заранее спланируйте свои действия сегодня вечером, а также список дел на следующее утро",
                "Послушайте свой любимый плейлист после пробуждения, чтобы поднять себе настроение",
                "Установите напоминание, которое будет предупреждать вас за 30 минут до того, как пора ложиться спать",
                "Расходуй энергию днем, чтобы ночью уставать",
                "Прекратите пить воду за 1 час до сна, чтобы вам не пришлось просыпаться ночью или вставать, когда вы пытаетесь заснуть",
                "Заправляйте постель после пробуждения, чтобы не было соблазна снова заснуть",
                "Слушайте легкую музыку перед сном, это поможет вам быстрее уснуть",
                "Проснувшись, идите прямо в ванную, чтобы умыться или принять приятный душ",
                "Ешьте продукты, содержащие магний (например, миндаль, арахис и семена тыквы) и цинк, чтобы улучшить качество сна",
                "Вдохните свежий воздух, когда проснетесь. Освежите свои мысли, которые помогут вашему мозгу очиститься утром",
                "Используйте свою кровать только для сна и секса. Не смотрите телевизор",
                "Никакого кофеина за 6 часов до выбранного времени сна",
                "Избегайте больших приемов пищи перед сном",
                "Сделайте свою комнату как можно темнее и тише",
                "Избегайте дневного сна. Это может нарушить ваш цикл сна",
                "Установить прохладную и постоянную температуру",
                "Ложись спать только тогда, когда хочешь спать",
                "Избегайте сложных разговоров перед сном",
                "Постирайте или поменяйте простыни и наволочки"
            ]
        },
        {
            "challenge_name": "Забота о себе",
            "challenge_description": "Забота о себе означает уделять время тому, что помогает вам жить хорошо и улучшает как ваше физическое, так и психическое здоровье.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/self_care_icon",
            "challenges": [
                "Планируй свой день и придерживайся его",
                "Веди дневник, записывай свои эмоции и переживания",
                "Займитесь хобби, которое вам действительно нравится",
                "Прочитай любимую книгу детства",
                "Тренируйся дома. Ищи видео с тренировками на Youtube",
                "Попробуй приготовить что-нибудь новенькое",
                "Поделитесь тем, о чем вы думаете, со своими родителями или друзьями",
                "Создай утреннюю рутину",
                "Позвони родным и друзьям",
                "Решите головоломку",
                "Сделайте арты. Идеи можно найти в интернете",
                "Послушай любимые песни",
                "Играть в настольные игры",
                "Напиши письмо кому-то особенному",
                "Пройдите онлайн-курс, чтобы узнать что-то новое",
                "Смотри новый фильм",
                "Вздремните, чтобы отдохнуть душой и телом",
                "Послушайте какой-нибудь подкаст",
                "Медитируйте, чтобы успокоить свой ум и освободиться от беспокойства",
                "Прими расслабляющую ванну",
                "Поставь цели на будущее",
                "Подпевай любимой песне",
                "Видеочат с тем, кто вам небезразличен",
                "Создайте режим сна",
                "Не жалуюсь",
                "Всегда находите время для молитвы.",
                "Скажи нет негативу",
                "Очистите и организуйте свое место",
                "Поставь цель на следующую неделю",
                "Просите о помощи, если она вам нужна"
            ]
        },
        {
            "challenge_name": "Эффективное исследование",
            "challenge_description": "Узнайте, как стать более успешным в учебе. Установите эффективные и четкие цели, чтобы достичь более высоких оценок, научитесь управлятьсвое время и улучшить свои учебные навыки.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/effective_study_icon",
            "challenges": [
                "Организируй и убери свой стол для учебы",
                "Спланируйте учебную сессию и подготовьте учебные материалы",
                "Преодолейте свои слабости и найдите свою цель и мотивацию в учебе",
                "Изучите свою программу и начните активно заниматься своим курсом",
                "Всегда планируйте свое расписание и делайте заметки",
                "Ручная запись заметок и выделение ключевых слов",
                "Правило 50-10. Изучайте 50 минут каждого часа. Тратьте 10 минут на очистку ума",
                "Просматривайте свои записи перед сном",
                "Установите таймер и сосредоточьтесь исключительно на одной задаче",
                "Учись так, как будто учишь кого-то",
                "Пообещай себе награду, если выполнишь все задания",
                "Используйте цвета и маркеры в своих заметках",
                "Используйте только Google и Youtube, чтобы понять концепции",
                "Ешьте здоровую пищу. Ваше тело почувствует себя лучше, и вы будете более бдительны",
                "Обобщить понятия",
                "Учись вместе со своим другом. Попроси друга проверить тебя по сложным предметам",
                "Посмотрите, что вы узнали сегодня или на этой неделе",
                "Используйте приложения или карточки для лучшего обучения",
                "Расставьте приоритеты в задачах. Выполняйте основные задачи в первую очередь",
                "Используйте интеллект-карту для систематизации информации",
                "Выберите тихое место для занятий, где вас никто не будет отвлекать",
                "Не забывайте снимать стресс. Держите уровень стресса на низком уровне и меньше беспокойтесь",
                "Просмотрите свои заметки, прежде чем приступить к домашнему заданию",
                "Повторно изучите домашние задания, закройте ответы и проверьте себя",
                "Составьте список важных понятий или формул",
                "Сделай себе пробный экзамен",
                "Учись так, как будто завтра экзамен-сюрприз.",
                "Высыпайтесь, так как это значительно способствует сохранению памяти",
                "Ищите методы запоминания, которые эффективно подходят для вашего обучения",
                "Никогда не бойся просить о помощи"
            ]
        },
        {
            "challenge_name": "Парные отношения",
            "challenge_description": "Это испытание на отношения разработано так, чтобы его было легко интегрировать в вашу повседневную жизнь. Многие из испытаний занимают всего несколько минут и могут быть выполнены в любое время в течение дня. Некоторые требуют немного больше энергии и планировать, но оно того стоит.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/couples_relationships_icon",
            "challenges": [
                "Составьте список вещей, которые вам нравятся в вашем партнере",
                "Запланируй свидание-сюрприз",
                "Скажи своему партнеру, что любишь его безоговорочно",
                "Поделитесь страхом, который у вас есть по поводу ваших отношений",
                "Поделитесь хорошим воспоминанием о своем партнере",
                "Отправьте своему партнеру романтическое утреннее сообщение",
                "Поблагодарите своего партнера за что-то сегодня",
                "Удивите своего партнера чем-нибудь хорошим",
                "Поделитесь целью ваших отношений",
                "Сделайте партнеру комплимент",
                "Планируйте выходные",
                "Посмотрим вместе старые картинки",
                "Вспомните, когда вы впервые встретились",
                "Составьте список желаний вместе",
                "Выберите случайное слово и начните глубокий разговор со своим партнером",
                "Собери пазл вместе",
                "Напишите любовное письмо своему партнеру и спрячьте его, чтобы он нашел его позже",
                "Займитесь тем, что вашему партнеру нравится делать вместе",
                "Сделай любимое лакомство",
                "Расскажи своему партнеру что-то, что ты помнишь, что ему нравится",
                "Подарите своему партнеру неожиданный поцелуй и объятие",
                "Сделайте партнеру расслабляющий массаж",
                "Приготовь партнеру завтрак в постель",
                "Поиграем вместе в настольную игру",
                "Спросите его/ее, как вы можете стать лучшим партнером",
                "Оставь ему/ей милую записочку",
                "Погулять вдвоем",
                "Сделайте комплимент своему партнеру сегодня",
                "Пройди тест на отношения",
                "Медленный танец под романтическую песню"
            ]
        },
        {
            "challenge_name": "Навести порядок",
            "challenge_description": "Сокращение беспорядка в нашей жизни — будь то физический, цифровой или любой другой — позволяет нам бороться со стрессом, и это приносит пользу нашему психическому здоровью.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/declutter_icon",
            "challenges": [
                "Очистите свой шкаф",
                "Организуйте свои книги",
                "Организируй свою спальню",
                "Убери свою тумбочку",
                "Разбери свою почту",
                "Организируй свою кладовую",
                "Пожертвовать неиспользованную одежду",
                "Очистить место на вашем компьютере или ноутбуке",
                "Почистите холодильник и избавьтесь от просроченных продуктов",
                "Клетвоя машина",
                "Пройтись по старым бумагам и почте",
                "Опустоши морозилку",
                "Очисти свой кошелек",
                "Организуй свою кухню",
                "Освободите свой стол или рабочее место",
                "Избавься от старой одежды",
                "Организируйте свои чистящие средства",
                "Организируй свой комод",
                "Удалите приложения, которыми вы больше не пользуетесь",
                "Очистить аптечки",
                "Организуйте все по папкам на вашем компьютере",
                "Организируй свою гостиную",
                "Купить функциональные предметы хранения",
                "Очистить личные аксессуары",
                "Потратьте время на чистку автомобиля/мотоцикла/велосипеда",
                "Обновите и организуйте свой календарь",
                "Убрать отмершие растения и привести в порядок горшки",
                "Организируйте сухие товары (специи) и уберите просроченные товары",
                "Организация и маркировка контейнеров и полок для хранения",
                "Медитируйте, чтобы очистить свой разум"
            ]
        },
        {
            "challenge_name": "Производительность",
            "challenge_description": "Хорошая производительность может помочь вам ставить более точные цели, быть более эффективным, повышать концентрацию и повышать мотивацию.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/productivity_icon",
            "challenges": [
                "Заправляй утром свою постель, чтобы не было соблазна вернуться в постель",
                "Каждый день записывайте 3 вещи, за которые вы благодарны",
                "Организуйте захламленное пространство, чтобы улучшить рабочее место",
                "Меньше времени разговаривайте по телефону и работайте продуктивнее",
                "Используйте ежедневник, чтобы достичь всего, что вы запланировали",
                "Отключите ненужные уведомления на телефоне, чтобы не отвлекаться",
                "Составьте план питания на всю неделю",
                "Составьте список дел и постарайтесь выполнить все задачи",
                "Совершите 30-минутную прогулку, подышите свежим воздухом и почувствуйте мотивацию покорить мир",
                "Наведите порядок в почтовом ящике. Иногда это может быть немного сложно",
                "Занимайтесь спортом в течение 30 минут, даже если вы ничего не делаете в течение дня, после тренировки вы почувствуете себя очень продуктивно",
                "Прочитайте главу книги перед сном, чтобы забыть о социальных сетях",
                "Избегайте смотреть телевизор, чтобы у вас было больше времени для себя",
                "Наведите порядок в шкафу и отдайте вещи, которые вам больше не нужны",
                "Создайте музыкальный плейлист с вашими любимыми песнями и танцевальной линией, на которую никто не смотрит",
                "Не проверяйте свой телефон сразу после того, как проснетесь и проведите медленное и спокойное утро",
                "Помедитируйте 10 минут, и вы почувствуете себя помолодевшим",
                "Организируйте свою кладовую и холодильник.",
                "Глубоко очистите свою комнату. Чистое пространство, ясный разум",
                "Отпишитесь от людей, которые больше не приносят вам радости. Вам станет намного легче",
                "Запланируйте период отдыха в течение дня, чтобы иметь время расслабиться",
                "Просыпайтесь раньше, чем обычно. Успешные люди начинают свой день рано",
                "Чтение мотивирующих и вдохновляющих книг поможет вам вернуть веру в себя",
                "Хватит пытаться выполнять несколько задач одновременно",
                "Составьте список вещей, которые вы хотите перестать делать",
                "Двигайся. Иди. Потянись. Сядьте прямо",
                "Записывайте идеи, которые приходят вам в голову, но не начинайте над ними работать. Запланируйте их",
                "Наслаждайтесь здоровым завтраком, чтобы зарядиться энергией на весь день",
                "Когда закончишь что-то, пусть даже маленькое, запиши это",
                "Делегируйте. Вы не обязаны делать все"
            ]
        },
        {
            "challenge_name": "Счастье",
            "challenge_description": "Научные исследования показывают, что счастье связано с множеством преимуществ, включая более высокую производительность, большую креативность и большую устойчивость перед лицом стресса.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/happiness_icon",
            "challenges": [
                "Напишите, что вам в себе нравится",
                "Улыбайтесь всем, мимо кого проходите",
                "Немного поупражняться",
                "Приготовить ужин",
                "Обними того, кого любишь",
                "Посмотри комедийный фильм",
                "Позвонить другу",
                "Танцуй так, как будто никто не смотрит",
                "Выйдите на природу и станьте исследователем на один день",
                "Купи подарок любимому человеку",
                "Попробуйте заняться йогой",
                "Рано ложиться спать и рано вставать",
                "Читай что-нибудь вдохновляющее",
                "Медитация 10 минут",
                "Планируйте будущий отпуск",
                "Попробуйте новый рецепт или приготовьте любимое блюдо",
                "Наблюдай за красивым закатом",
                "Свяжись со своим старым другом",
                "Простить кого-то",
                "Попробуй что-нибудь новое",
                "Выйти на улицу погулять",
                "Послушай свою любимую песню",
                "Сделай одно маленькое доброе дело или помоги другу или соседу",
                "Посмеяться с кем-нибудь",
                "Обнимите своих детей/родителей/друзей/братьев и сестер",
                "Поиграй со своей собакой или другими домашними животными",
                "Меньше времени проводите в телефоне",
                "Расскажи людям, как много они для тебя значат",
                "Отпустить токсичных людей и привычки",
                "Подумайте о своем путешествии с первого дня"
            ]
        },
        {
            "challenge_name": "Вызов финансовой свободы",
            "challenge_description": "Одним из важнейших преимуществ финансовой независимости является то, что она дает вам больший контроль над собственной жизнью. ",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/financial_freedom_icon",
            "challenges": [
                "Определить свои финансовые цели",
                "Создать бюджет на следующий месяц",
                "Разработать резервный фонд",
                "Откройте для себя финансовые веб-сайты и блоги",
                "Откладывай на пенсию",
                "Найди видеоблоги по финансовой грамотности на Youtube",
                "Принять минимализм",
                "Купите книгу о деньгах и начните ее читать",
                "Подумайте о своей карьере",
                "Автоматизируй свои деньги",
                "Контролируйте свой кредитный рейтинг",
                "Рассчитывайте свои деньги",
                "Найдите способы сократить расходы на продукты",
                "Учимся считать проценты",
                "Исследуйте способы дополнительного заработка",
                "Продай то, что тебе не нужно/не используешь",
                "Подробнее об инвестировании",
                "Найдите стратегию предотвращения эмоциональных расходов",
                "День без трат",
                "Напишите план накоплений на будущие покупки",
                "Ищите способы сократить счета",
                "Читайте об управлении капиталом",
                "Изучите основные финансовые термины",
                "Узнайте, как работают кредитные карты",
                "Напишите план погашения долга",
                "Найдите способы минимизировать второстепенные расходы",
                "Автоматизируйте свои счета",
                "Отмечайте свой прогресс",
                "Запишитесь на курсы финансовой грамотности",
                "Оставайтесь на пути к финансовой свободе"
            ]
        },
        {
            "challenge_name": "Позитивное воспитание",
            "challenge_description": "Практика позитивного воспитания является важным руководством в отношениях родителей и детей для достижения положительных результатов в развитии, таких как самооценка, доверие, самокомпетентность, более тесная связь между родителями и детьми, а также более эффективное и эффективное общение",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/positive_parenting_icon",
            "challenges": [
                "Сделайте со своим ребенком что-нибудь, что, как вы знаете, ему понравится",
                "Спросите своего ребенка, что ему больше всего нравится",
                "Сделайте с детьми поделку, например, нашу бабочку из бумажной тарелки",
                "Проведите не менее 30 минут один на один со своим ребенком",
                "Читай сказку на ночь",
                "Погулять вдвоем",
                "Обними сегодня своего ребенка четыре раза",
                "Приготовьте ребенку то, что ему нравится",
                "Сфотографируйтесь вместе или даже сделайте фотобудку своими руками",
                "Спросите своего ребенка, чем бы он особенно хотел заниматься",
                "Возьми их в любимое место",
                "Сделай вместе Счастливую коробку",
                "Сочините рассказ вместе. Предложите ребенку нарисовать картинки",
                "Сделай вместе отпечатки ладоней",
                "Научите ребенка делать что-то новое уже сегодня",
                "Научите ребенка обращаться с деньгами",
                "Включите музыку и танцуйте вместе",
                "Сделай семейную настольную игру",
                "Купите для них небольшой подарок и спрячьте его в доме, чтобы они его нашли",
                "Испечь кексы или Приготовить блины и отнести их соседу",
                "Сделайте открытку для другого родителя вместе",
                "Говори сегодня о своем ребенке позитивно",
                "Спросите их, о чем они думают",
                "Спросите их любимое животное и сделайте вместе веселый проект",
                "Научите ребенка жизненному навыку",
                "Отправляйтесь на прогулку на природу. Соберите предметы из списка",
                "Проведите цветной день. Одевайтесь в цвет, ешьте продукты такого цвета",
                "Сделай забавную поделку для бабушек и дедушек",
                "Поиграйте вместе с пластилином. Устройте соревнования по лепке",
                "Спросите у ребенка, какое воспоминание ему больше всего нравится. Планируйте повторить это еще раз"
            ]
        },
        {
            "challenge_name": "Преодолеть депрессию",
            "challenge_description": "Это задание поможет вам преодолеть депрессию и напомнит вам, что есть большая надежда на исцеление. Депрессия хорошо поддается лечению. Многие люди, переживающие депрессию, полностью выздоравливают. Другие находят некоторое облегчение своих симптомов. Борьба стоит того - способность процветать в жизнипосле депрессии.",
            "emoji": "android.resource://com.waleed.habitualize.public/drawable/overcome_depression_icon",
            "challenges": [
                "Прикосновения очень важны для лечения депрессии. Гладьте домашних животных, обнимайте друзей и членов семьи, возобновляйте секс с партнером или делайте массаж",
                    "Выйди на улицу на 15 минут физической активности. Попробуй побегать. Убери двор. Прогуляйся со своим питомцем",
                "Диета может сыграть огромную роль в облегчении депрессии. Убедитесь, что вы хорошо и регулярно питаетесь, даже если у вас нет аппетита",
                "Выспаться",
                "Улыбнитесь и измените позу, чтобы изменить самочувствие",
                "Прочитайте положительные примеры того, как люди преодолевали проблемы с психическим здоровьем, и знайте, что это возможно и для вас",
                    "Забудьте о будущем и прошлом. Спросите себя: Прямо сейчас, прямо здесь, в этот самый момент, что не так?",
                "Принимайте добавки с витаминами, чтобы увеличить количество гормонов счастья. Недостаток витамина B3 и витамина D, которые вырабатываются в коже под действием солнечного света, также связан с депрессией",
                    "Прислушайтесь к своему внутреннему голосу. Он резкий или критический? Вы бы относились к другим с таким же суждением? Эти мысли конструктивны или деструктивны?",
                "Удостоверьтесь, что вы выходите на улицу каждый день, так как дневной свет и солнечный свет повышают уровень серотонина, который необходим для витамина D",
                "Не стыдитесь. Возможно, вы удивитесь, узнав, как много людей молча страдают от депрессии. Поговорите со своей семьей и друзьями.",
                "Прекратить оскорбительные отношения",
                "Проведите время со своим питомцем",
                "Ты сильнее своей депрессии",
                "Слушай музыку каждый день",
                "Делайте то, что когда-то делало вас счастливым, даже если вам этого не хочется",
                "Избегайте изоляции",
                "Смех — важное противоядие от депрессии",
                "Делай то что любишь",
                "Избегайте алкоголя и наркотиков",
                "Найдите возможность стать волонтером, чтобы не чувствовать себя одиноким",
                "Знайте, когда вступать или выходить из онлайн-мира",
                "Найди что-то, чего можно с нетерпением ждать",
                "Делайте противоположное тому, что предлагает голос депрессии",
                "Находите маленькие способы быть полезными другим",
                "Не зацикливайтесь на проблемах. Вместо этого сосредоточьтесь на правильном решении",
                "Имейте выполнимые цели, чтобы дать вам чувство выполненного долга",
                "Будь благодарен и замечай 3 хороших вещи в каждом дне",
                "Попросите любимого человека регулярно проверять вас.",
                "Бросьте вызов негативным мыслям"
            ]
        }
    ]
}